
                                                            <li id="user_review_5559195" class="review user_review first_review">
                    <div class="review_btm review_btm_r"><div class="review_btm review_btm_l"><div class="review_top review_top_r"><div class="review_top review_top_l">
                        <div class="review_content">
                            <div class="review_section">
                                <div class="review_stats">
                                    <div class="review_critic">
                                        <div class="name">
                                                                                            <a href="/user/sleeplust">sleeplust</a>
                                                                                                                                </div>

                                                                                    <div class="date">Oct 17, 2015</div>
                                                                            </div>
                                    
                                    <div class="review_grade">
                                                
<div class="metascore_w user medium game positive indiv">8</div>

                                    </div>
                                </div>
                                <div class="review_body">
                                                        
                                        <span class="inline_expand_collapse inline_collapsed" id="review_blurb_5559195"><span class="blurb blurb_collapsed">&#x76EE;&#x524D;&#x597D;&#x50CF;&#x53EA;&#x901A;&#x5173;&#x4E86;&#x5927;&#x7EA6;1/3&#x4E0D;&#x5230;&#xFF0C;&#x666E;&#x901A;&#x96BE;&#x5EA6;&#xFF0C;&#x7B97;&#x662F;&#x5BF9;&#x6E38;&#x620F;&#x6574;&#x4F53;&#x6709;&#x4E86;&#x57FA;&#x672C;&#x7684;&#x8BA4;&#x8BC6;&#x3002;
<br>&#x753B;&#x9762;&#xFF1A;
<br>&#x5B9E;&#x673A;&#x753B;&#x9762;&#x5E76;&#x4E0D;&#x50CF;&#x5BA3;&#x4F20;&#x89C6;&#x9891;&#x4E2D;&#x90A3;&#x822C;&#x5149;&#x602A;&#x9646;&#x79BB;&#xFF0C;&#x6574;&#x4F53;&#x4E0A;&#x8FD8;&#x662F;&#x6BD4;&#x8F83;&#x6E05;&#x6670;&#x6613;&#x61C2;&#x548C;&#x6613;&#x4E8E;&#x63A5;&#x53D7;&#x7684;&#xFF0C;&#x8FD9;&#x6837;&#x7684;&#x753B;&#x9762;&#x98CE;&#x683C;&#x5012;&#x662F;&#x6BD4;&#x8F83;&#x8BA8;&#x5DE7;&#x7684;&#x907F;&#x5F00;&#x4E86;&#x9AD8;&#x96BE;&#x5EA6;&#x7684;&#x771F;&#x5B9E;&#x5316;&#x7684;&#x8D34;&#x56FE;&#x6E32;&#x67D3;&#x548C;&#x5149;&#x7167;&#x6A21;&#x62DF;&#xFF0C;&#x5F53;&#x7136;&#xFF0C;&#x8FD9;&#x6837;&#x7684;&#x98CE;&#x683C;&#x662F;&#x548C;&#x6E38;&#x620F;&#x5267;&#x60C5;&#x548C;&#x6E38;&#x620F;&#x6027;&#x90E8;&#x5206;&#x76F8;&#x8F85;&#x76F8;&#x6210;&#x7684;&#xFF1A;&#x5927;&#x80C6;&#x7C97;&#x72B7;&#x7684;&#x5267;&#x60C5;&#x548C;&#x7406;&#x60F3;&#x5316;&#xFF0C;&#x8138;&#x8C31;&#x5316;&#x7684;&#x4EBA;&#x8BBE;&#x662F;&#x8FD9;&#x4E2A;&#x6E38;&#x620F;&#x7684;&#x6838;&#x5FC3;&#x8BBE;&#x8BA1;&#xFF0C;&#x753B;&#x9762;&#x53EA;&#x662F;&#x8868;&#x8C61;&#x3002;
&#x5267;&#x60C5;&#xFF1A;
&#x4E3B;&#x89D2;&#x662F;&#x4E2A;&#x96C7;&#xFF08;&#x8F6F;&#xFF09;&#x4F63;&#xFF08;&#x996D;&#xFF09;&#x6740;&#xFF08;&#x738B;&#xFF09;&#x624B;&#xFF0C;&#x5267;&#x60C5;&#x6CA1;&#x6709;&#x94FA;&#x57AB;&#xFF0C;&#x4E5F;&#x4E0D;&#x9700;&#x8981;&#x94FA;&#x57AB;&#xFF08;&#x5199;&#x5230;&#x8FD9;&#x91CC;&#x6211;&#x7279;&#x610F;&#x767E;&#x6BD2;&#x4E86;&#x4E00;&#x4E0B;&#x4E3B;&#x521B;&#x987B;&#x7530;&#x521A;&#x4E00;&#xFF0C;&#x53D1;&#x73B0;&#x6709;&#x53E6;&#x4E00;&#x4E2A;&#x4F5C;&#x54C1;&#x300A;&#x6740;&#x624B;7&#x300B;&#xFF0C;&#x753B;&#x9762;&#x98CE;&#x683C;&#x7C7B;&#x4F3C;&#xFF0C;&#x8FD9;&#x4E5F;&#x8BB8;&#x5C31;&#x662F;&#x524D;&#x4F20;&#x6216;&#x94FA;&#x57AB;&#x5427;&#x3002;&#xFF09;&#xFF0C;&#x5C31;&#x50CF;&#x90A3;&#x8BE1;&#x5F02;&#x7684;&#x753B;&#x9762;&#x98CE;&#x683C;&#x4E00;&#x822C;&#xFF0C;&#x4EFF;&#x4F5B;&#x91CD;&#x590D;&#x7740;&#x4E3B;&#x521B;&#x987B;&#x7530;&#x521A;&#x4E00;&#x7684;&#x8BDD;&#xFF1A;&#x201C;&#x8FD9;&#x5C31;&#x662F;&#x6211;&#x7684;&#x98CE;&#x683C;&#xFF0C;&#x4F60;&#x6CA1;&#x5F97;&#x9009;&#x62E9;&#x3002;&#x201D;&#x8499;&#x591A;&#xB7;&#x624E;&#x5E15;&#xFF08;Mondo</span><span class="blurb blurb_expanded">&#x76EE;&#x524D;&#x597D;&#x50CF;&#x53EA;&#x901A;&#x5173;&#x4E86;&#x5927;&#x7EA6;1/3&#x4E0D;&#x5230;&#xFF0C;&#x666E;&#x901A;&#x96BE;&#x5EA6;&#xFF0C;&#x7B97;&#x662F;&#x5BF9;&#x6E38;&#x620F;&#x6574;&#x4F53;&#x6709;&#x4E86;&#x57FA;&#x672C;&#x7684;&#x8BA4;&#x8BC6;&#x3002;
<br>&#x753B;&#x9762;&#xFF1A;
<br>&#x5B9E;&#x673A;&#x753B;&#x9762;&#x5E76;&#x4E0D;&#x50CF;&#x5BA3;&#x4F20;&#x89C6;&#x9891;&#x4E2D;&#x90A3;&#x822C;&#x5149;&#x602A;&#x9646;&#x79BB;&#xFF0C;&#x6574;&#x4F53;&#x4E0A;&#x8FD8;&#x662F;&#x6BD4;&#x8F83;&#x6E05;&#x6670;&#x6613;&#x61C2;&#x548C;&#x6613;&#x4E8E;&#x63A5;&#x53D7;&#x7684;&#xFF0C;&#x8FD9;&#x6837;&#x7684;&#x753B;&#x9762;&#x98CE;&#x683C;&#x5012;&#x662F;&#x6BD4;&#x8F83;&#x8BA8;&#x5DE7;&#x7684;&#x907F;&#x5F00;&#x4E86;&#x9AD8;&#x96BE;&#x5EA6;&#x7684;&#x771F;&#x5B9E;&#x5316;&#x7684;&#x8D34;&#x56FE;&#x6E32;&#x67D3;&#x548C;&#x5149;&#x7167;&#x6A21;&#x62DF;&#xFF0C;&#x5F53;&#x7136;&#xFF0C;&#x8FD9;&#x6837;&#x7684;&#x98CE;&#x683C;&#x662F;&#x548C;&#x6E38;&#x620F;&#x5267;&#x60C5;&#x548C;&#x6E38;&#x620F;&#x6027;&#x90E8;&#x5206;&#x76F8;&#x8F85;&#x76F8;&#x6210;&#x7684;&#xFF1A;&#x5927;&#x80C6;&#x7C97;&#x72B7;&#x7684;&#x5267;&#x60C5;&#x548C;&#x7406;&#x60F3;&#x5316;&#xFF0C;&#x8138;&#x8C31;&#x5316;&#x7684;&#x4EBA;&#x8BBE;&#x662F;&#x8FD9;&#x4E2A;&#x6E38;&#x620F;&#x7684;&#x6838;&#x5FC3;&#x8BBE;&#x8BA1;&#xFF0C;&#x753B;&#x9762;&#x53EA;&#x662F;&#x8868;&#x8C61;&#x3002;
<br>&#x5267;&#x60C5;&#xFF1A;
<br>&#x4E3B;&#x89D2;&#x662F;&#x4E2A;&#x96C7;&#xFF08;&#x8F6F;&#xFF09;&#x4F63;&#xFF08;&#x996D;&#xFF09;&#x6740;&#xFF08;&#x738B;&#xFF09;&#x624B;&#xFF0C;&#x5267;&#x60C5;&#x6CA1;&#x6709;&#x94FA;&#x57AB;&#xFF0C;&#x4E5F;&#x4E0D;&#x9700;&#x8981;&#x94FA;&#x57AB;&#xFF08;&#x5199;&#x5230;&#x8FD9;&#x91CC;&#x6211;&#x7279;&#x610F;&#x767E;&#x6BD2;&#x4E86;&#x4E00;&#x4E0B;&#x4E3B;&#x521B;&#x987B;&#x7530;&#x521A;&#x4E00;&#xFF0C;&#x53D1;&#x73B0;&#x6709;&#x53E6;&#x4E00;&#x4E2A;&#x4F5C;&#x54C1;&#x300A;&#x6740;&#x624B;7&#x300B;&#xFF0C;&#x753B;&#x9762;&#x98CE;&#x683C;&#x7C7B;&#x4F3C;&#xFF0C;&#x8FD9;&#x4E5F;&#x8BB8;&#x5C31;&#x662F;&#x524D;&#x4F20;&#x6216;&#x94FA;&#x57AB;&#x5427;&#x3002;&#xFF09;&#xFF0C;&#x5C31;&#x50CF;&#x90A3;&#x8BE1;&#x5F02;&#x7684;&#x753B;&#x9762;&#x98CE;&#x683C;&#x4E00;&#x822C;&#xFF0C;&#x4EFF;&#x4F5B;&#x91CD;&#x590D;&#x7740;&#x4E3B;&#x521B;&#x987B;&#x7530;&#x521A;&#x4E00;&#x7684;&#x8BDD;&#xFF1A;&#x201C;&#x8FD9;&#x5C31;&#x662F;&#x6211;&#x7684;&#x98CE;&#x683C;&#xFF0C;&#x4F60;&#x6CA1;&#x5F97;&#x9009;&#x62E9;&#x3002;&#x201D;&#x8499;&#x591A;&#xB7;&#x624E;&#x5E15;&#xFF08;Mondo Zappa&#xFF09;&#x8FD9;&#x4E2A;&#x540D;&#x5B57;&#x6709;&#x70B9;&#x610F;&#x5927;&#x5229;&#x98CE;&#x5473;&#xFF0C;&#x5374;&#x53C8;&#x5F88;&#x9002;&#x5408;&#x65E5;&#x672C;&#x4EBA;&#x5FF5;&#x51FA;&#x3002;&#x76EE;&#x524D;&#x6211;&#x9047;&#x5230;&#x7684;&#x4E3B;&#x8981;&#x7684;&#x7455;&#x75B5;&#x4E4B;&#x4E00;&#x5C31;&#x662F;&#x6E38;&#x620F;&#x89D2;&#x8272;&#x8BF4;&#x8BDD;&#x65F6;&#x7684;&#x53E3;&#x578B;&#x662F;&#x82F1;&#x8BED;&#x7684;&#xFF08;&#x82F1;&#x8BED;&#x914D;&#x97F3;&#x4E5F;&#x4E0D;&#x9519;&#xFF09;&#xFF0C;&#x53EF;&#x6211;&#x4E3A;&#x4E86;&#x4E00;&#x4E2A;&#x7F6E;&#x9C87;&#x9F99;&#x592A;&#x90CE;&#x7684;&#x540D;&#x53F7;&#x5C31;&#x9009;&#x62E9;&#x4E86;&#x65E5;&#x8BED;&#x8BED;&#x97F3;&#xFF0C;&#x6BD5;&#x7ADF;&#x6574;&#x4F53;&#x6E38;&#x620F;&#x5267;&#x60C5;&#x548C;&#x5BF9;&#x8BDD;&#x7684;&#x98CE;&#x683C;&#x4E5F;&#x662F;&#x65E5;&#x5F0F;&#x7684;&#xFF0C;&#x201C;&#x4E14;&#x5E93;&#x59B9;&#x6258;&#x201D;&#xFF0C;&#x201C;keela yis deddo&#x201D;&#x8FD9;&#x6837;&#x7684;&#x548C;&#x98CE;&#x82F1;&#x8BED;&#x4E5F;&#x4E0D;&#x7A81;&#x5140;&#xFF0C;&#x914D;&#x97F3;&#x5F88;&#x4E13;&#x4E1A;&#xFF0C;&#x4F46;&#x662F;&#x53E3;&#x578B;&#x5374;&#x6CA1;&#x53D8;&#xFF0C;&#x8BED;&#x97F3;&#x548C;&#x53E3;&#x578B;&#x7684;&#x6301;&#x7EED;&#x65F6;&#x95F4;&#x4E0D;&#x7EDF;&#x4E00;&#x7684;&#x60C5;&#x51B5;&#x5F88;&#x5E38;&#x89C1;&#x3002;
<br>&#x4EBA;&#x8BBE;&#xFF1A;
<br>&#x4E3B;&#x89D2;&#xFF0C;&#x7F8E;&#x56FD;&#x4EBA;&#x8499;&#x591A;&#x7684;&#x5DF4;&#x638C;&#x8138;&#x4E0A;&#x6709;&#x7740;&#x4E00;&#x526F;&#x5178;&#x578B;&#x7684;&#x201C;&#x9738;&#x9053;&#x603B;&#x88C1;&#x201D;&#x5F0F;&#x7684;&#xFF0C;&#x4E1C;&#x65B9;&#x5316;&#x7684;&#x4E94;&#x5B98;&#xFF0C;&#x914D;&#x4E0A;&#x957F;&#x65B9;&#x5F62;&#x7684;&#x65AF;&#x6587;&#x773C;&#x955C;&#xFF0C;&#x4ED6;&#x548C;&#x5468;&#x6E1D;&#x6C11;&#x76F8;&#x6BD4;&#x8C01;&#x7684;&#x989C;&#x503C;&#x66F4;&#x9AD8;&#xFF08;&#x66F4;&#x6709;gigolo&#x8303;&#xFF09;&#x662F;&#x4E2A;&#x4E0D;&#x9519;&#x7684;&#x8BDD;&#x9898;&#x3002;&#x503C;&#x5F97;&#x5938;&#x5956;&#x7684;&#x662F;&#x4E00;&#x4F17;&#x5973;&#x914D;&#x89D2;&#x7684;&#x5916;&#x5F62;&#x8BBE;&#x8BA1;&#xFF0C;&#x8138;&#x5F62;&#x6709;&#x5973;&#x795E;&#x5316;&#x7684;&#x4E2D;&#x957F;&#x8138;&#x4E5F;&#x6709;&#x65E5;&#x5F0F;&#x7684;&#x5C0F;&#x5706;&#x8138;&#xFF0C;&#x4F46;&#x662F;&#x5176;&#x4E2D;&#x5168;&#x65E0;&#x67D0;F&#x7237;&#x7684;&#x6A2A;&#x5411;&#x957F;&#x98A7;&#x9AA8;&#x5E26;&#x6765;&#x7684;&#x4F2A;&#x86C7;&#x7CBE;&#x8138;&#xFF0C;&#x4E5F;&#x6CA1;&#x6709;&#x67D0;&#x65E5;&#x672C;&#x5356;&#x8089;&#x6E38;&#x620F;DOA&#x91CC;&#x7684;&#x5A74;&#x513F;&#x80A5;&#x5851;&#x6599;&#x8138;&#xFF0C;&#x66F4;&#x4E0D;&#x7528;&#x62C5;&#x5FC3;&#x8FD9;&#x4E2A;&#x6E38;&#x620F;&#x91CC;&#x4F1A;&#x51FA;&#x73B0;&#x67D0;YM&#x90A3;&#x6837;&#x7684;&#x7C97;&#x58EE;&#x4E0B;&#x988C;&#xFF0C;&#x800C;&#x4E14;&#x96BE;&#x80FD;&#x53EF;&#x8D35;&#x7684;&#x662F;&#x5176;&#x4E2D;&#x6CA1;&#x6709;&#x6700;&#x7EC8;&#x5E7B;&#x60F3;&#x4E2D;&#x7EFF;&#x8336;&#x5973;&#x8868;&#x65E2;&#x89C6;&#x611F;&#x5341;&#x8DB3;&#x7684;&#x505A;&#x620F;&#x75D5;&#x8FF9;&#x3002;&#x53EF;&#x4EE5;&#x8BF4;&#x5728;&#x4F17;&#x591A;&#x504F;&#x5199;&#x5B9E;&#x7684;&#x753B;&#x9762;&#x98CE;&#x683C;&#x4E2D;&#xFF0C;&#x6740;&#x624B;&#x5DF2;&#x6B7B;&#x7684;&#x4EBA;&#x8BBE;&#x4E0D;&#x4E00;&#x5B9A;&#x662F;&#x6700;&#x597D;&#xFF0C;&#x4F46;&#x53EF;&#x4EE5;&#x8BF4;&#x662F;&#x6700;&#x6F02;&#x4EAE;&#x7684;&#xFF0C;&#x81F3;&#x5C11;&#x6211;&#x6CA1;&#x60F3;&#x8D77;&#x66F4;&#x7F8E;&#x5F62;&#x7684;&#x4F8B;&#x5B50;&#x3002;
<br>&#x64CD;&#x4F5C;&#xFF1A;
<br>&#x4E2D;&#x89C4;&#x4E2D;&#x77E9;&#xFF0C;&#x4E4B;&#x524D;&#x6211;&#x66FE;&#x7ECF;&#x5410;&#x69FD;&#x8FC7;&#x65E5;&#x672C;&#x4EBA;&#x505A;&#x7684;&#x6E38;&#x620F;&#x6216;&#x65E5;&#x672C;&#x4EBA;&#x505A;&#x4E1C;&#x5BB6;&#x53D1;&#x884C;&#x7684;&#x6E38;&#x620F;&#x4F5C;&#x54C1;&#x7684;&#x89C6;&#x89D2;&#x548C;&#x952E;&#x9F20;&#x64CD;&#x4F5C;&#x5F80;&#x5F80;&#x6709;&#x95EE;&#x9898;&#xFF0C;&#x800C;&#x8FD9;&#x6B21;&#x867D;&#x8BF4;&#x65E5;&#x672C;&#x4EBA;&#x662F;&#x4E3B;&#x521B;&#xFF0C;&#x4F46;&#x6B27;&#x6D32;&#x4EBA;&#x662F;&#x4E1C;&#x5BB6;&#xFF0C;&#x6216;&#x8BB8;&#x65E5;&#x672C;&#x4EBA;&#x4E5F;&#x5C31;&#x4E0D;&#x592A;&#x6562;&#x6709;&#x610F;&#x505A;&#x574F;PC&#x7248;&#x7684;&#x64CD;&#x4F5C;&#x4E86;&#x3002;&#x4E0D;&#x80FD;&#x968F;&#x610F;&#x8DF3;&#x5176;&#x5B9E;&#x662F;&#x4E2A;&#x4F18;&#x70B9;&#xFF0C;&#x4E71;&#x8E66;&#x4E71;&#x8DF3;&#x7684;&#x53CD;&#x800C;&#x6709;&#x635F;&#x201C;&#x9738;&#x9053;&#x603B;&#x88C1;&#x201D;&#x7684;&#x7A33;&#x91CD;&#x5F62;&#x8C61;&#xFF08;&#x53EA;&#x662F;&#x6709;&#x65F6;&#x4ECE;&#x5E73;&#x5730;&#x4E0A;&#x53F0;&#x9636;&#x7684;&#x65F6;&#x5019;&#x7565;&#x6709;&#x4E0D;&#x4FBF;&#xFF09;&#xFF0C;&#x89C6;&#x91CE;&#x8FD8;&#x7B97;&#x5F00;&#x9614;&#xFF0C;&#x800C;&#x4E14;&#x6CA1;&#x6709;MGRR&#x91CC;&#x90A3;&#x6837;&#x6076;&#x5FC3;&#x7684;&#x955C;&#x5934;&#x81EA;&#x52A8;&#x8D34;&#x5730;&#x548C;&#x4E0D;&#x5408;&#x65F6;&#x5B9C;&#x7684;&#x8FC7;&#x80A9;&#x89C6;&#x89D2;&#xFF0C;&#x64CD;&#x4F5C;&#x5EF6;&#x8FDF;&#x4E0D;&#x9AD8;&#xFF0C;&#x53EF;&#x4EE5;&#x8BA9;&#x73A9;&#x5BB6;&#x7545;&#x5FEB;&#x81EA;&#x5982;&#x7684;&#x8FDB;&#x884C;&#x89C2;&#x5BDF;&#x3002;
<br>&#x754C;&#x9762;&#xFF1A;
<br>&#x534E;&#x800C;&#x4E0D;&#x5B9E;&#xFF0C;&#x6742;&#x4E71;&#x96BE;&#x61C2;&#xFF0C;&#x6309;&#x952E;&#x4E0D;&#x5408;&#x7406;&#x3002;
<br>&#x7531;&#x4E8E;PC&#x7248;&#x672C;&#x51FA;&#x7684;&#x665A;&#x6291;&#x6216;&#x662F;&#x8BBE;&#x8BA1;&#x8005;&#x6709;&#x610F;&#x4E3A;&#x4E4B;&#xFF0C;&#x64CD;&#x4F5C;&#x754C;&#x9762;&#x4E2D;&#x6709;&#x65F6;&#x4F1A;&#x6709;&#x201C;&#x9009;&#x9879;&#x5361;&#x201D;&#x6837;&#x5F0F;&#x7684;UI&#xFF0C;&#x597D;&#x50CF;&#x5B57;&#x6BCD;R&#x662F;&#x9009;&#x62E9;&#x53F3;&#x8FB9;&#x7684;&#x9009;&#x9879;&#x5361;&#xFF0C;&#x518D;&#x9009;&#x56DE;&#x5DE6;&#x8FB9;&#x7684;&#x5374;&#x8981;&#x6309;Shift&#xFF01;&#x540E;&#x9000;&#x56DE;&#x4E0A;&#x4E00;&#x5C42;&#x754C;&#x9762;&#x662F;&#x7A7A;&#x683C;&#xFF0C;&#x7565;&#x8FC7;&#x8FC7;&#x573A;&#x753B;&#x9762;&#x662F;ESC&#xFF0C;&#x6709;&#x65F6;&#x5019;&#x9700;&#x8981;&#x7528;&#x9F20;&#x6807;&#x6ED1;&#x8F6E;&#x9009;&#x62E9;&#x9009;&#x9879;&#xFF0C;&#x6709;&#x65F6;&#x5019;&#x5374;&#x53C8;&#x8981;&#x7528;&#x5230;&#x952E;&#x76D8;&#x7684;&#x65B9;&#x5411;&#x952E;&#xFF0C;&#x786E;&#x8BA4;&#x952E;&#x662F;&#x9F20;&#x6807;&#x5DE6;&#x952E;&#xFF0C;&#x800C;&#x5728;&#x5F00;&#x573A;&#x52A8;&#x753B;&#x5374;&#x8FD8;&#x8981;&#x7528;&#x5230;&#x56DE;&#x8F66;&#x952E;&#xFF01;&#x597D;&#x5728;&#x6E38;&#x620F;&#x5185;&#x7684;&#x6218;&#x6597;&#x6309;&#x952E;&#x65B9;&#x9762;&#xFF0C;&#x6211;&#x8FD8;&#x6CA1;&#x9047;&#x5230;&#x4EC0;&#x4E48;&#x8BA9;&#x4EBA;&#x607C;&#x7684;&#x8BBE;&#x7F6E;&#x3002;
<br>&#x754C;&#x9762;&#x7684;&#x7F8E;&#x672F;&#x8BBE;&#x8BA1;&#x4E5F;&#x662F;&#x57FA;&#x4E8E;&#x6E38;&#x620F;&#x6574;&#x4F53;&#x57FA;&#x8C03;&#x548C;&#x753B;&#x9762;&#x98CE;&#x683C;&#x5B58;&#x5728;&#x7684;&#xFF0C;&#x6587;&#x5B57;&#x7684;&#x80CC;&#x666F;&#x5F88;&#x6742;&#x4E71;&#xFF0C;&#x800C;&#x6700;&#x8BA9;&#x4EBA;&#x6C14;&#x5230;&#x60F3;&#x7B11;&#x7684;&#x754C;&#x9762;&#x4E2D;&#x7684;&#x7F8E;&#x5316;&#x5143;&#x7D20;&#xFF0C;&#x6709;&#x70B9;&#x50CF;&#x857E;&#x4E1D;&#xFF0C;&#x5355;&#x770B;&#x8FD9;&#x79CD;&#x8BBE;&#x8BA1;&#xFF0C;&#x660E;&#x663E;&#x662F;&#x5973;&#x6027;&#x5316;&#x7684;&#xFF0C;&#x4F46;&#x662F;&#x7ED3;&#x5408;&#x7C97;&#x72B7;&#x7684;&#x914D;&#x8272;&#x548C;&#x6E32;&#x67D3;&#x98CE;&#x683C;&#xFF0C;&#x5012;&#x4E5F;&#x7B97;&#x662F;&#x4E0D;&#x9519;&#x7684;&#x4E2D;&#x548C;&#xFF0C;&#x7F8E;&#x672F;&#x4E0A;&#x4E0D;&#x7B97;&#x7D2F;&#x8D58;&#xFF0C;&#x4F46;&#x662F;&#x4ECE;&#x5B9E;&#x7528;&#x6027;&#x4E0A;&#x4ECD;&#x663E;&#x591A;&#x4F59;&#x3002;
<br>bug&#xFF1A;
<br>&#x6709;&#x4E9B;&#x573A;&#x666F;&#x4E2D;&#x90E8;&#x5206;&#x97F3;&#x9891;&#x5931;&#x6548;&#xFF0C;&#x597D;&#x50CF;&#x91CD;&#x542F;&#x6E38;&#x620F;&#x53EF;&#x4EE5;&#x89E3;&#x51B3;&#x95EE;&#x9898;&#x3002;
<br>&#x4EBA;&#x8BBE;&#x4F18;&#x79C0;&#xFF0C;&#x98CE;&#x683C;&#x72EC;&#x7279;&#x800C;&#x65E0;&#x5671;&#x5934;&#x611F;&#xFF0C;&#x4F18;&#x70B9;&#x5927;&#x4E8E;&#x7F3A;&#x70B9;&#xFF0C;&#x503C;&#x5F97;&#x5C1D;&#x8BD5;&#x3002;
<br>Cyborg Gigolo Simulator
<br>Graphics:8.5
<br>Control:8
<br>Characters:9
<br>Difficulty:7
<br>Story:6
<br>Optimization:8
<br>Total:7.5/10</span><span class="blurb_etc">&#x2026;</span> <a rel="nofollow" class="toggle_expand_collapse toggle_expand" href="/game/pc/killer-is-dead-nightmare-edition/user-reviews?user_review_id=5559195">Expand</a></span>
            </div>
                            </div>
                                                        <div class="review_section review_actions ">
                                <ul class="review_actions">
                                                                            <li class="review_action review_helpful">
                                            <div class="review_helpful">
    <div class="rating_thumbs">
        			<div class="helpful_summary thumb_count">
				<a href="https://secure.metacritic.com/login">
				<span class="total_ups">2</span>
				of 
				<span class="total_thumbs">2</span>
				users found this helpful
                </a>
			</div>
                <div style="clear:both;"></div>
    </div>
</div>
                                        </li>
                                                                                                                                                <li class="review_action">
                                        <a href="/user/sleeplust">All this user&apos;s reviews</a>
                                    </li>
                                                                    </ul>
                            </div>
                            
                                                    </div>
                    </div></div></div></div>
                </li>
                                                                                    <li id="user_review_5514521" class="review user_review">
                    <div class="review_btm review_btm_r"><div class="review_btm review_btm_l"><div class="review_top review_top_r"><div class="review_top review_top_l">
                        <div class="review_content">
                            <div class="review_section">
                                <div class="review_stats">
                                    <div class="review_critic">
                                        <div class="name">
                                                                                            <a href="/user/Fluxour">Fluxour</a>
                                                                                                                                </div>

                                                                                    <div class="date">Sep 27, 2015</div>
                                                                            </div>
                                    
                                    <div class="review_grade">
                                                
<div class="metascore_w user medium game negative indiv">4</div>

                                    </div>
                                </div>
                                <div class="review_body">
                                                        
                                        <span class="inline_expand_collapse inline_collapsed" id="review_blurb_5514521"><span class="blurb blurb_collapsed">A beautiful (aesthetically) game that leaves much to be desired on all fronts.
<br>
<br>The pc port provides few customization options on the options menu, which is usually excusable but another glaring issue that only compounds everything else wrong with the game.  The story is forgettable, with characters that come across as either annoying or generic.  There may have been an interesting</span><span class="blurb blurb_expanded">A beautiful (aesthetically) game that leaves much to be desired on all fronts.
<br>
<br>The pc port provides few customization options on the options menu, which is usually excusable but another glaring issue that only compounds everything else wrong with the game.  The story is forgettable, with characters that come across as either annoying or generic.  There may have been an interesting premise to be had with the cybernetic abilities of the protagonist, but you&apos;ll find naught here.
<br>
<br>Gameplay is severely lacking, with controls being extremely simple and lacking much depth.  Although new weapons and upgrades exist, they are locked behind what is essentially &quot;dating sim&quot; optional missions where you are trying to woo various female characters to then sleep with them and obtain new items.  I don&apos;t much care or am offended by this portrayal of women; I only wish that the upgrades weren&apos;t locked behind a feature that feels so out of place compared to the main game.</span><span class="blurb_etc">&#x2026;</span> <a rel="nofollow" class="toggle_expand_collapse toggle_expand" href="/game/pc/killer-is-dead-nightmare-edition/user-reviews?user_review_id=5514521">Expand</a></span>
            </div>
                            </div>
                                                        <div class="review_section review_actions ">
                                <ul class="review_actions">
                                                                            <li class="review_action review_helpful">
                                            <div class="review_helpful">
    <div class="rating_thumbs">
        			<div class="helpful_summary thumb_count">
				<a href="https://secure.metacritic.com/login">
				<span class="total_ups">3</span>
				of 
				<span class="total_thumbs">4</span>
				users found this helpful
                </a>
			</div>
                <div style="clear:both;"></div>
    </div>
</div>
                                        </li>
                                                                                                                                                <li class="review_action">
                                        <a href="/user/Fluxour">All this user&apos;s reviews</a>
                                    </li>
                                                                    </ul>
                            </div>
                            
                                                    </div>
                    </div></div></div></div>
                </li>
                                                                                    <li id="user_review_6783319" class="review user_review">
                    <div class="review_btm review_btm_r"><div class="review_btm review_btm_l"><div class="review_top review_top_r"><div class="review_top review_top_l">
                        <div class="review_content">
                            <div class="review_section">
                                <div class="review_stats">
                                    <div class="review_critic">
                                        <div class="name">
                                                                                            <a href="/user/somedude14">somedude14</a>
                                                                                                                                </div>

                                                                                    <div class="date">Oct 29, 2016</div>
                                                                            </div>
                                    
                                    <div class="review_grade">
                                                
<div class="metascore_w user medium game negative indiv">4</div>

                                    </div>
                                </div>
                                <div class="review_body">
                                                        
                                        <span class="inline_expand_collapse inline_collapsed" id="review_blurb_6783319"><span class="blurb blurb_collapsed">Incredibly disappointing.  Starts off great, but after completing Episode 3, everything starts to play like a prototype rather than an actual game.
<br>
<br>The Gigolo missions were funny the first time but you actually need to do this pointless crap to get stuff to help you in the actual game.

The story never goes anywhere.  Most episodes don&apos;t even contribute anything to a central plot,</span><span class="blurb blurb_expanded">Incredibly disappointing.  Starts off great, but after completing Episode 3, everything starts to play like a prototype rather than an actual game.
<br>
<br>The Gigolo missions were funny the first time but you actually need to do this pointless crap to get stuff to help you in the actual game.
<br>
<br>The story never goes anywhere.  Most episodes don&apos;t even contribute anything to a central plot, they&apos;re just one-off nothings.  But they have those long drawn out pan scenes and lengthy breaks between every spoken *line* of dialogue to add emphasis to the absolute nothing it&apos;s delivering.
<br>
<br>It also doesn&apos;t actually go beyond 1280x720 regardless of what you set it to in the menus, unless you go to the ini and directly edit the resolution there.  Game is also capped at 30fps unless you make an ini edit as well, capping at 60fps the game worked fine for me aside from one Gigolo mission that would always hang (the one with the Japanese girl), basically they could&apos;ve easily worked in the 60fps option and fixed this one issue and had a proper PC port.
<br>
<br>The game is constantly interrupting the hack-n-slash action to show off how &quot;cool&quot; it is.  Almost every time enemies spawn, the game will take control away from you to zoom in on the enemy to show you they&apos;re there (because you&apos;re too stupid to figure it out apparently) and spend five seconds having them do a taunt animation.
<br>
<br>The camera is garbage and needs a lock-on system.  It isn&apos;t uncommon to have your vision obscured by an art piece, or be fighting something when another enemy jumps in from off-screen to smack you in the back and break your combo.  Needs a wider camera like the DMC series.  You cannot plan much of anything.
<br>
<br>Dodging also does not immediately break attack animations (unlike Dark Souls) so if you hit a button you&apos;re committed, considering it&apos;s a button masher this is a huge handicap.
<br>
<br>Incredibly disappointing because I went in expecting something good because it&apos;s Suda51 but nothing ever gets delivered.</span><span class="blurb_etc">&#x2026;</span> <a rel="nofollow" class="toggle_expand_collapse toggle_expand" href="/game/pc/killer-is-dead-nightmare-edition/user-reviews?user_review_id=6783319">Expand</a></span>
            </div>
                            </div>
                                                        <div class="review_section review_actions ">
                                <ul class="review_actions">
                                                                            <li class="review_action review_helpful">
                                            <div class="review_helpful">
    <div class="rating_thumbs">
        			<div class="helpful_summary thumb_count">
				<a href="https://secure.metacritic.com/login">
				<span class="total_ups">2</span>
				of 
				<span class="total_thumbs">3</span>
				users found this helpful
                </a>
			</div>
                <div style="clear:both;"></div>
    </div>
</div>
                                        </li>
                                                                                                                                                <li class="review_action">
                                        <a href="/user/somedude14">All this user&apos;s reviews</a>
                                    </li>
                                                                    </ul>
                            </div>
                            
                                                    </div>
                    </div></div></div></div>
                </li>
                                                                                    <li id="user_review_4316893" class="review user_review">
                    <div class="review_btm review_btm_r"><div class="review_btm review_btm_l"><div class="review_top review_top_r"><div class="review_top review_top_l">
                        <div class="review_content">
                            <div class="review_section">
                                <div class="review_stats">
                                    <div class="review_critic">
                                        <div class="name">
                                                                                            <a href="/user/voorsk">voorsk</a>
                                                                                                                                </div>

                                                                                    <div class="date">Jun 30, 2014</div>
                                                                            </div>
                                    
                                    <div class="review_grade">
                                                
<div class="metascore_w user medium game negative indiv">0</div>

                                    </div>
                                </div>
                                <div class="review_body">
                                                        
                                        <span>The shoddiest port I&apos;ve ever come across.  I&apos;m unable to get past level 3 due to some sort of autosave glitch that locks the game up, and those that do get past level 3 run into all sorts of different bugs.
<br>
<br>Buy it on a console instead, unless you really like pressing CTRL ALT DEL.</span>
            </div>
                            </div>
                                                        <div class="review_section review_actions ">
                                <ul class="review_actions">
                                                                            <li class="review_action review_helpful">
                                            <div class="review_helpful">
    <div class="rating_thumbs">
        			<div class="helpful_summary thumb_count">
				<a href="https://secure.metacritic.com/login">
				<span class="total_ups">3</span>
				of 
				<span class="total_thumbs">5</span>
				users found this helpful
                </a>
			</div>
                <div style="clear:both;"></div>
    </div>
</div>
                                        </li>
                                                                                                                                                <li class="review_action">
                                        <a href="/user/voorsk">All this user&apos;s reviews</a>
                                    </li>
                                                                    </ul>
                            </div>
                            
                                                    </div>
                    </div></div></div></div>
                </li>
                                                                                    <li id="user_review_4264617" class="review user_review">
                    <div class="review_btm review_btm_r"><div class="review_btm review_btm_l"><div class="review_top review_top_r"><div class="review_top review_top_l">
                        <div class="review_content">
                            <div class="review_section">
                                <div class="review_stats">
                                    <div class="review_critic">
                                        <div class="name">
                                                                                            <a href="/user/Fuz">Fuz</a>
                                                                                                                                </div>

                                                                                    <div class="date">Jun  9, 2014</div>
                                                                            </div>
                                    
                                    <div class="review_grade">
                                                
<div class="metascore_w user medium game negative indiv">0</div>

                                    </div>
                                </div>
                                <div class="review_body">
                                                        
                                        <span>Terrible, terrible, TERRIBLE port.
<br>The keybinds aren&apos;t redefinable. So, it&apos;s completely unplayable for me.
<br>Don&apos;t waste your money on this game, it&apos;s not worth it.
<br>When will they learn?</span>
            </div>
                            </div>
                                                        <div class="review_section review_actions ">
                                <ul class="review_actions">
                                                                            <li class="review_action review_helpful">
                                            <div class="review_helpful">
    <div class="rating_thumbs">
        			<div class="helpful_summary thumb_count">
				<a href="https://secure.metacritic.com/login">
				<span class="total_ups">8</span>
				of 
				<span class="total_thumbs">15</span>
				users found this helpful
                </a>
			</div>
                <div style="clear:both;"></div>
    </div>
</div>
                                        </li>
                                                                                                                                                <li class="review_action">
                                        <a href="/user/Fuz">All this user&apos;s reviews</a>
                                    </li>
                                                                    </ul>
                            </div>
                            
                                                    </div>
                    </div></div></div></div>
                </li>
                                                                                    <li id="user_review_4211220" class="review user_review">
                    <div class="review_btm review_btm_r"><div class="review_btm review_btm_l"><div class="review_top review_top_r"><div class="review_top review_top_l">
                        <div class="review_content">
                            <div class="review_section">
                                <div class="review_stats">
                                    <div class="review_critic">
                                        <div class="name">
                                                                                            <a href="/user/HELLruler">HELLruler</a>
                                                                                                                                </div>

                                                                                    <div class="date">May 25, 2014</div>
                                                                            </div>
                                    
                                    <div class="review_grade">
                                                
<div class="metascore_w user medium game mixed indiv">7</div>

                                    </div>
                                </div>
                                <div class="review_body">
                                                        
                                        <span class="inline_expand_collapse inline_collapsed" id="review_blurb_4211220"><span class="blurb blurb_collapsed">I&apos;m pretty glad this isn&apos;t a DMC clone. Even though the story doesn&apos;t make any sense, playing the game is really enjoyable
<br>
<br>What may call your attention is that you don&apos;t have hundreds of attack combinations, you just mash the only attack button. There&apos;s a guard break button if you need it too

It&apos;s pretty fast-paced, some enemies don&apos;t get staggered by your attacks, so you have to</span><span class="blurb blurb_expanded">I&apos;m pretty glad this isn&apos;t a DMC clone. Even though the story doesn&apos;t make any sense, playing the game is really enjoyable
<br>
<br>What may call your attention is that you don&apos;t have hundreds of attack combinations, you just mash the only attack button. There&apos;s a guard break button if you need it too
<br>
<br>It&apos;s pretty fast-paced, some enemies don&apos;t get staggered by your attacks, so you have to constantly pay attention and block/dodge attacks. Boss fights are extreme, they really push you to the limits. And the game is a bit hard, you can expect some deaths in the first hours
<br>
<br>There are also some &quot;romantic&quot; missions to get weapons, they are pretty funny, but I think some players won&apos;t enjoy that so much
<br>
<br>In the end, it&apos;s a hit or miss game, you&apos;ll either like it a lot or just drop it. For it&apos;s price, I think it&apos;s worth the shot if you feel interested</span><span class="blurb_etc">&#x2026;</span> <a rel="nofollow" class="toggle_expand_collapse toggle_expand" href="/game/pc/killer-is-dead-nightmare-edition/user-reviews?user_review_id=4211220">Expand</a></span>
            </div>
                            </div>
                                                        <div class="review_section review_actions ">
                                <ul class="review_actions">
                                                                            <li class="review_action review_helpful">
                                            <div class="review_helpful">
    <div class="rating_thumbs">
        			<div class="helpful_summary thumb_count">
				<a href="https://secure.metacritic.com/login">
				<span class="total_ups">3</span>
				of 
				<span class="total_thumbs">6</span>
				users found this helpful
                </a>
			</div>
                <div style="clear:both;"></div>
    </div>
</div>
                                        </li>
                                                                                                                                                <li class="review_action">
                                        <a href="/user/HELLruler">All this user&apos;s reviews</a>
                                    </li>
                                                                    </ul>
                            </div>
                            
                                                    </div>
                    </div></div></div></div>
                </li>
                                                                                    <li id="user_review_4208195" class="review user_review">
                    <div class="review_btm review_btm_r"><div class="review_btm review_btm_l"><div class="review_top review_top_r"><div class="review_top review_top_l">
                        <div class="review_content">
                            <div class="review_section">
                                <div class="review_stats">
                                    <div class="review_critic">
                                        <div class="name">
                                                                                            <a href="/user/fhouse">fhouse</a>
                                                                                                                                </div>

                                                                                    <div class="date">May 29, 2014</div>
                                                                            </div>
                                    
                                    <div class="review_grade">
                                                
<div class="metascore_w user medium game mixed indiv">7</div>

                                    </div>
                                </div>
                                <div class="review_body">
                                                        
                                        <span>Very stylish game, fighting feels good. PC version works ok so far. You can modify an ini file and unlock the 30 fps cap, but it might cause glitches so it&apos;s not advised. It uses the Unreal engine so no problems with PC performance.
<br>However you can&apos;t even customize controls ingame. (Maybe can be modified in an ini file though.)</span>
            </div>
                            </div>
                                                        <div class="review_section review_actions ">
                                <ul class="review_actions">
                                                                            <li class="review_action review_helpful">
                                            <div class="review_helpful">
    <div class="rating_thumbs">
        			<div class="helpful_summary thumb_count">
				<a href="https://secure.metacritic.com/login">
				<span class="total_ups">2</span>
				of 
				<span class="total_thumbs">4</span>
				users found this helpful
                </a>
			</div>
                <div style="clear:both;"></div>
    </div>
</div>
                                        </li>
                                                                                                                                                <li class="review_action">
                                        <a href="/user/fhouse">All this user&apos;s reviews</a>
                                    </li>
                                                                    </ul>
                            </div>
                            
                                                    </div>
                    </div></div></div></div>
                </li>
                                                                                    <li id="user_review_5638829" class="review user_review">
                    <div class="review_btm review_btm_r"><div class="review_btm review_btm_l"><div class="review_top review_top_r"><div class="review_top review_top_l">
                        <div class="review_content">
                            <div class="review_section">
                                <div class="review_stats">
                                    <div class="review_critic">
                                        <div class="name">
                                                                                            <a href="/user/Tylanderma">Tylanderma</a>
                                                                                                                                </div>

                                                                                    <div class="date">Nov  1, 2015</div>
                                                                            </div>
                                    
                                    <div class="review_grade">
                                                
<div class="metascore_w user medium game positive indiv">9</div>

                                    </div>
                                </div>
                                <div class="review_body">
                                                        
                                        <span class="inline_expand_collapse inline_collapsed" id="review_blurb_5638829"><span class="blurb blurb_collapsed">Okay. Just to make this point readily apparent. This is a character action games. Character action games don&apos;t play well with keyboard and mouse, just because of how they work. I do not, in any situation, recommend you playing this with keyboard and mouse. Controller is pretty much necessary. That said, the game is fantastic. It controls well, and the story is off the walls crazy, to be</span><span class="blurb blurb_expanded">Okay. Just to make this point readily apparent. This is a character action games. Character action games don&apos;t play well with keyboard and mouse, just because of how they work. I do not, in any situation, recommend you playing this with keyboard and mouse. Controller is pretty much necessary. That said, the game is fantastic. It controls well, and the story is off the walls crazy, to be expected out of Suda 51. The performance is pretty poor, so some people with lower end pcs will have issues running it, but if you can run it, it is well worth it.</span><span class="blurb_etc">&#x2026;</span> <a rel="nofollow" class="toggle_expand_collapse toggle_expand" href="/game/pc/killer-is-dead-nightmare-edition/user-reviews?user_review_id=5638829">Expand</a></span>
            </div>
                            </div>
                                                        <div class="review_section review_actions ">
                                <ul class="review_actions">
                                                                            <li class="review_action review_helpful">
                                            <div class="review_helpful">
    <div class="rating_thumbs">
        			<div class="helpful_summary thumb_count">
				<a href="https://secure.metacritic.com/login">
				<span class="total_ups">2</span>
				of 
				<span class="total_thumbs">4</span>
				users found this helpful
                </a>
			</div>
                <div style="clear:both;"></div>
    </div>
</div>
                                        </li>
                                                                                                                                                <li class="review_action">
                                        <a href="/user/Tylanderma">All this user&apos;s reviews</a>
                                    </li>
                                                                    </ul>
                            </div>
                            
                                                    </div>
                    </div></div></div></div>
                </li>
                                                                                    <li id="user_review_4211768" class="review user_review">
                    <div class="review_btm review_btm_r"><div class="review_btm review_btm_l"><div class="review_top review_top_r"><div class="review_top review_top_l">
                        <div class="review_content">
                            <div class="review_section">
                                <div class="review_stats">
                                    <div class="review_critic">
                                        <div class="name">
                                                                                            <a href="/user/LalchandTudu">LalchandTudu</a>
                                                                                                                                </div>

                                                                                    <div class="date">May 25, 2014</div>
                                                                            </div>
                                    
                                    <div class="review_grade">
                                                
<div class="metascore_w user medium game positive indiv">9</div>

                                    </div>
                                </div>
                                <div class="review_body">
                                                        
                                        <span class="inline_expand_collapse inline_collapsed" id="review_blurb_4211768"><span class="blurb blurb_collapsed">A beautiful game that pushes the limits of creative artworks in the field of cel-shaded graphics. Many thanks to Mr. Goichi Suda aka Suda51 and all the people from Grasshopper Manufacture who were involved in the production process of this game.
<br>
<br>The gameplay is nice and butter-smooth. The beginning may be a bit rough as not much of the combos are available. Once you unlock a few combos,</span><span class="blurb blurb_expanded">A beautiful game that pushes the limits of creative artworks in the field of cel-shaded graphics. Many thanks to Mr. Goichi Suda aka Suda51 and all the people from Grasshopper Manufacture who were involved in the production process of this game.
<br>
<br>The gameplay is nice and butter-smooth. The beginning may be a bit rough as not much of the combos are available. Once you unlock a few combos, the game becomes more fun. You can really muster up some of the most brutal combo moves, very flashy indeed and really feels great when you pass judgement combo slash upon enemies. The boss fights are really impressive and full of adrenaline.
<br>
<br>The story will not make any sense if you think straight. In order to understand it you must have an &quot;Otaku&quot; mind, then only you can get around the story.
<br>
<br>The game really shines well in PC platform full F-HD support (1080p resolution), very responsive controls. Although the game is locked at 30fps gameplay speed, you can unlock it to 60 fps by modifying the .ini file which is not very difficult for pc gamers.
<br>
<br>A really good game worth buying and playing for the PC platform.</span><span class="blurb_etc">&#x2026;</span> <a rel="nofollow" class="toggle_expand_collapse toggle_expand" href="/game/pc/killer-is-dead-nightmare-edition/user-reviews?user_review_id=4211768">Expand</a></span>
            </div>
                            </div>
                                                        <div class="review_section review_actions ">
                                <ul class="review_actions">
                                                                            <li class="review_action review_helpful">
                                            <div class="review_helpful">
    <div class="rating_thumbs">
        			<div class="helpful_summary thumb_count">
				<a href="https://secure.metacritic.com/login">
				<span class="total_ups">4</span>
				of 
				<span class="total_thumbs">9</span>
				users found this helpful
                </a>
			</div>
                <div style="clear:both;"></div>
    </div>
</div>
                                        </li>
                                                                                                                                                <li class="review_action">
                                        <a href="/user/LalchandTudu">All this user&apos;s reviews</a>
                                    </li>
                                                                    </ul>
                            </div>
                            
                                                    </div>
                    </div></div></div></div>
                </li>
                                                                                    <li id="user_review_4274456" class="review user_review">
                    <div class="review_btm review_btm_r"><div class="review_btm review_btm_l"><div class="review_top review_top_r"><div class="review_top review_top_l">
                        <div class="review_content">
                            <div class="review_section">
                                <div class="review_stats">
                                    <div class="review_critic">
                                        <div class="name">
                                                                                            <a href="/user/TabulaRasa">TabulaRasa</a>
                                                                                                                                </div>

                                                                                    <div class="date">Jun 14, 2014</div>
                                                                            </div>
                                    
                                    <div class="review_grade">
                                                
<div class="metascore_w user medium game positive indiv">8</div>

                                    </div>
                                </div>
                                <div class="review_body">
                                                        
                                        <span class="inline_expand_collapse inline_collapsed" id="review_blurb_4274456"><span class="blurb blurb_collapsed">Playing this game is essentially signing a contract saying that you&apos;ll be willing to accept whatever strange insanity is going on in developer Suda51&apos;s head, and it&apos;s certainly a doozy. If you&apos;re willing to accept that you&apos;re probably not going to understand what the hell is going on (at least on your first playthrough), then you might be able to look past the veil and find a charming game</span><span class="blurb blurb_expanded">Playing this game is essentially signing a contract saying that you&apos;ll be willing to accept whatever strange insanity is going on in developer Suda51&apos;s head, and it&apos;s certainly a doozy. If you&apos;re willing to accept that you&apos;re probably not going to understand what the hell is going on (at least on your first playthrough), then you might be able to look past the veil and find a charming game worth loving.
<br>
<br>It probably won&apos;t rock your world, but it&apos;s worth a playthrough if you&apos;re into solid character action games. It plays in a third person cel-shaded style, which looks good in cutscenes, but does make it kind of hard to see during gameplay. The combat is varied, with a variety of sword moves, sub-weapons, and cool instant-death abilities. The sword impacts feel heavy and satisying, probably more so when playing on a gamepad as opposed to the mouse and keyboard.
<br>
<br>Nightmare Edition comes with an extra difficulty setting, the Smooth Operator pack, and Theater Mode, helping you decipher the story you just played through. Only for 19.99, which is a pretty good value if you haven&apos;t checked it out yet.
<br>
<br>Overall, it&apos;s a good game with good combat, and interesting albeit sometimes unintelligible writing.</span><span class="blurb_etc">&#x2026;</span> <a rel="nofollow" class="toggle_expand_collapse toggle_expand" href="/game/pc/killer-is-dead-nightmare-edition/user-reviews?user_review_id=4274456">Expand</a></span>
            </div>
                            </div>
                                                        <div class="review_section review_actions ">
                                <ul class="review_actions">
                                                                            <li class="review_action review_helpful">
                                            <div class="review_helpful">
    <div class="rating_thumbs">
        			<div class="helpful_summary thumb_count">
				<a href="https://secure.metacritic.com/login">
				<span class="total_ups">2</span>
				of 
				<span class="total_thumbs">5</span>
				users found this helpful
                </a>
			</div>
                <div style="clear:both;"></div>
    </div>
</div>
                                        </li>
                                                                                                                                                <li class="review_action">
                                        <a href="/user/TabulaRasa">All this user&apos;s reviews</a>
                                    </li>
                                                                    </ul>
                            </div>
                            
                                                    </div>
                    </div></div></div></div>
                </li>
                                                                                    <li id="user_review_4262558" class="review user_review">
                    <div class="review_btm review_btm_r"><div class="review_btm review_btm_l"><div class="review_top review_top_r"><div class="review_top review_top_l">
                        <div class="review_content">
                            <div class="review_section">
                                <div class="review_stats">
                                    <div class="review_critic">
                                        <div class="name">
                                                                                            <a href="/user/Tessara_Vejgan">Tessara_Vejgan</a>
                                                                                                                                </div>

                                                                                    <div class="date">Jun  8, 2014</div>
                                                                            </div>
                                    
                                    <div class="review_grade">
                                                
<div class="metascore_w user medium game negative indiv">0</div>

                                    </div>
                                </div>
                                <div class="review_body">
                                                        
                                        <span class="inline_expand_collapse inline_collapsed" id="review_blurb_4262558"><span class="blurb blurb_collapsed">ARE YOU F****** KIDDING ME. A-R-E Y-O-U F-*-*-*-*-*-* K-I-D-D--N-G M-E. WHAT IS THIS BS. I THOUGHT THE GAME WAS GOOD, YES I REALLY DID, UNTIL I GOT TO EPISODE 4 AND REACHED THE FINAL BOSS. NOT ONE F***** QTE BUT TWO THAT ARE BROKEN, THE FIRST ONE WAS NEARLY IMPOSSIBLE TO DO THE SECOND I CAN&apos;T PASS NO MATTER WHAT I DO. I TRIED PUTTING THE GAMEPAD DOWN AND TRIED ALL POSSIBLE ANGLES AND</span><span class="blurb blurb_expanded">ARE YOU F****** KIDDING ME. A-R-E Y-O-U F-*-*-*-*-*-* K-I-D-D--N-G M-E. WHAT IS THIS BS. I THOUGHT THE GAME WAS GOOD, YES I REALLY DID, UNTIL I GOT TO EPISODE 4 AND REACHED THE FINAL BOSS. NOT ONE F***** QTE BUT TWO THAT ARE BROKEN, THE FIRST ONE WAS NEARLY IMPOSSIBLE TO DO THE SECOND I CAN&apos;T PASS NO MATTER WHAT I DO. I TRIED PUTTING THE GAMEPAD DOWN AND TRIED ALL POSSIBLE ANGLES AND PRESSURE AND IT DOESN&apos;T F****** WORK. I TRIED MOUSE &amp; KEYBOARD BUT SAME F***** S***. AND NO ITS NOT THE FAULT OF MY 360 GAMEPAD NOR MY MOUSE THEY WORK PERFECTLY FINE.WHAT KIND OF A F****** I**** MAKES THIS. I S*** YOU NOT WHEN I SAY I NEARLY BROKE MY FINGERS ON THIS BS. YOU CAN NOT IMAGINE HOW MUCH THIS PISSES ME OF. HOW THE HELL DID OTHER PEOPLE GET THROUGH THIS IS BEYOND ME. I DON&apos;T GET IT, I REALLY DON&apos;T. I&apos;LL SE IF I CAN FIND A FIX SOMEWHERE ON THE NET BUT I STAND BY MY SCORE. A F****** ZERO. STAY THE HELL AWAY FROM THIS GAME AND DON&apos;T BUY IT, ITS BROKEN.</span><span class="blurb_etc">&#x2026;</span> <a rel="nofollow" class="toggle_expand_collapse toggle_expand" href="/game/pc/killer-is-dead-nightmare-edition/user-reviews?user_review_id=4262558">Expand</a></span>
            </div>
                            </div>
                                                        <div class="review_section review_actions ">
                                <ul class="review_actions">
                                                                            <li class="review_action review_helpful">
                                            <div class="review_helpful">
    <div class="rating_thumbs">
        			<div class="helpful_summary thumb_count">
				<a href="https://secure.metacritic.com/login">
				<span class="total_ups">3</span>
				of 
				<span class="total_thumbs">14</span>
				users found this helpful
                </a>
			</div>
                <div style="clear:both;"></div>
    </div>
</div>
                                        </li>
                                                                                                                                                <li class="review_action">
                                        <a href="/user/Tessara_Vejgan">All this user&apos;s reviews</a>
                                    </li>
                                                                    </ul>
                            </div>
                            
                                                    </div>
                    </div></div></div></div>
                </li>
                                                                                    <li id="user_review_4351614" class="review user_review">
                    <div class="review_btm review_btm_r"><div class="review_btm review_btm_l"><div class="review_top review_top_r"><div class="review_top review_top_l">
                        <div class="review_content">
                            <div class="review_section">
                                <div class="review_stats">
                                    <div class="review_critic">
                                        <div class="name">
                                                                                            <a href="/user/CaptBulka">CaptBulka</a>
                                                                                                                                </div>

                                                                                    <div class="date">Jul 12, 2014</div>
                                                                            </div>
                                    
                                    <div class="review_grade">
                                                
<div class="metascore_w user medium game negative indiv">0</div>

                                    </div>
                                </div>
                                <div class="review_body">
                                                        
                                        <span class="inline_expand_collapse inline_collapsed" id="review_blurb_4351614"><span class="blurb blurb_collapsed">&#x427;&#x442;&#x43E;&#x436; &#x43A;&#x430;&#x43A; &#x433;&#x43E;&#x432;&#x43E;&#x440;&#x438;&#x442;&#x44C;&#x441;&#x44F; &#x438;&#x437;-&#x437;&#x430; &#x431;&#x430;&#x433;&#x430; &#x441; &#x432;&#x435;&#x447;&#x43D;&#x43E;&#x439; &#x437;&#x430;&#x433;&#x440;&#x443;&#x437;&#x43A;&#x43E;&#x439; &#x432; 3&#x435;&#x43C; &#x44D;&#x43F;&#x438;&#x437;&#x43E;&#x434;&#x435; &quot;&#x41D;&#x418;&#x41F;&#x410;&#x418;&#x413;&#x420;&#x410;&#x422;&#x42C;&quot;, &#x434;&#x43E;&#x431;&#x430;&#x432;&#x438;&#x43C; &#x43A; &#x44D;&#x442;&#x43E;&#x43C;&#x443; &#x43B;&#x430;&#x433;&#x438;, &#x432;&#x44B;&#x43B;&#x435;&#x442;&#x44B; &#x43D;&#x430; &#x43A;&#x430;&#x442;&#x441;-&#x441;&#x446;&#x435;&#x43D;&#x430;&#x445; &#x438; &quot;&#x43E;&#x447;&#x435;&#x43D;&#x44C; &#x43E;&#x445;&#x43E;&#x442;&#x43D;&#x43E;&#x435;&quot; &#x436;&#x435;&#x43B;&#x430;&#x43D;&#x438;&#x435; &#x440;&#x430;&#x437;&#x440;&#x430;&#x431;&#x43E;&#x442;&#x447;&#x438;&#x43A;&#x43E;&#x432; &#x43F;&#x43E;&#x43C;&#x43E;&#x447;&#x44C; &#x432;&#x441;&#x435;&#x43C; &#x442;&#x435;&#x43C; &#x43A;&#x442;&#x43E; &#x43A;&#x443;&#x43F;&#x438;&#x43B; &#x441;&#x438;&#x439; &quot;&#x429;&#x418;&#x414;&#x415;&#x412;&#x420;&quot;
<br>P.S: &#x411;&#x430;&#x433; &#x43E;&#x441;&#x442;&#x430;&#x435;&#x442;&#x441;&#x44F; &#x441;&#x43F;&#x443;&#x441;&#x442;&#x44F; &#x443;&#x436;&#x435; 2 &#x43C;&#x435;&#x441;&#x44F;&#x446;&#x430; &#x43F;&#x43E;&#x441;&#x43B;&#x435; &#x432;&#x44B;&#x445;&#x43E;&#x434;&#x430;. &#x41A; &#x43F;&#x43E;&#x43A;&#x443;&#x43F;&#x43A;&#x435; &#x43D;&#x430; &#x41F;&#x41A; &#x43F;&#x43E;&#x440;&#x435;&#x43A;&#x43E;&#x43C;&#x435;&#x43D;&#x434;&#x43E;&#x432;&#x430;&#x442;&#x44C; &#x43D;&#x435; &#x43C;&#x43E;&#x433;&#x443;, &#x430; &#x432;&#x43E;&#x442; &#x43D;&#x430; &#x43A;&#x43E;&#x43D;&#x441;&#x43E;&#x43B;&#x438; &#x431;&#x430;&#x433;&#x430; &#x43D;&#x435;&#x442;&#x443;(&#x438;&#x433;&#x440;&#x430;&#x442;&#x44C; &#x434;&#x430;&#x436;&#x435; &#x432;&#x43E;&#x437;&#x43C;&#x43E;&#x436;&#x43D;&#x43E;, &#x438;&#x43D;&#x43D;&#x43E;&#x432;&#x430;&#x446;&#x438;&#x438;). 0 &#x438;&#x437; 10 &#x43C;&#x435;&#x440;&#x442;&#x432;&#x44B;&#x445; &#x443;&#x431;&#x438;&#x439;&#x446;.</span><span class="blurb blurb_expanded">&#x427;&#x442;&#x43E;&#x436; &#x43A;&#x430;&#x43A; &#x433;&#x43E;&#x432;&#x43E;&#x440;&#x438;&#x442;&#x44C;&#x441;&#x44F; &#x438;&#x437;-&#x437;&#x430; &#x431;&#x430;&#x433;&#x430; &#x441; &#x432;&#x435;&#x447;&#x43D;&#x43E;&#x439; &#x437;&#x430;&#x433;&#x440;&#x443;&#x437;&#x43A;&#x43E;&#x439; &#x432; 3&#x435;&#x43C; &#x44D;&#x43F;&#x438;&#x437;&#x43E;&#x434;&#x435; &quot;&#x41D;&#x418;&#x41F;&#x410;&#x418;&#x413;&#x420;&#x410;&#x422;&#x42C;&quot;, &#x434;&#x43E;&#x431;&#x430;&#x432;&#x438;&#x43C; &#x43A; &#x44D;&#x442;&#x43E;&#x43C;&#x443; &#x43B;&#x430;&#x433;&#x438;, &#x432;&#x44B;&#x43B;&#x435;&#x442;&#x44B; &#x43D;&#x430; &#x43A;&#x430;&#x442;&#x441;-&#x441;&#x446;&#x435;&#x43D;&#x430;&#x445; &#x438; &quot;&#x43E;&#x447;&#x435;&#x43D;&#x44C; &#x43E;&#x445;&#x43E;&#x442;&#x43D;&#x43E;&#x435;&quot; &#x436;&#x435;&#x43B;&#x430;&#x43D;&#x438;&#x435; &#x440;&#x430;&#x437;&#x440;&#x430;&#x431;&#x43E;&#x442;&#x447;&#x438;&#x43A;&#x43E;&#x432; &#x43F;&#x43E;&#x43C;&#x43E;&#x447;&#x44C; &#x432;&#x441;&#x435;&#x43C; &#x442;&#x435;&#x43C; &#x43A;&#x442;&#x43E; &#x43A;&#x443;&#x43F;&#x438;&#x43B; &#x441;&#x438;&#x439; &quot;&#x429;&#x418;&#x414;&#x415;&#x412;&#x420;&quot;
<br>P.S: &#x411;&#x430;&#x433; &#x43E;&#x441;&#x442;&#x430;&#x435;&#x442;&#x441;&#x44F; &#x441;&#x43F;&#x443;&#x441;&#x442;&#x44F; &#x443;&#x436;&#x435; 2 &#x43C;&#x435;&#x441;&#x44F;&#x446;&#x430; &#x43F;&#x43E;&#x441;&#x43B;&#x435; &#x432;&#x44B;&#x445;&#x43E;&#x434;&#x430;. &#x41A; &#x43F;&#x43E;&#x43A;&#x443;&#x43F;&#x43A;&#x435; &#x43D;&#x430; &#x41F;&#x41A; &#x43F;&#x43E;&#x440;&#x435;&#x43A;&#x43E;&#x43C;&#x435;&#x43D;&#x434;&#x43E;&#x432;&#x430;&#x442;&#x44C; &#x43D;&#x435; &#x43C;&#x43E;&#x433;&#x443;, &#x430; &#x432;&#x43E;&#x442; &#x43D;&#x430; &#x43A;&#x43E;&#x43D;&#x441;&#x43E;&#x43B;&#x438; &#x431;&#x430;&#x433;&#x430; &#x43D;&#x435;&#x442;&#x443;(&#x438;&#x433;&#x440;&#x430;&#x442;&#x44C; &#x434;&#x430;&#x436;&#x435; &#x432;&#x43E;&#x437;&#x43C;&#x43E;&#x436;&#x43D;&#x43E;, &#x438;&#x43D;&#x43D;&#x43E;&#x432;&#x430;&#x446;&#x438;&#x438;). 0 &#x438;&#x437; 10 &#x43C;&#x435;&#x440;&#x442;&#x432;&#x44B;&#x445; &#x443;&#x431;&#x438;&#x439;&#x446;.</span></span>
            </div>
                            </div>
                                                        <div class="review_section review_actions ">
                                <ul class="review_actions">
                                                                            <li class="review_action review_helpful">
                                            <div class="review_helpful">
    <div class="rating_thumbs">
        			<div class="helpful_summary thumb_count">
				<a href="https://secure.metacritic.com/login">
				<span class="total_ups">2</span>
				of 
				<span class="total_thumbs">10</span>
				users found this helpful
                </a>
			</div>
                <div style="clear:both;"></div>
    </div>
</div>
                                        </li>
                                                                                                                                                <li class="review_action">
                                        <a href="/user/CaptBulka">All this user&apos;s reviews</a>
                                    </li>
                                                                    </ul>
                            </div>
                            
                                                    </div>
                    </div></div></div></div>
                </li>
                                                                                    <li id="user_review_5026986" class="review user_review">
                    <div class="review_btm review_btm_r"><div class="review_btm review_btm_l"><div class="review_top review_top_r"><div class="review_top review_top_l">
                        <div class="review_content">
                            <div class="review_section">
                                <div class="review_stats">
                                    <div class="review_critic">
                                        <div class="name">
                                                                                            <a href="/user/zzZZZzzzzZZz">zzZZZzzzzZZz</a>
                                                                                                                                </div>

                                                                                    <div class="date">Feb 22, 2015</div>
                                                                            </div>
                                    
                                    <div class="review_grade">
                                                
<div class="metascore_w user medium game mixed indiv">5</div>

                                    </div>
                                </div>
                                <div class="review_body">
                                                        
                                        <span class="inline_expand_collapse inline_collapsed" id="review_blurb_5026986"><span class="blurb blurb_collapsed">&#x421;&#x44E;&#x440;&#x440;&#x435;&#x430;&#x43B;&#x438;&#x437;&#x43C; &#x432;&#x44B;&#x433;&#x43B;&#x44F;&#x434;&#x438;&#x442; &#x43D;&#x435;&#x43B;&#x435;&#x43F;&#x43E;, &#x43D;&#x43E; &#x43E;&#x442; &#x44D;&#x442;&#x43E;&#x433;&#x43E; &#x432;&#x441;&#x44F;&#x43A;&#x430;&#x44F; &#x43D;&#x435;&#x43B;&#x435;&#x43F;&#x43E;&#x441;&#x442;&#x44C; &#x438; &#x432;&#x44B;&#x447;&#x443;&#x440;&#x43D;&#x43E;&#x441;&#x442;&#x44C; &#x43D;&#x435; &#x441;&#x442;&#x430;&#x43D;&#x43E;&#x432;&#x438;&#x442;&#x441;&#x44F; &#x441;&#x44E;&#x440;&#x440;&#x435;&#x430;&#x43B;&#x438;&#x437;&#x43C;&#x43E;&#x43C;. &#x410;&#x432;&#x442;&#x43E;&#x440;&#x443; &#x43E;&#x442;&#x43A;&#x430;&#x437;&#x430;&#x43B;&#x43E; &#x447;&#x443;&#x432;&#x441;&#x442;&#x432;&#x43E; &#x432;&#x43A;&#x443;&#x441;&#x430;, &#x435;&#x441;&#x43B;&#x438; &#x438;&#x43C;&#x435;&#x43B;&#x43E;&#x441;&#x44C;, &#x438; &#x43E;&#x43D; &#x443;&#x442;&#x43A;&#x43D;&#x443;&#x43B;&#x441;&#x44F; &#x43D;&#x43E;&#x441;&#x43E;&#x43C; &#x432; &#x442;&#x440;&#x44D;&#x448; &#x2014; &#x432; &#x441;&#x430;&#x43C;&#x43E;&#x43C; &#x43F;&#x43B;&#x43E;&#x445;&#x43E;&#x43C; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x438;&#x438; &#x44D;&#x442;&#x43E;&#x433;&#x43E; &#x441;&#x43B;&#x43E;&#x432;&#x430;. &#x41D;&#x430;&#x43A;&#x438;&#x434;&#x430;&#x44E;&#x442; &#x435;&#x449;&#x451; &#x44D;&#x43F;&#x438;&#x442;&#x435;&#x442;&#x43E;&#x432;: &#x431;&#x435;&#x437;&#x44B;&#x434;&#x435;&#x439;&#x43D;&#x43E;&#x441;&#x442;&#x44C;, &#x431;&#x435;&#x441;&#x442;&#x430;&#x43B;&#x430;&#x43D;&#x43D;&#x43E;&#x441;&#x442;&#x44C;, &#x43A;&#x43B;&#x438;&#x448;&#x435;. &#x417;&#x430;&#x434;&#x443;&#x43C;&#x43A;&#x430; &#x435;&#x441;&#x442;&#x44C; - &#x44D;&#x444;&#x444;&#x435;&#x43A;&#x442;&#x43D;&#x430;&#x44F; &#x43A;&#x430;&#x440;&#x442;&#x438;&#x43D;&#x43A;&#x430; - &#x430; &#x447;&#x442;&#x43E; &#x434;&#x435;&#x43B;&#x430;&#x442;&#x44C; &#x441; &#x441;&#x430;&#x43C;&#x43E;&#x439; &#x438;&#x433;&#x440;&#x43E;&#x439; - 51 &#x44D;&#x442;&#x43E;&#x442; &#x43D;&#x435; &#x437;&#x43D;&#x430;&#x435;&#x442;. &#x42F; &#x442;&#x430;&#x43A; &#x43F;&#x43E;&#x43D;&#x438;&#x43C;&#x430;&#x44E;, &#x443; &#x434;&#x430;&#x43D;&#x43D;&#x43E;&#x433;&#x43E; &#x442;&#x432;&#x43E;&#x440;&#x446;&#x430; &#x435;&#x441;&#x442;&#x44C;</span><span class="blurb blurb_expanded">&#x421;&#x44E;&#x440;&#x440;&#x435;&#x430;&#x43B;&#x438;&#x437;&#x43C; &#x432;&#x44B;&#x433;&#x43B;&#x44F;&#x434;&#x438;&#x442; &#x43D;&#x435;&#x43B;&#x435;&#x43F;&#x43E;, &#x43D;&#x43E; &#x43E;&#x442; &#x44D;&#x442;&#x43E;&#x433;&#x43E; &#x432;&#x441;&#x44F;&#x43A;&#x430;&#x44F; &#x43D;&#x435;&#x43B;&#x435;&#x43F;&#x43E;&#x441;&#x442;&#x44C; &#x438; &#x432;&#x44B;&#x447;&#x443;&#x440;&#x43D;&#x43E;&#x441;&#x442;&#x44C; &#x43D;&#x435; &#x441;&#x442;&#x430;&#x43D;&#x43E;&#x432;&#x438;&#x442;&#x441;&#x44F; &#x441;&#x44E;&#x440;&#x440;&#x435;&#x430;&#x43B;&#x438;&#x437;&#x43C;&#x43E;&#x43C;. &#x410;&#x432;&#x442;&#x43E;&#x440;&#x443; &#x43E;&#x442;&#x43A;&#x430;&#x437;&#x430;&#x43B;&#x43E; &#x447;&#x443;&#x432;&#x441;&#x442;&#x432;&#x43E; &#x432;&#x43A;&#x443;&#x441;&#x430;, &#x435;&#x441;&#x43B;&#x438; &#x438;&#x43C;&#x435;&#x43B;&#x43E;&#x441;&#x44C;, &#x438; &#x43E;&#x43D; &#x443;&#x442;&#x43A;&#x43D;&#x443;&#x43B;&#x441;&#x44F; &#x43D;&#x43E;&#x441;&#x43E;&#x43C; &#x432; &#x442;&#x440;&#x44D;&#x448; &#x2014; &#x432; &#x441;&#x430;&#x43C;&#x43E;&#x43C; &#x43F;&#x43B;&#x43E;&#x445;&#x43E;&#x43C; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x438;&#x438; &#x44D;&#x442;&#x43E;&#x433;&#x43E; &#x441;&#x43B;&#x43E;&#x432;&#x430;. &#x41D;&#x430;&#x43A;&#x438;&#x434;&#x430;&#x44E;&#x442; &#x435;&#x449;&#x451; &#x44D;&#x43F;&#x438;&#x442;&#x435;&#x442;&#x43E;&#x432;: &#x431;&#x435;&#x437;&#x44B;&#x434;&#x435;&#x439;&#x43D;&#x43E;&#x441;&#x442;&#x44C;, &#x431;&#x435;&#x441;&#x442;&#x430;&#x43B;&#x430;&#x43D;&#x43D;&#x43E;&#x441;&#x442;&#x44C;, &#x43A;&#x43B;&#x438;&#x448;&#x435;. &#x417;&#x430;&#x434;&#x443;&#x43C;&#x43A;&#x430; &#x435;&#x441;&#x442;&#x44C; - &#x44D;&#x444;&#x444;&#x435;&#x43A;&#x442;&#x43D;&#x430;&#x44F; &#x43A;&#x430;&#x440;&#x442;&#x438;&#x43D;&#x43A;&#x430; - &#x430; &#x447;&#x442;&#x43E; &#x434;&#x435;&#x43B;&#x430;&#x442;&#x44C; &#x441; &#x441;&#x430;&#x43C;&#x43E;&#x439; &#x438;&#x433;&#x440;&#x43E;&#x439; - 51 &#x44D;&#x442;&#x43E;&#x442; &#x43D;&#x435; &#x437;&#x43D;&#x430;&#x435;&#x442;. &#x42F; &#x442;&#x430;&#x43A; &#x43F;&#x43E;&#x43D;&#x438;&#x43C;&#x430;&#x44E;, &#x443; &#x434;&#x430;&#x43D;&#x43D;&#x43E;&#x433;&#x43E; &#x442;&#x432;&#x43E;&#x440;&#x446;&#x430; &#x435;&#x441;&#x442;&#x44C; &#x43E;&#x43F;&#x440;&#x435;&#x434;&#x435;&#x43B;&#x451;&#x43D;&#x43D;&#x44B;&#x435; &#x43F;&#x43E;&#x43A;&#x43B;&#x43E;&#x43D;&#x43D;&#x438;&#x43A;&#x438;, &#x440;&#x430;&#x434;&#x438; &#x44D;&#x442;&#x43E;&#x439; &#x43A;&#x443;&#x447;&#x43A;&#x438; &#x43E;&#x43D;, &#x432;&#x438;&#x434;&#x430;&#x442;&#x44C;, &#x438; &quot;&#x441;&#x442;&#x430;&#x440;&#x430;&#x435;&#x442;&#x441;&#x44F;&quot;: &#x43D;&#x430;&#x43B;&#x435;&#x43F;&#x438;&#x43B; &#x438;&#x437; &#x442;&#x43E;&#x433;&#x43E; &#x447;&#x442;&#x43E; &#x431;&#x44B;&#x43B;&#x43E; &#x2013; &#x441;&#x43E;&#x436;&#x440;&#x443;&#x442;. &#x41B;&#x438;&#x448;&#x43D;&#x438;&#x43C; &#x441;&#x432;&#x438;&#x434;&#x435;&#x442;&#x435;&#x43B;&#x44C;&#x441;&#x442;&#x432;&#x43E;&#x43C; &#x43F;&#x440;&#x43E;&#x444;&#x430;&#x43D;&#x430;&#x446;&#x438;&#x438; &#x44F;&#x432;&#x43B;&#x44F;&#x435;&#x442;&#x441;&#x44F; &#x43D;&#x438;&#x43A;&#x447;&#x451;&#x43C;&#x43D;&#x44B;&#x439; &#x43E;&#x434;&#x43D;&#x43E;&#x43E;&#x431;&#x440;&#x430;&#x437;&#x43D;&#x44B;&#x439; &#x433;&#x435;&#x439;&#x43C;&#x43F;&#x43B;&#x435;&#x439; &#x441; &#x43A;&#x430;&#x43C;&#x435;&#x440;&#x43E;&#x439;  &#x438;&#x437; &#x438;&#x433;&#x440; &#x441;&#x435;&#x440;&#x435;&#x434;&#x438;&#x43D;&#x44B; 00-&#x445;, &#x430;-&#x43B;&#x44F; Tenchu, &#x432;&#x440;&#x430;&#x433;&#x43E;&#x432;, &#x43A;&#x43E;&#x442;&#x43E;&#x440;&#x44B;&#x445; &#x43C;&#x43E;&#x436;&#x43D;&#x43E; &#x43F;&#x435;&#x440;&#x435;&#x441;&#x447;&#x438;&#x442;&#x430;&#x442;&#x44C; &#x43F;&#x430;&#x43B;&#x44C;&#x446;&#x430;&#x43C;&#x438; &#x43E;&#x434;&#x43D;&#x43E;&#x439; &#x440;&#x443;&#x43A;&#x438; &#x43E;&#x434;&#x43D;&#x43E;&#x433;&#x43E; &#x43E;&#x43F;&#x44B;&#x442;&#x43D;&#x43E;&#x433;&#x43E; &#x442;&#x43E;&#x43A;&#x430;&#x440;&#x44F; &#x438; &#x43D;&#x430;&#x431;&#x43E;&#x440;&#x43E;&#x43C; &#x43F;&#x440;&#x438;&#x451;&#x43C;&#x447;&#x438;&#x43A;&#x43E;&#x432; &#x2014; &#x43F;&#x435;&#x440;&#x435;&#x441;&#x447;&#x438;&#x442;&#x430;&#x43D;&#x43D;&#x44B;&#x445; &#x432;&#x442;&#x43E;&#x440;&#x43E;&#x439; &#x440;&#x443;&#x43A;&#x43E;&#x439;.</span><span class="blurb_etc">&#x2026;</span> <a rel="nofollow" class="toggle_expand_collapse toggle_expand" href="/game/pc/killer-is-dead-nightmare-edition/user-reviews?user_review_id=5026986">Expand</a></span>
            </div>
                            </div>
                                                        <div class="review_section review_actions ">
                                <ul class="review_actions">
                                                                            <li class="review_action review_helpful">
                                            <div class="review_helpful">
    <div class="rating_thumbs">
        			<div class="helpful_summary thumb_count">
				<a href="https://secure.metacritic.com/login">
				<span class="total_ups">1</span>
				of 
				<span class="total_thumbs">5</span>
				users found this helpful
                </a>
			</div>
                <div style="clear:both;"></div>
    </div>
</div>
                                        </li>
                                                                                                                                                <li class="review_action">
                                        <a href="/user/zzZZZzzzzZZz">All this user&apos;s reviews</a>
                                    </li>
                                                                    </ul>
                            </div>
                            
                                                    </div>
                    </div></div></div></div>
                </li>
                                                                                    <li id="user_review_4344563" class="review user_review">
                    <div class="review_btm review_btm_r"><div class="review_btm review_btm_l"><div class="review_top review_top_r"><div class="review_top review_top_l">
                        <div class="review_content">
                            <div class="review_section">
                                <div class="review_stats">
                                    <div class="review_critic">
                                        <div class="name">
                                                                                            <a href="/user/Rayman225">Rayman225</a>
                                                                                                                                </div>

                                                                                    <div class="date">Jul 10, 2014</div>
                                                                            </div>
                                    
                                    <div class="review_grade">
                                                
<div class="metascore_w user medium game positive indiv perfect">10</div>

                                    </div>
                                </div>
                                <div class="review_body">
                                                        
                                        <span>I don&apos;t get why are you complaining about, the port is good, it has a good Mouse and Keyboard controls unlike the other Japanese hack and slash games.
<br>And stop lying, this game has no glitch.
<br>All this negative user scores are made by a butthurt console gamers, the question is, why? Are you butthurt because this game was released on PC?</span>
            </div>
                            </div>
                                                        <div class="review_section review_actions ">
                                <ul class="review_actions">
                                                                            <li class="review_action review_helpful">
                                            <div class="review_helpful">
    <div class="rating_thumbs">
        			<div class="helpful_summary thumb_count">
				<a href="https://secure.metacritic.com/login">
				<span class="total_ups">1</span>
				of 
				<span class="total_thumbs">7</span>
				users found this helpful
                </a>
			</div>
                <div style="clear:both;"></div>
    </div>
</div>
                                        </li>
                                                                                                                                                <li class="review_action">
                                        <a href="/user/Rayman225">All this user&apos;s reviews</a>
                                    </li>
                                                                    </ul>
                            </div>
                            
                                                    </div>
                    </div></div></div></div>
                </li>
                                                                                    <li id="user_review_5666101" class="review user_review">
                    <div class="review_btm review_btm_r"><div class="review_btm review_btm_l"><div class="review_top review_top_r"><div class="review_top review_top_l">
                        <div class="review_content">
                            <div class="review_section">
                                <div class="review_stats">
                                    <div class="review_critic">
                                        <div class="name">
                                                                                            <a href="/user/SquishyEye">SquishyEye</a>
                                                                                                                                </div>

                                                                                    <div class="date">Nov  9, 2015</div>
                                                                            </div>
                                    
                                    <div class="review_grade">
                                                
<div class="metascore_w user medium game mixed indiv">5</div>

                                    </div>
                                </div>
                                <div class="review_body">
                                                        
                                        <span class="inline_expand_collapse inline_collapsed" id="review_blurb_5666101"><span class="blurb blurb_collapsed">I gave this a good try, but i just can&apos;t like it.
<br>The gameplay is mediocre, if you&apos;re expecting a Devil May Cry or a God of War - the combat just doesn&apos;t deliver. It&apos;s a button masher, and I couldn&apos;t make it into anything more, no matter how much I tried to use special abilities and attacks, (and I have plenty of experience with action games.) Controls were fine with a controller, (I</span><span class="blurb blurb_expanded">I gave this a good try, but i just can&apos;t like it.
<br>The gameplay is mediocre, if you&apos;re expecting a Devil May Cry or a God of War - the combat just doesn&apos;t deliver. It&apos;s a button masher, and I couldn&apos;t make it into anything more, no matter how much I tried to use special abilities and attacks, (and I have plenty of experience with action games.) Controls were fine with a controller, (I can&apos;t speak for M&amp;B - i didn&apos;t try), but it was just boring.
<br>As far as art assets and story go... Someone compared this to Lynch.. This is NOT Lynch. Lynch has a soul, and a certain depth... This just felt like someone found an equation for surreal art and simply followed it, without actually believing in it. Random stories, obscure humor, characters that have no explanation of why they are there and who are they really, just a ton of disconnected strings all over that don&apos;t make up a cohesive whole. I mean, maybe some people are into that, but I&apos;m not, so I can&apos;t recommend this. I love Magritte, and Lynch, and in their surreal there is at least something that ties everything together. This game is more like someone just colored a canvas black, added a big red circle, then decided to add a robot arm, and then thought let&apos;s throw a unicorn in there for the hell of it, because why not.
<br>I guess I&apos;ll give this game some points, but only because it&apos;s at least something I haven&apos;t seen before. And there were some decent comic-book-style cutscene shots that were visually well delivered, I guess. But overall - it was a pretty mediocre ride on most accounts.</span><span class="blurb_etc">&#x2026;</span> <a rel="nofollow" class="toggle_expand_collapse toggle_expand" href="/game/pc/killer-is-dead-nightmare-edition/user-reviews?user_review_id=5666101">Expand</a></span>
            </div>
                            </div>
                                                        <div class="review_section review_actions ">
                                <ul class="review_actions">
                                                                            <li class="review_action review_helpful">
                                            <div class="review_helpful">
    <div class="rating_thumbs">
        			<div class="helpful_summary thumb_count">
				<a href="https://secure.metacritic.com/login">
				<span class="total_ups">0</span>
				of 
				<span class="total_thumbs">0</span>
				users found this helpful
                </a>
			</div>
                <div style="clear:both;"></div>
    </div>
</div>
                                        </li>
                                                                                                                                                <li class="review_action">
                                        <a href="/user/SquishyEye">All this user&apos;s reviews</a>
                                    </li>
                                                                    </ul>
                            </div>
                            
                                                    </div>
                    </div></div></div></div>
                </li>
                                                                                    <li id="user_review_6719055" class="review user_review">
                    <div class="review_btm review_btm_r"><div class="review_btm review_btm_l"><div class="review_top review_top_r"><div class="review_top review_top_l">
                        <div class="review_content">
                            <div class="review_section">
                                <div class="review_stats">
                                    <div class="review_critic">
                                        <div class="name">
                                                                                            <a href="/user/dugazoid">dugazoid</a>
                                                                                                                                </div>

                                                                                    <div class="date">Oct  3, 2016</div>
                                                                            </div>
                                    
                                    <div class="review_grade">
                                                
<div class="metascore_w user medium game positive indiv">8</div>

                                    </div>
                                </div>
                                <div class="review_body">
                                                        
                                        <span>SUDA51 is one of my favourite studios, so... The graphics, gameplay and, overall, characters, are at a level that only this studio can reach.
<br>
<br>Maybe too short, but quite re-playable.</span>
            </div>
                            </div>
                                                        <div class="review_section review_actions ">
                                <ul class="review_actions">
                                                                            <li class="review_action review_helpful">
                                            <div class="review_helpful">
    <div class="rating_thumbs">
        			<div class="helpful_summary thumb_count">
				<a href="https://secure.metacritic.com/login">
				<span class="total_ups">0</span>
				of 
				<span class="total_thumbs">0</span>
				users found this helpful
                </a>
			</div>
                <div style="clear:both;"></div>
    </div>
</div>
                                        </li>
                                                                                                                                                <li class="review_action">
                                        <a href="/user/dugazoid">All this user&apos;s reviews</a>
                                    </li>
                                                                    </ul>
                            </div>
                            
                                                    </div>
                    </div></div></div></div>
                </li>
                                                                                    <li id="user_review_6974568" class="review user_review">
                    <div class="review_btm review_btm_r"><div class="review_btm review_btm_l"><div class="review_top review_top_r"><div class="review_top review_top_l">
                        <div class="review_content">
                            <div class="review_section">
                                <div class="review_stats">
                                    <div class="review_critic">
                                        <div class="name">
                                                                                            <a href="/user/seifershneider">seifershneider</a>
                                                                                                                                </div>

                                                                                    <div class="date">Feb 16, 2017</div>
                                                                            </div>
                                    
                                    <div class="review_grade">
                                                
<div class="metascore_w user medium game mixed indiv">6</div>

                                    </div>
                                </div>
                                <div class="review_body">
                                                        
                                        <span>Pros:
<br>+ Mysterious world
<br>+ Curiously bizarre
<br>+ Fun boss concepts
<br>+ Enjoyed the challenge overall
<br>+ Interesting character design
<br>
<br>Cons:
<br>- Too short
<br>- Convoluted story
<br>- Combat should have had more dept
<br>- Menu navigation is so slow
<br>- Graphics are very bare bone
<br>- Some missions/task were boring
<br>
<br>Verdict: C+</span>
            </div>
                            </div>
                                                        <div class="review_section review_actions ">
                                <ul class="review_actions">
                                                                            <li class="review_action review_helpful">
                                            <div class="review_helpful">
    <div class="rating_thumbs">
        			<div class="helpful_summary thumb_count">
				<a href="https://secure.metacritic.com/login">
				<span class="total_ups">0</span>
				of 
				<span class="total_thumbs">0</span>
				users found this helpful
                </a>
			</div>
                <div style="clear:both;"></div>
    </div>
</div>
                                        </li>
                                                                                                                                                <li class="review_action">
                                        <a href="/user/seifershneider">All this user&apos;s reviews</a>
                                    </li>
                                                                    </ul>
                            </div>
                            
                                                    </div>
                    </div></div></div></div>
                </li>
                                                                                    <li id="user_review_7454974" class="review user_review last_review">
                    <div class="review_btm review_btm_r"><div class="review_btm review_btm_l"><div class="review_top review_top_r"><div class="review_top review_top_l">
                        <div class="review_content">
                            <div class="review_section">
                                <div class="review_stats">
                                    <div class="review_critic">
                                        <div class="name">
                                                                                            <a href="/user/Gracz-org">Gracz-org</a>
                                                                                                                                </div>

                                                                                    <div class="date">Aug  8, 2017</div>
                                                                            </div>
                                    
                                    <div class="review_grade">
                                                
<div class="metascore_w user medium game positive indiv">9</div>

                                    </div>
                                </div>
                                <div class="review_body">
                                                        
                                        <span class="inline_expand_collapse inline_collapsed" id="review_blurb_7454974"><span class="blurb blurb_collapsed">Killer is Dead okaza&#x142; si&#x119; zaskakuj&#x105;co udanym tytu&#x142;em, kt&#xF3;ry ju&#x17C; na zawsze wpisa&#x142; si&#x119; w moj&#x105; list&#x119; najlepszych gier wszech czas&#xF3;w. Fabu&#x142;a jest tutaj na tyle rozbudowana, &#x17C;e ka&#x17C;dy fan japo&#x144;skich &#x201E;telenowel&#x201D; powinien by&#x107; usatysfakcjonowany^^. Naszym najgro&#x17A;niejszym przeciwnikiem b&#x119;dzie tu niejaki David, kt&#xF3;ry jest nam o wiele bli&#x17C;szy ni&#x17C; si&#x119; na pocz&#x105;tku wydaje i w pewnym momencie zacznie</span><span class="blurb blurb_expanded">Killer is Dead okaza&#x142; si&#x119; zaskakuj&#x105;co udanym tytu&#x142;em, kt&#xF3;ry ju&#x17C; na zawsze wpisa&#x142; si&#x119; w moj&#x105; list&#x119; najlepszych gier wszech czas&#xF3;w. Fabu&#x142;a jest tutaj na tyle rozbudowana, &#x17C;e ka&#x17C;dy fan japo&#x144;skich &#x201E;telenowel&#x201D; powinien by&#x107; usatysfakcjonowany^^. Naszym najgro&#x17A;niejszym przeciwnikiem b&#x119;dzie tu niejaki David, kt&#xF3;ry jest nam o wiele bli&#x17C;szy ni&#x17C; si&#x119; na pocz&#x105;tku wydaje i w pewnym momencie zacznie stawa&#x107; si&#x119; r&#xF3;wnie&#x17C; cz&#x119;&#x15B;ci&#x105; naszych wspomnie&#x144;&#x2026; No w&#x142;a&#x15B;nie, kim on w&#x142;a&#x15B;ciwie jest? Przekonajcie si&#x119; sami ;-) Uko&#x144;czenie g&#x142;&#xF3;wnego w&#x105;tku fabularnego i misji pobocznych zaj&#x119;&#x142;o mi oko&#x142;o 9 godzin - d&#x142;ugo&#x15B;&#x107; rozgrywki jest wi&#x119;c ca&#x142;kiem zno&#x15B;na. Na zako&#x144;czenie dodam jeszcze stwierdzenie, kt&#xF3;re niew&#x105;tpliwie przebija si&#x119; przez ca&#x142;&#x105; recenzj&#x119;, a czego mo&#x17C;e jeszcze nie zd&#x105;&#x17C;yli&#x15B;cie zauwa&#x17C;y&#x107; - gra jest po prostu rewelacyjna!
<br>
<br>The Job is complete - Killer is Dead!
<br>
<br>Plusy:
<br>+ niesamowita i wci&#x105;gaj&#x105;ca historia
<br>+ rewelacyjnie przedstawiony g&#x142;&#xF3;wny bohater
<br>+ wszechobecny humor
<br>+ satysfakcjonuj&#x105;ca rozgrywka
<br>+ efektowna i emocjonuj&#x105;ca walka
<br>+ r&#xF3;&#x17C;norodne i &#x15B;wietnie przedstawione lokacje
<br>+ wampiry na ksi&#x119;&#x17C;ycu^^
<br>+ dla tego tytu&#x142;u kupi&#x142;bym konsol&#x119;&#x2026;
<br>
<br>Minusy:
<br>&#x2013; grafika mog&#x142;aby by&#x107; ciut lepsza
<br>&#x2013; troch&#x119; nudz&#x105;ce misje poboczne
<br>
<br>Pe&#x142;na recenzja dost&#x119;pna jest na blogu Gracz.org</span><span class="blurb_etc">&#x2026;</span> <a rel="nofollow" class="toggle_expand_collapse toggle_expand" href="/game/pc/killer-is-dead-nightmare-edition/user-reviews?user_review_id=7454974">Expand</a></span>
            </div>
                            </div>
                                                        <div class="review_section review_actions ">
                                <ul class="review_actions">
                                                                            <li class="review_action review_helpful">
                                            <div class="review_helpful">
    <div class="rating_thumbs">
        			<div class="helpful_summary thumb_count">
				<a href="https://secure.metacritic.com/login">
				<span class="total_ups">0</span>
				of 
				<span class="total_thumbs">0</span>
				users found this helpful
                </a>
			</div>
                <div style="clear:both;"></div>
    </div>
</div>
                                        </li>
                                                                                                                                                <li class="review_action">
                                        <a href="/user/Gracz-org">All this user&apos;s reviews</a>
                                    </li>
                                                                    </ul>
                            </div>
                            
                                                    </div>
                    </div></div></div></div>
                </li>
                                            