
                                                            <li id="user_review_7304832" class="review user_review first_review">
                    <div class="review_btm review_btm_r"><div class="review_btm review_btm_l"><div class="review_top review_top_r"><div class="review_top review_top_l">
                        <div class="review_content">
                            <div class="review_section">
                                <div class="review_stats">
                                    <div class="review_critic">
                                        <div class="name">
                                                                                            <a href="/user/SuperkenGaming">SuperkenGaming</a>
                                                                                                                                </div>

                                                                                    <div class="date">May 16, 2017</div>
                                                                            </div>
                                    
                                    <div class="review_grade">
                                                
<div class="metascore_w user medium game mixed indiv">7</div>

                                    </div>
                                </div>
                                <div class="review_body">
                                                        
                                        <span class="inline_expand_collapse inline_collapsed" id="review_blurb_7304832"><span class="blurb blurb_collapsed">Seasons After Fall
<br>A beautiful game with too much repeating.
<br>Season afterfall is a metroidvania styled 2d puzzle platformer where you play a seed that takes control of a fox..
you use this fox to platform to the different season guardians for their power,
once you reach them, you use your newly acquired powers to get back and go for the next&#x2026;
Your powers are changing the seasons..
As</span><span class="blurb blurb_expanded">Seasons After Fall
<br>A beautiful game with too much repeating.
<br>Season afterfall is a metroidvania styled 2d puzzle platformer where you play a seed that takes control of a fox..
<br>you use this fox to platform to the different season guardians for their power,
<br>once you reach them, you use your newly acquired powers to get back and go for the next&#x2026;
<br>Your powers are changing the seasons..
<br>As you change the season the items in the environment change, plants will die or come to life..
<br>you can even stack effects like adding water to a guizer to freeze it when its taller for example&#x2026;
<br>The first half of this 6 hour game is great, the world is beautiful,
<br>there a nice voice telling you the story of the guardians, the seasons, and reminding you where oyu should be going if you get lost,,
<br>the puzzle platforming is fun, and fluent&#x2026;
<br>running through these levels as a fox feels freeing&#x2026;
<br>And then the game just goes on repeat..
<br>you have to go back to these sections 2 more times to get to the end game..
<br>sure seeing different sections to these levels.. but this is where the puzzles start piling on and the game starts feeling like a chore..
<br>ruining the initial freeing feeling this game gives..
<br>Not to say the game gets bad..
<br>it just gets more stressful and its no fun to go through locations you&#x2019;ve already been to even if you have new powers this time or things are a little different&#x2026;
<br>It just made me miss the first few hours of the game that much more
<br>Seasons After Fall starts out great and had potential to be one of my favorites of the year,
<br>but the 2nd half drags it down big time and feels almost like a completely different game
<br>It takes a great game and makes it just almost great&#x2026;
<br>The game would&#x2019;ve greatly benefitted to completely different paths for the 2nd half rather than retracing a lot of your steps and essentially activating switches
<br>I give Seasons After Fall
<br>a 7.5/10</span><span class="blurb_etc">&#x2026;</span> <a rel="nofollow" class="toggle_expand_collapse toggle_expand" href="/game/pc/seasons-after-fall/user-reviews?user_review_id=7304832">Expand</a></span>
            </div>
                            </div>
                                                        <div class="review_section review_actions ">
                                <ul class="review_actions">
                                                                            <li class="review_action review_helpful">
                                            <div class="review_helpful">
    <div class="rating_thumbs">
        			<div class="helpful_summary thumb_count">
				<a href="https://secure.metacritic.com/login">
				<span class="total_ups">1</span>
				of 
				<span class="total_thumbs">1</span>
				users found this helpful
                </a>
			</div>
                <div style="clear:both;"></div>
    </div>
</div>
                                        </li>
                                                                                                                                                <li class="review_action">
                                        <a href="/user/SuperkenGaming">All this user&apos;s reviews</a>
                                    </li>
                                                                    </ul>
                            </div>
                            
                                                    </div>
                    </div></div></div></div>
                </li>
                                                                                    <li id="user_review_6752693" class="review user_review">
                    <div class="review_btm review_btm_r"><div class="review_btm review_btm_l"><div class="review_top review_top_r"><div class="review_top review_top_l">
                        <div class="review_content">
                            <div class="review_section">
                                <div class="review_stats">
                                    <div class="review_critic">
                                        <div class="name">
                                                                                            <a href="/user/Tuskymon">Tuskymon</a>
                                                                                                                                </div>

                                                                                    <div class="date">Oct 15, 2016</div>
                                                                            </div>
                                    
                                    <div class="review_grade">
                                                
<div class="metascore_w user medium game mixed indiv">6</div>

                                    </div>
                                </div>
                                <div class="review_body">
                                                        
                                        <span class="inline_expand_collapse inline_collapsed" id="review_blurb_6752693"><span class="blurb blurb_collapsed">[Russian] &#x418;&#x433;&#x440;&#x430; &#x43C;&#x435;&#x43D;&#x44F; &#x43E;&#x447;&#x435;&#x43D;&#x44C; &#x440;&#x430;&#x437;&#x43E;&#x447;&#x430;&#x440;&#x43E;&#x432;&#x430;&#x43B;&#x430;, &#x43F;&#x43E; &#x43F;&#x435;&#x440;&#x432;&#x44B;&#x43C; &#x43E;&#x431;&#x437;&#x43E;&#x440;&#x430;&#x43C; &#x438; &#x442;&#x440;&#x435;&#x439;&#x43B;&#x43B;&#x435;&#x440;&#x430;&#x43C; &#x43E;&#x43D;&#x430; &#x434;&#x43E;&#x43B;&#x436;&#x43D;&#x430; &#x431;&#x44B;&#x43B;&#x430; &#x431;&#x44B;&#x442;&#x44C; &#x447;&#x443;&#x442;&#x44C; &#x43B;&#x438; &#x43D;&#x435; &#x432;&#x442;&#x43E;&#x440;&#x44B;&#x43C; &#x43F;&#x43B;&#x430;&#x442;&#x444;&#x43E;&#x440;&#x43C;&#x435;&#x440;&#x43E;&#x43C; &#x437;&#x430; &#x432;&#x441;&#x44E; &#x438;&#x441;&#x442;&#x43E;&#x440;&#x438;&#x44E; &#x432;&#x438;&#x434;&#x435;&#x43E;&#x438;&#x433;&#x440;, &#x441;&#x440;&#x430;&#x437;&#x443; &#x436;&#x435; &#x43F;&#x43E;&#x441;&#x43B;&#x435; Ori and the Blind Forest. &#x41E;&#x434;&#x43D;&#x430;&#x43A;&#x43E;, &#x43D;&#x430; &#x43F;&#x440;&#x430;&#x43A;&#x442;&#x438;&#x43A;&#x435;, &#x43A;&#x430;&#x43A; &#x431;&#x44B; &#x43C;&#x430;&#x43B;&#x43E; &#x438;&#x43B;&#x438; &#x43C;&#x43D;&#x43E;&#x433;&#x43E; &#x43E;&#x442; &#x43D;&#x435;&#x435; &#x43D;&#x438; &#x436;&#x434;&#x430;&#x43B;&#x438;, &#x43F;&#x43E;&#x43B;&#x443;&#x447;&#x430;&#x435;&#x442;&#x435; &#x432;&#x44B;, &#x440;&#x43E;&#x432;&#x43D;&#x44B;&#x43C; &#x441;&#x447;&#x435;&#x442;&#x43E;&#x43C;, &#x43F;&#x440;&#x430;&#x43A;&#x442;&#x438;&#x447;&#x435;&#x441;&#x43A;&#x438; &#x434;&#x430; &#x43D;&#x438;&#x444;&#x438;&#x433;&#x430;. &#x414;&#x430;, &#x437;&#x434;&#x435;&#x441;&#x44C; &#x43A;&#x440;&#x430;&#x441;&#x438;&#x432;&#x430;&#x44F; &#x430;&#x432;&#x442;&#x43E;&#x440;&#x441;&#x43A;&#x430;&#x44F; &#x440;&#x438;&#x441;&#x43E;&#x432;&#x43A;&#x430; &#x438; &#x43D;&#x435;&#x43F;&#x43B;&#x43E;&#x445;&#x43E;&#x439; &#x43E;&#x440;&#x438;&#x433;&#x438;&#x43D;&#x430;&#x43B;&#x44C;&#x43D;&#x44B;&#x439; &#x441;&#x430;&#x443;&#x43D;&#x434;&#x442;&#x440;&#x435;&#x43A;, &#x434;&#x430; &#x438;, &#x432;&#x440;&#x43E;&#x434;&#x435;, &#x441;&#x44E;&#x436;&#x435;&#x442;</span><span class="blurb blurb_expanded">[Russian] &#x418;&#x433;&#x440;&#x430; &#x43C;&#x435;&#x43D;&#x44F; &#x43E;&#x447;&#x435;&#x43D;&#x44C; &#x440;&#x430;&#x437;&#x43E;&#x447;&#x430;&#x440;&#x43E;&#x432;&#x430;&#x43B;&#x430;, &#x43F;&#x43E; &#x43F;&#x435;&#x440;&#x432;&#x44B;&#x43C; &#x43E;&#x431;&#x437;&#x43E;&#x440;&#x430;&#x43C; &#x438; &#x442;&#x440;&#x435;&#x439;&#x43B;&#x43B;&#x435;&#x440;&#x430;&#x43C; &#x43E;&#x43D;&#x430; &#x434;&#x43E;&#x43B;&#x436;&#x43D;&#x430; &#x431;&#x44B;&#x43B;&#x430; &#x431;&#x44B;&#x442;&#x44C; &#x447;&#x443;&#x442;&#x44C; &#x43B;&#x438; &#x43D;&#x435; &#x432;&#x442;&#x43E;&#x440;&#x44B;&#x43C; &#x43F;&#x43B;&#x430;&#x442;&#x444;&#x43E;&#x440;&#x43C;&#x435;&#x440;&#x43E;&#x43C; &#x437;&#x430; &#x432;&#x441;&#x44E; &#x438;&#x441;&#x442;&#x43E;&#x440;&#x438;&#x44E; &#x432;&#x438;&#x434;&#x435;&#x43E;&#x438;&#x433;&#x440;, &#x441;&#x440;&#x430;&#x437;&#x443; &#x436;&#x435; &#x43F;&#x43E;&#x441;&#x43B;&#x435; Ori and the Blind Forest. &#x41E;&#x434;&#x43D;&#x430;&#x43A;&#x43E;, &#x43D;&#x430; &#x43F;&#x440;&#x430;&#x43A;&#x442;&#x438;&#x43A;&#x435;, &#x43A;&#x430;&#x43A; &#x431;&#x44B; &#x43C;&#x430;&#x43B;&#x43E; &#x438;&#x43B;&#x438; &#x43C;&#x43D;&#x43E;&#x433;&#x43E; &#x43E;&#x442; &#x43D;&#x435;&#x435; &#x43D;&#x438; &#x436;&#x434;&#x430;&#x43B;&#x438;, &#x43F;&#x43E;&#x43B;&#x443;&#x447;&#x430;&#x435;&#x442;&#x435; &#x432;&#x44B;, &#x440;&#x43E;&#x432;&#x43D;&#x44B;&#x43C; &#x441;&#x447;&#x435;&#x442;&#x43E;&#x43C;, &#x43F;&#x440;&#x430;&#x43A;&#x442;&#x438;&#x447;&#x435;&#x441;&#x43A;&#x438; &#x434;&#x430; &#x43D;&#x438;&#x444;&#x438;&#x433;&#x430;. &#x414;&#x430;, &#x437;&#x434;&#x435;&#x441;&#x44C; &#x43A;&#x440;&#x430;&#x441;&#x438;&#x432;&#x430;&#x44F; &#x430;&#x432;&#x442;&#x43E;&#x440;&#x441;&#x43A;&#x430;&#x44F; &#x440;&#x438;&#x441;&#x43E;&#x432;&#x43A;&#x430; &#x438; &#x43D;&#x435;&#x43F;&#x43B;&#x43E;&#x445;&#x43E;&#x439; &#x43E;&#x440;&#x438;&#x433;&#x438;&#x43D;&#x430;&#x43B;&#x44C;&#x43D;&#x44B;&#x439; &#x441;&#x430;&#x443;&#x43D;&#x434;&#x442;&#x440;&#x435;&#x43A;, &#x434;&#x430; &#x438;, &#x432;&#x440;&#x43E;&#x434;&#x435;, &#x441;&#x44E;&#x436;&#x435;&#x442; &#x43F;&#x440;&#x43E;&#x441;&#x43B;&#x435;&#x436;&#x438;&#x432;&#x430;&#x435;&#x442;&#x441;&#x44F; &#x43D;&#x435;&#x43F;&#x43B;&#x43E;&#x445;&#x43E;&#x439;, &#x43D;&#x43E; &#x44D;&#x442;&#x43E; &#x432;&#x441;&#x435; &#x43F;&#x440;&#x435;&#x43F;&#x43E;&#x434;&#x43D;&#x435;&#x441;&#x435;&#x43D;&#x43E; &#x43D;&#x430;&#x441;&#x442;&#x43E;&#x43B;&#x44C;&#x43A;&#x43E; &#x443;&#x43D;&#x44B;&#x43B;&#x43E; &#x438; &#x441;&#x43A;&#x443;&#x447;&#x43D;&#x43E;, &#x447;&#x442;&#x43E; &#x43F;&#x43E;&#x441;&#x43B;&#x435; 40 &#x43C;&#x438;&#x43D;&#x443;&#x442; &#x438;&#x433;&#x440;&#x44B; &#x441;&#x440;&#x435;&#x434;&#x44C; &#x431;&#x435;&#x43B;&#x430; &#x434;&#x43D;&#x44F;, &#x43C;&#x435;&#x43D;&#x44F; &#x436;&#x443;&#x442;&#x43A;&#x43E; &#x43F;&#x43E;&#x43A;&#x43B;&#x43E;&#x43D;&#x438;&#x43B;&#x43E; &#x432; &#x441;&#x43E;&#x43D;, &#x438; &#x43A;&#x430;&#x43A; &#x431;&#x44B; &#x44F; &#x43D;&#x435; &#x43F;&#x44B;&#x442;&#x430;&#x43B;&#x441;&#x44F; &#x437;&#x430;&#x441;&#x442;&#x430;&#x432;&#x438;&#x442;&#x44C; &#x441;&#x435;&#x431;&#x44F; &#x435;&#x435; &#x434;&#x43E;&#x43F;&#x440;&#x43E;&#x439;&#x442;&#x438;, &#x44F; &#x44D;&#x442;&#x43E;&#x433;&#x43E; &#x441;&#x434;&#x435;&#x43B;&#x430;&#x442;&#x44C; &#x434;&#x43E; &#x441;&#x438;&#x445; &#x43F;&#x43E;&#x440; &#x43D;&#x435; &#x441;&#x43C;&#x43E;&#x433;. &#x41C;&#x43E;&#x436;&#x435;&#x442; &#x431;&#x44B;&#x442;&#x44C;, &#x432; &#x434;&#x430;&#x43B;&#x435;&#x43A;&#x43E;&#x43C; &#x431;&#x443;&#x434;&#x443;&#x449;&#x435;&#x43C;, &#x43C;&#x43D;&#x435; &#x441;&#x442;&#x430;&#x43D;&#x435;&#x442; &#x436;&#x430;&#x43B;&#x43A;&#x43E; &#x43F;&#x43E;&#x442;&#x440;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44B;&#x435; 700 &#x440;&#x443;&#x431;&#x43B;&#x435;&#x439; &#x438; &#x44F; &#x441;&#x434;&#x435;&#x43B;&#x430;&#x44E; &#x44D;&#x442;&#x43E;... &#x445;&#x43E;&#x442;&#x44F; &#x43D;&#x435;... &#x432;&#x440;&#x44F;&#x434; &#x43B;&#x438;. &#x42F; &#x441;&#x43B;&#x438;&#x448;&#x43A;&#x43E;&#x43C; &#x440;&#x430;&#x437;&#x43E;&#x447;&#x430;&#x440;&#x43E;&#x432;&#x430;&#x43D;. &#x42F; &#x431;&#x44B; &#x441; &#x443;&#x434;&#x43E;&#x432;&#x43E;&#x43B;&#x44C;&#x441;&#x442;&#x432;&#x438;&#x435;&#x43C; &#x43F;&#x43E;&#x441;&#x442;&#x430;&#x440;&#x430;&#x43B;&#x441;&#x44F; &#x432;&#x435;&#x440;&#x43D;&#x443;&#x442;&#x44C; &#x437;&#x430; &#x43D;&#x435;&#x435; &#x434;&#x435;&#x43D;&#x44C;&#x433;&#x438;...
<br>
<br>&#x41D;&#x43E; &#x435;&#x441;&#x43B;&#x438; &#x447;&#x435;&#x441;&#x442;&#x43D;&#x43E;, &#x43A;&#x430;&#x43A;-&#x442;&#x43E; &#x43E;&#x447;&#x435;&#x43D;&#x44C; &#x43E;&#x431;&#x438;&#x434;&#x43D;&#x43E; &#x437;&#x430; &#x44D;&#x442;&#x43E;&#x433;&#x43E; &#x43C;&#x438;&#x43B;&#x43E;&#x433;&#x43E;, &#x43A;&#x440;&#x430;&#x441;&#x438;&#x432;&#x43E;&#x433;&#x43E; &#x43B;&#x438;&#x441;&#x435;&#x43D;&#x43A;&#x430;, &#x43C;&#x43D;&#x435; &#x435;&#x43C;&#x443; &#x43A;&#x430;&#x43A;-&#x442;&#x43E; &#x436;&#x430;&#x43B;&#x43A;&#x43E; &#x441;&#x442;&#x430;&#x432;&#x438;&#x442;&#x44C; &#x43F;&#x430;&#x43B;&#x435;&#x446; &#x432;&#x43D;&#x438;&#x437;, &#x43D;&#x43E; &#x442;&#x430;&#x43A;&#x43E;&#x432;&#x430; &#x436;&#x438;&#x437;&#x43D;&#x44C;... &#x415;&#x441;&#x442;&#x44C; &#x431;&#x43E;&#x43B;&#x435;&#x435; &#x445;&#x43E;&#x440;&#x43E;&#x448;&#x438;&#x435; &#x43F;&#x43B;&#x430;&#x442;&#x444;&#x43E;&#x440;&#x43C;&#x435;&#x440;&#x44B; (&#x43A;&#x43E;&#x442;&#x43E;&#x440;&#x44B;&#x435;, &#x43A;&#x441;&#x442;&#x430;&#x442;&#x438; &#x434;&#x435;&#x448;&#x435;&#x432;&#x43B;&#x435; &#x44D;&#x442;&#x43E;&#x433;&#x43E;, &#x430; &#x44D;&#x442;&#x43E; &#x433;&#x43B;&#x430;&#x432;&#x43D;&#x430;&#x44F; &#x43F;&#x440;&#x438;&#x447;&#x438;&#x43D;&#x430; &#x43C;&#x43E;&#x435;&#x433;&#x43E; &#x440;&#x430;&#x437;&#x43E;&#x447;&#x430;&#x440;&#x43E;&#x432;&#x430;&#x43D;&#x438;&#x44F;)... &#x415;&#x441;&#x43B;&#x438; &#x443;&#x436; &#x432;&#x44B; &#x434;&#x443;&#x43C;&#x430;&#x435;&#x442;&#x435; &#x431;&#x440;&#x430;&#x442;&#x44C; &#x442;&#x43E;&#x43B;&#x44C;&#x43A;&#x43E; &#x438;&#x437;-&#x437;&#x430; &#x43A;&#x440;&#x430;&#x441;&#x438;&#x432;&#x43E;&#x439; &#x43A;&#x430;&#x440;&#x442;&#x438;&#x43D;&#x43A;&#x438;, &#x442;&#x43E; &#x43E;&#x431;&#x440;&#x430;&#x442;&#x438;&#x442;&#x435; &#x432;&#x43D;&#x438;&#x43C;&#x430;&#x43D;&#x438;&#x435; &#x43D;&#x430; &#x438;&#x433;&#x440;&#x443; Child of Light, &#x442;&#x435; &#x436;&#x435; &#x44F;&#x439;&#x446;&#x430;, &#x442;&#x43E;&#x43B;&#x44C;&#x43A;&#x43E; &#x442;&#x435;&#x43A;&#x441;&#x442;&#x443;&#x440;&#x44B; &#x43E;&#x431;&#x432;&#x435;&#x434;&#x435;&#x43D;&#x44B; &#x447;&#x435;&#x440;&#x43D;&#x44B;&#x43C; &#x43A;&#x430;&#x440;&#x430;&#x43D;&#x434;&#x430;&#x448;&#x43E;&#x43C;.
<br>
<br>&#x41D;&#x430;&#x447;&#x438;&#x43D;&#x430;&#x435;&#x442;&#x441;&#x44F; &#x440;&#x430;&#x437;&#x43E;&#x447;&#x430;&#x440;&#x43E;&#x432;&#x430;&#x43D;&#x438;&#x435; &#x441;&#x43E; &#x441;&#x442;&#x440;&#x430;&#x43D;&#x438;&#x446;&#x44B; &#x432; &#x43C;&#x430;&#x433;&#x430;&#x437;&#x438;&#x43D;&#x435;, &#x43A;&#x43E;&#x433;&#x434;&#x430; &#x432;&#x438;&#x434;&#x438;&#x448;&#x44C;, &#x447;&#x442;&#x43E; &#x43E; &#x440;&#x443;&#x441;&#x441;&#x43A;&#x43E;&#x439; &#x43E;&#x437;&#x432;&#x443;&#x447;&#x43A;&#x435; &#x43C;&#x43E;&#x436;&#x43D;&#x43E; &#x434;&#x430;&#x436;&#x435; &#x43D;&#x435; &#x43C;&#x435;&#x447;&#x442;&#x430;&#x442;&#x44C;, &#x43D;&#x43E; &#x442;&#x44B; &#x437;&#x430;&#x445;&#x43E;&#x434;&#x438;&#x448;&#x44C; &#x432; &#x43E;&#x431;&#x437;&#x43E;&#x440;&#x44B; &#x438; &#x432;&#x438;&#x434;&#x438;&#x448;&#x44C; &quot;&#x418;&#x433;&#x440;&#x430; &#x43F;&#x43E;&#x43D;&#x44F;&#x442;&#x43D;&#x430; &#x432;&#x437;&#x440;&#x43E;&#x441;&#x43B;&#x44B;&#x43C; &#x438; &#x434;&#x435;&#x442;&#x44F;&#x43C;, &#x438;&#x431;&#x43E; &#x438;&#x441;&#x43F;&#x43E;&#x43B;&#x44C;&#x437;&#x443;&#x435;&#x442;&#x441;&#x44F; &#x443;&#x43F;&#x440;&#x43E;&#x449;&#x435;&#x43D;&#x43D;&#x44B;&#x439; &#x430;&#x43D;&#x433;&#x43B;&#x438;&#x439;&#x441;&#x43A;&#x438;&#x439;&quot;, &#x434;&#x430; &#x43D;&#x438;&#x444;&#x438;&#x433;&#x430; &#x43F;&#x43E;&#x434;&#x43E;&#x431;&#x43D;&#x43E;&#x433;&#x43E;, &#x432;&#x43E;&#x442; &#x43C;&#x43D;&#x435; &#x434;&#x435;&#x43B;&#x430;&#x442;&#x44C; &#x431;&#x43E;&#x43B;&#x44C;&#x448;&#x435; &#x43D;&#x435;&#x447;&#x435;&#x433;&#x43E;, &#x43A;&#x430;&#x43A; &#x43B;&#x43E;&#x43C;&#x430;&#x442;&#x44C; &#x441;&#x438;&#x434;&#x435;&#x442;&#x44C; &#x433;&#x43E;&#x43B;&#x43E;&#x432;&#x443; &#x438; &#x434;&#x443;&#x43C;&#x430;&#x442;&#x44C; &#x43D;&#x430;&#x434; &#x442;&#x435;&#x43C;, &#x43A;&#x430;&#x43A; &#x43F;&#x435;&#x440;&#x435;&#x432;&#x43E;&#x434;&#x438;&#x442;&#x441;&#x44F; &#x442;&#x43E; &#x438;&#x43B;&#x438; &#x438;&#x43D;&#x43E;&#x435; &quot;&#x43F;&#x440;&#x43E;&#x441;&#x442;&#x43E;&#x435;&quot; &#x441;&#x43B;&#x43E;&#x432;&#x43E;, &#x430; &#x43F;&#x43E;&#x442;&#x43E;&#x43C; &#x435;&#x449;&#x435; &#x438; &#x441;&#x440;&#x430;&#x437;&#x443; &#x43F;&#x44B;&#x442;&#x430;&#x442;&#x44C;&#x441;&#x44F; &#x43E;&#x441;&#x43E;&#x437;&#x43D;&#x43E;&#x432;&#x430;&#x442;&#x44C; - &#x43A;&#x430;&#x43A;&#x43E;&#x439; &#x43F;&#x435;&#x440;&#x435;&#x432;&#x43E;&#x440;&#x43E;&#x442; &#x43F;&#x440;&#x43E;&#x438;&#x437;&#x43E;&#x448;&#x435;&#x43B; &#x432; &#x438;&#x433;&#x440;&#x435;. &#x41D;&#x435;&#x442;, &#x440;&#x435;&#x431;&#x44F;&#x442;&#x430;, &#x432;&#x430;&#x43C; &#x44D;&#x442;&#x43E;&#x433;&#x43E; &#x43F;&#x440;&#x430;&#x432;&#x434;&#x430; &#x43D;&#x435; &#x43D;&#x430;&#x434;&#x43E;, &#x43F;&#x43E;&#x441;&#x43C;&#x43E;&#x442;&#x440;&#x438;&#x442;&#x435; &#x43B;&#x443;&#x447;&#x448;&#x435; &#x432; &#x441;&#x442;&#x43E;&#x440;&#x43E;&#x43D;&#x443; &#x434;&#x440;&#x443;&#x433;&#x438;&#x445;, &#x431;&#x43E;&#x43B;&#x435;&#x435; &#x43A;&#x430;&#x447;&#x435;&#x441;&#x442;&#x432;&#x435;&#x43D;&#x43D;&#x44B;&#x445;, &#x43F;&#x43B;&#x430;&#x442;&#x444;&#x43E;&#x440;&#x43C;&#x435;&#x440;&#x43E;&#x432; &#x438; &#x43D;&#x438; &#x432; &#x43A;&#x43E;&#x435;&#x43C; &#x441;&#x43B;&#x443;&#x447;&#x430;&#x435; &#x43D;&#x435; &#x434;&#x435;&#x43B;&#x430;&#x439;&#x442;&#x435; &#x442;&#x430;&#x43A;&#x43E;&#x439; &#x434;&#x43E;&#x440;&#x43E;&#x433;&#x43E;&#x439; &#x438; &#x433;&#x43B;&#x443;&#x43F;&#x43E;&#x439; &#x43E;&#x448;&#x438;&#x431;&#x43A;&#x438;, &#x43A;&#x43E;&#x442;&#x43E;&#x440;&#x443;&#x44E; &#x441;&#x434;&#x435;&#x43B;&#x430;&#x43B; &#x44F;... &#x41A;&#x430;&#x43A; &#x430;&#x43D;&#x430;&#x43B;&#x43E;&#x433; &#x44D;&#x442;&#x43E;&#x439; &#x438;&#x433;&#x440;&#x44B;, &#x442;&#x43E;&#x43B;&#x44C;&#x43A;&#x43E; &#x431;&#x43E;&#x43B;&#x435;&#x435; &#x434;&#x435;&#x448;&#x435;&#x432;&#x44B;&#x439;, &#x43C;&#x43E;&#x433;&#x443; &#x43F;&#x440;&#x438;&#x432;&#x435;&#x441;&#x442;&#x438; &#x432;&#x430;&#x43C; Nihilumbra, &#x433;&#x434;&#x435; &#x438;&#x441;&#x43F;&#x43E;&#x43B;&#x44C;&#x437;&#x443;&#x44E;&#x442;&#x441;&#x44F; &#x43F;&#x440;&#x438;&#x43C;&#x435;&#x440;&#x43D;&#x43E; &#x442;&#x430;&#x43A;&#x438;&#x435; &#x436;&#x435; &#x433;&#x43E;&#x43B;&#x43E;&#x432;&#x43E;&#x43B;&#x43E;&#x43C;&#x43A;&#x438; &#x438; &#x434;&#x435;&#x43D;&#x435;&#x433; &#x437;&#x430; &#x43D;&#x435;&#x433;&#x43E; &#x432;&#x44B; &#x43E;&#x442;&#x434;&#x430;&#x434;&#x438;&#x442;&#x435; &#x43C;&#x435;&#x43D;&#x44C;&#x448;&#x435; (&#x434;&#x430; &#x435;&#x449;&#x435; &#x438; &#x440;&#x443;&#x441;&#x441;&#x43A;&#x438;&#x435; &#x441;&#x443;&#x431;&#x442;&#x438;&#x442;&#x440;&#x44B; &#x435;&#x441;&#x442;&#x44C;). &#x412; &#x43E;&#x431;&#x449;&#x435;&#x43C;, &#x43F;&#x43E;&#x434;&#x443;&#x43C;&#x430;&#x439;&#x442;&#x435; &#x445;&#x43E;&#x440;&#x43E;&#x448;&#x435;&#x43D;&#x44C;&#x43A;&#x43E; &#x43F;&#x440;&#x435;&#x436;&#x434;&#x435; &#x447;&#x435;&#x43C; &#x435;&#x435; &#x431;&#x440;&#x430;&#x442;&#x44C; &#x438; &#x43D;&#x438; &#x432; &#x43A;&#x43E;&#x435;&#x43C; &#x441;&#x43B;&#x443;&#x447;&#x430;&#x435; &#x43D;&#x435; &#x441;&#x43C;&#x43E;&#x442;&#x440;&#x438;&#x442;&#x435; &#x43D;&#x430; &#x43F;&#x440;&#x43E;&#x446;&#x435;&#x43D;&#x442; &#x43F;&#x43E;&#x43B;&#x43E;&#x436;&#x438;&#x442;&#x435;&#x43B;&#x44C;&#x43D;&#x44B;&#x445; &#x43E;&#x442;&#x437;&#x44B;&#x432;&#x43E;&#x432;, &#x44D;&#x442;&#x43E; &#x43F;&#x440;&#x43E;&#x441;&#x442;&#x43E; &#x43A;&#x430;&#x43A;&#x43E;&#x439;-&#x442;&#x43E; &#x444;&#x44D;&#x439;&#x43B; &#x438; &#x44F; &#x43D;&#x435; &#x43F;&#x43E;&#x43D;&#x438;&#x43C;&#x430;&#x44E;, &#x43F;&#x43E;&#x447;&#x435;&#x43C;&#x443; &#x442;&#x430;&#x43A;&#x438;&#x435; &#x438;&#x433;&#x440;&#x44B; &#x434;&#x43E;&#x43B;&#x436;&#x43D;&#x44B; &#x432;&#x445;&#x43E;&#x434;&#x438;&#x442;&#x44C; &#x432; &#x442;&#x43E;&#x43F;... -_- &#x425;&#x43E;&#x442;&#x44F; &#x44D;&#x442;&#x43E;&#x433;&#x43E; &#x43A;&#x440;&#x430;&#x441;&#x438;&#x432;&#x43E;&#x433;&#x43E; &#x43B;&#x438;&#x441;&#x435;&#x43D;&#x43A;&#x430;, &#x43C;&#x43D;&#x435; &#x438;&#x441;&#x43A;&#x440;&#x435;&#x43D;&#x43D;&#x435; &#x436;&#x430;&#x43B;&#x44C;...
<br>
<br>&#x41D;&#x435;&#x441;&#x43C;&#x43E;&#x442;&#x440;&#x44F; &#x43D;&#x430; &#x434;&#x435;&#x439;&#x441;&#x442;&#x432;&#x438;&#x442;&#x435;&#x43B;&#x44C;&#x43D;&#x43E; &#x43A;&#x440;&#x430;&#x441;&#x438;&#x432;&#x443;&#x44E; &#x440;&#x438;&#x441;&#x43E;&#x432;&#x43A;&#x443;, &#x43A;&#x43E;&#x442;&#x43E;&#x440;&#x43E;&#x439; &#x44F; &#x432;&#x43E;&#x441;&#x445;&#x438;&#x449;&#x430;&#x43B;&#x441;&#x44F; &#x43D;&#x430; &#x43F;&#x440;&#x43E;&#x442;&#x44F;&#x436;&#x435;&#x43D;&#x438;&#x438; &#x43C;&#x43E;&#x435;&#x433;&#x43E; &#x43D;&#x435; &#x434;&#x43E;&#x43B;&#x433;&#x43E;&#x433;&#x43E; &#x433;&#x435;&#x439;&#x43C;&#x43F;&#x43B;&#x435;&#x44F; &#x438; &#x43A;&#x440;&#x430;&#x441;&#x438;&#x432;&#x443;&#x44E; &#x43C;&#x443;&#x437;&#x44B;&#x43A;&#x443;, &#x44F; &#x441;&#x442;&#x430;&#x432;&#x43B;&#x44E; &#x44D;&#x442;&#x43E;&#x43C;&#x443; &#x43F;&#x43B;&#x430;&#x442;&#x444;&#x43E;&#x440;&#x43C;&#x435;&#x440;&#x443; &#x432;&#x441;&#x435;&#x433;&#x43E;-&#x43B;&#x438;&#x448;&#x44C; 6/10. &#x412; &#x441;&#x432;&#x43E;&#x44E; &#x43E;&#x447;&#x435;&#x440;&#x435;&#x434;&#x44C;, &#x43E;&#x442;&#x43C;&#x435;&#x447;&#x443;, &#x447;&#x442;&#x43E; &#x438;&#x433;&#x440;&#x430; &#x43E;&#x447;&#x435;&#x43D;&#x44C; &#x43D;&#x435;&#x43E;&#x434;&#x43D;&#x43E;&#x437;&#x43D;&#x430;&#x447;&#x43D;&#x430; &#x438; &#x434;&#x430;&#x436;&#x435; &#x43D;&#x435;&#x441;&#x43C;&#x43E;&#x442;&#x440;&#x44F; &#x43D;&#x430; &#x43C;&#x43E;&#x435; &#x442;&#x430;&#x43A;&#x43E;&#x435; &#x43D;&#x435;&#x433;&#x43E;&#x434;&#x43E;&#x432;&#x430;&#x43D;&#x438;&#x435;, &#x432;&#x44B; &#x43C;&#x43E;&#x436;&#x435;&#x442;&#x435; &#x431;&#x44B;&#x442;&#x44C; &#x43E;&#x442; &#x43D;&#x435;&#x435; &#x432; &#x432;&#x43E;&#x441;&#x442;&#x43E;&#x440;&#x433;&#x435; &#x43D;&#x430; &#x43F;&#x440;&#x43E;&#x442;&#x44F;&#x436;&#x435;&#x43D;&#x438;&#x438; &#x432;&#x441;&#x435;&#x433;&#x43E; &#x43F;&#x440;&#x43E;&#x445;&#x43E;&#x436;&#x434;&#x435;&#x43D;&#x438;&#x44F;. &#x420;&#x435;&#x43A;&#x43E;&#x43C;&#x435;&#x43D;&#x434;&#x443;&#x44E; &#x43E;&#x447;&#x435;&#x43D;&#x44C; &#x445;&#x43E;&#x440;&#x43E;&#x448;&#x43E; &#x43F;&#x43E;&#x434;&#x443;&#x43C;&#x430;&#x442;&#x44C; &#x43F;&#x435;&#x440;&#x435;&#x434; &#x43F;&#x43E;&#x43A;&#x443;&#x43F;&#x43A;&#x43E;&#x439;...</span><span class="blurb_etc">&#x2026;</span> <a rel="nofollow" class="toggle_expand_collapse toggle_expand" href="/game/pc/seasons-after-fall/user-reviews?user_review_id=6752693">Expand</a></span>
            </div>
                            </div>
                                                        <div class="review_section review_actions ">
                                <ul class="review_actions">
                                                                            <li class="review_action review_helpful">
                                            <div class="review_helpful">
    <div class="rating_thumbs">
        			<div class="helpful_summary thumb_count">
				<a href="https://secure.metacritic.com/login">
				<span class="total_ups">2</span>
				of 
				<span class="total_thumbs">4</span>
				users found this helpful
                </a>
			</div>
                <div style="clear:both;"></div>
    </div>
</div>
                                        </li>
                                                                                                                                                <li class="review_action">
                                        <a href="/user/Tuskymon">All this user&apos;s reviews</a>
                                    </li>
                                                                    </ul>
                            </div>
                            
                                                    </div>
                    </div></div></div></div>
                </li>
                                                                                    <li id="user_review_7418376" class="review user_review">
                    <div class="review_btm review_btm_r"><div class="review_btm review_btm_l"><div class="review_top review_top_r"><div class="review_top review_top_l">
                        <div class="review_content">
                            <div class="review_section">
                                <div class="review_stats">
                                    <div class="review_critic">
                                        <div class="name">
                                                                                            <a href="/user/Krzych">Krzych</a>
                                                                                                                                </div>

                                                                                    <div class="date">Jul 23, 2017</div>
                                                                            </div>
                                    
                                    <div class="review_grade">
                                                
<div class="metascore_w user medium game mixed indiv">7</div>

                                    </div>
                                </div>
                                <div class="review_body">
                                                        
                                        <span class="inline_expand_collapse inline_collapsed" id="review_blurb_7418376"><span class="blurb blurb_collapsed">Beautiful and &quot;light&quot; game to play when you don&apos;t look for anything too serious. Visually the game is looking beautiful, soundtrack is very nice, voice acting is good, the concept of changing seasons to change environment works very well, puzzles are okay, but the game is lacking in some aspects. A bit lackluster story and lack of any dangers, the worst that can happen to you is getting</span><span class="blurb blurb_expanded">Beautiful and &quot;light&quot; game to play when you don&apos;t look for anything too serious. Visually the game is looking beautiful, soundtrack is very nice, voice acting is good, the concept of changing seasons to change environment works very well, puzzles are okay, but the game is lacking in some aspects. A bit lackluster story and lack of any dangers, the worst that can happen to you is getting stuck with puzzles, this is the only challenge in game. I can understand for example lack of combat, it wouldn&apos;t fit to this game, but complete lack of difficulty doesn&apos;t have positive affect on the game, it is just not engaging this way, especially when story is also not something that could sink you into the game. I think you could say that Seasons After Fall is half of the game. Good and pretty half but overall certainly not a level of top of the line titles of this genre, like Ori and The Blind Forest.</span><span class="blurb_etc">&#x2026;</span> <a rel="nofollow" class="toggle_expand_collapse toggle_expand" href="/game/pc/seasons-after-fall/user-reviews?user_review_id=7418376">Expand</a></span>
            </div>
                            </div>
                                                        <div class="review_section review_actions ">
                                <ul class="review_actions">
                                                                            <li class="review_action review_helpful">
                                            <div class="review_helpful">
    <div class="rating_thumbs">
        			<div class="helpful_summary thumb_count">
				<a href="https://secure.metacritic.com/login">
				<span class="total_ups">0</span>
				of 
				<span class="total_thumbs">0</span>
				users found this helpful
                </a>
			</div>
                <div style="clear:both;"></div>
    </div>
</div>
                                        </li>
                                                                                                                                                <li class="review_action">
                                        <a href="/user/Krzych">All this user&apos;s reviews</a>
                                    </li>
                                                                    </ul>
                            </div>
                            
                                                    </div>
                    </div></div></div></div>
                </li>
                                                                                    <li id="user_review_7367372" class="review user_review last_review">
                    <div class="review_btm review_btm_r"><div class="review_btm review_btm_l"><div class="review_top review_top_r"><div class="review_top review_top_l">
                        <div class="review_content">
                            <div class="review_section">
                                <div class="review_stats">
                                    <div class="review_critic">
                                        <div class="name">
                                                                                            <a href="/user/vxRadiationxv">vxRadiationxv</a>
                                                                                                                                </div>

                                                                                    <div class="date">Jun 18, 2017</div>
                                                                            </div>
                                    
                                    <div class="review_grade">
                                                
<div class="metascore_w user medium game positive indiv perfect">10</div>

                                    </div>
                                </div>
                                <div class="review_body">
                                                        
                                        <span class="inline_expand_collapse inline_collapsed" id="review_blurb_7367372"><span class="blurb blurb_collapsed">Seasons After Fall,
<br>The visual aspect of the game is awe inspiring and the music is breathtaking. I enjoy the music with great alacrity, so I have started working on a guitar cover for one of the songs. Throughout the game, you feel captured in a world of fantasy and beauty. I feel the need to just take a moment to look around and see everything and take it in. And the fact that they made</span><span class="blurb blurb_expanded">Seasons After Fall,
<br>The visual aspect of the game is awe inspiring and the music is breathtaking. I enjoy the music with great alacrity, so I have started working on a guitar cover for one of the songs. Throughout the game, you feel captured in a world of fantasy and beauty. I feel the need to just take a moment to look around and see everything and take it in. And the fact that they made the game available in many different languages makes a difference. The soundtrack for the game is now even available on 2 vinyl records. I would thoroughly enjoy another installment of Seasons After Fall, but the lack of advertisement has brought the game down since its release. The story of the game is easy to follow and the game lets you roam around and explore the world and its beautiful aesthetics. In conclusion, it is a work of art, and the time it took to make was truly worth the awe-inspiring moments I experienced.</span><span class="blurb_etc">&#x2026;</span> <a rel="nofollow" class="toggle_expand_collapse toggle_expand" href="/game/pc/seasons-after-fall/user-reviews?user_review_id=7367372">Expand</a></span>
            </div>
                            </div>
                                                        <div class="review_section review_actions ">
                                <ul class="review_actions">
                                                                            <li class="review_action review_helpful">
                                            <div class="review_helpful">
    <div class="rating_thumbs">
        			<div class="helpful_summary thumb_count">
				<a href="https://secure.metacritic.com/login">
				<span class="total_ups">0</span>
				of 
				<span class="total_thumbs">0</span>
				users found this helpful
                </a>
			</div>
                <div style="clear:both;"></div>
    </div>
</div>
                                        </li>
                                                                                                                                                <li class="review_action">
                                        <a href="/user/vxRadiationxv">All this user&apos;s reviews</a>
                                    </li>
                                                                    </ul>
                            </div>
                            
                                                    </div>
                    </div></div></div></div>
                </li>
                                            