
                                                            <li id="user_review_7087171" class="review user_review first_review">
                    <div class="review_btm review_btm_r"><div class="review_btm review_btm_l"><div class="review_top review_top_r"><div class="review_top review_top_l">
                        <div class="review_content">
                            <div class="review_section">
                                <div class="review_stats">
                                    <div class="review_critic">
                                        <div class="name">
                                                                                            <a href="/user/VoxMare">VoxMare</a>
                                                                                                                                </div>

                                                                                    <div class="date">Mar 15, 2017</div>
                                                                            </div>
                                    
                                    <div class="review_grade">
                                                
<div class="metascore_w user medium game positive indiv">8</div>

                                    </div>
                                </div>
                                <div class="review_body">
                                                        
                                        <span class="inline_expand_collapse inline_collapsed" id="review_blurb_7087171"><span class="blurb blurb_collapsed">&#x41E;&#x442;&#x43B;&#x438;&#x447;&#x43D;&#x44B;&#x439; &#x43A;&#x432;&#x435;&#x441;&#x442;! &#x420;&#x430;&#x441;&#x441;&#x43A;&#x430;&#x437;&#x44B;&#x432;&#x430;&#x442;&#x44C; &#x43E; &#x43A;&#x432;&#x435;&#x441;&#x442;&#x430;&#x445; &#x434;&#x435;&#x43B;&#x43E; &#x43D;&#x435;&#x431;&#x43B;&#x430;&#x433;&#x43E;&#x434;&#x430;&#x442;&#x43D;&#x43E;&#x435;, &#x442;&#x44B; &#x43B;&#x438;&#x431;&#x43E; &#x440;&#x430;&#x437;&#x436;&#x435;&#x432;&#x44B;&#x432;&#x430;&#x435;&#x448;&#x44C; &#x43E;&#x447;&#x435;&#x432;&#x438;&#x434;&#x43D;&#x43E;&#x435;, &#x43B;&#x438;&#x431;&#x43E; &#x441;&#x43F;&#x43E;&#x439;&#x43B;&#x435;&#x440;&#x438;&#x448;&#x44C;, &#x43F;&#x43E;&#x441;&#x435;&#x43C;&#x443;...
<br>
<br>&#x418;&#x442;&#x430;&#x43A;, &#x438;&#x433;&#x440;&#x430; &#x43F;&#x440;&#x435;&#x434;&#x43B;&#x430;&#x433;&#x430;&#x435;&#x442; &#x43D;&#x430;&#x43C; &#x43D;&#x435;&#x43F;&#x43B;&#x43E;&#x445;&#x43E;&#x439; &#x441;&#x44E;&#x436;&#x435;&#x442;, &#x43A;&#x43E;&#x442;&#x43E;&#x440;&#x44B;&#x439;, &#x432;&#x43F;&#x440;&#x43E;&#x447;&#x435;&#x43C;, &#x434;&#x43E;&#x432;&#x43E;&#x43B;&#x44C;&#x43D;&#x43E; &#x43F;&#x440;&#x435;&#x434;&#x441;&#x43A;&#x430;&#x437;&#x443;&#x435;&#x43C; &#x438; &#x431;&#x430;&#x43D;&#x430;&#x43B;&#x435;&#x43D;. &#x41D;&#x43E; &#x441;&#x43B;&#x435;&#x434;&#x438;&#x442;&#x44C; &#x437;&#x430; &#x43D;&#x438;&#x43C; &#x438;&#x43D;&#x442;&#x435;&#x440;&#x435;&#x441;&#x43D;&#x43E;, &#x43D;&#x430;&#x434;&#x435;&#x44E;&#x441;&#x44C; &#x432; &#x441;&#x438;&#x43A;&#x432;&#x435;&#x43B;&#x435; &#x434;&#x43E;&#x431;&#x430;&#x432;&#x44F;&#x442; &#x43F;&#x435;&#x440;&#x447;&#x438;&#x43D;&#x43A;&#x438; &#x432; &#x441;&#x44E;&#x436;&#x435;&#x442;. &#x41A;&#x443;&#x434;&#x430; &#x43B;&#x443;&#x447;&#x448;&#x435; &#x441;&#x44E;&#x436;&#x435;&#x442;&#x430; &#x443;&#x434;&#x430;&#x43B;&#x43E;&#x441;&#x44C; &#x43F;&#x43E;&#x432;&#x435;&#x441;&#x442;&#x432;&#x43E;&#x432;&#x430;&#x43D;&#x438;&#x435; -- &#x43E;&#x447;&#x435;&#x43D;&#x44C; &#x438; &#x43E;&#x447;&#x435;&#x43D;&#x44C; &#x43A;&#x43B;&#x430;&#x441;&#x441;&#x43D;&#x43E; &#x432;&#x441;&#x435; &#x441;&#x442;&#x438;&#x43B;&#x438;&#x437;&#x43E;&#x432;&#x430;&#x43D;&#x43D;&#x43E; &#x43F;&#x43E;&#x434; &#x43A;&#x43E;&#x43C;&#x438;&#x43A;&#x441; &#x438; &#x420;&#x430;&#x441;&#x441;&#x43A;&#x430;&#x437;&#x447;&#x438;&#x43A;</span><span class="blurb blurb_expanded">&#x41E;&#x442;&#x43B;&#x438;&#x447;&#x43D;&#x44B;&#x439; &#x43A;&#x432;&#x435;&#x441;&#x442;! &#x420;&#x430;&#x441;&#x441;&#x43A;&#x430;&#x437;&#x44B;&#x432;&#x430;&#x442;&#x44C; &#x43E; &#x43A;&#x432;&#x435;&#x441;&#x442;&#x430;&#x445; &#x434;&#x435;&#x43B;&#x43E; &#x43D;&#x435;&#x431;&#x43B;&#x430;&#x433;&#x43E;&#x434;&#x430;&#x442;&#x43D;&#x43E;&#x435;, &#x442;&#x44B; &#x43B;&#x438;&#x431;&#x43E; &#x440;&#x430;&#x437;&#x436;&#x435;&#x432;&#x44B;&#x432;&#x430;&#x435;&#x448;&#x44C; &#x43E;&#x447;&#x435;&#x432;&#x438;&#x434;&#x43D;&#x43E;&#x435;, &#x43B;&#x438;&#x431;&#x43E; &#x441;&#x43F;&#x43E;&#x439;&#x43B;&#x435;&#x440;&#x438;&#x448;&#x44C;, &#x43F;&#x43E;&#x441;&#x435;&#x43C;&#x443;...
<br>
<br>&#x418;&#x442;&#x430;&#x43A;, &#x438;&#x433;&#x440;&#x430; &#x43F;&#x440;&#x435;&#x434;&#x43B;&#x430;&#x433;&#x430;&#x435;&#x442; &#x43D;&#x430;&#x43C; &#x43D;&#x435;&#x43F;&#x43B;&#x43E;&#x445;&#x43E;&#x439; &#x441;&#x44E;&#x436;&#x435;&#x442;, &#x43A;&#x43E;&#x442;&#x43E;&#x440;&#x44B;&#x439;, &#x432;&#x43F;&#x440;&#x43E;&#x447;&#x435;&#x43C;, &#x434;&#x43E;&#x432;&#x43E;&#x43B;&#x44C;&#x43D;&#x43E; &#x43F;&#x440;&#x435;&#x434;&#x441;&#x43A;&#x430;&#x437;&#x443;&#x435;&#x43C; &#x438; &#x431;&#x430;&#x43D;&#x430;&#x43B;&#x435;&#x43D;. &#x41D;&#x43E; &#x441;&#x43B;&#x435;&#x434;&#x438;&#x442;&#x44C; &#x437;&#x430; &#x43D;&#x438;&#x43C; &#x438;&#x43D;&#x442;&#x435;&#x440;&#x435;&#x441;&#x43D;&#x43E;, &#x43D;&#x430;&#x434;&#x435;&#x44E;&#x441;&#x44C; &#x432; &#x441;&#x438;&#x43A;&#x432;&#x435;&#x43B;&#x435; &#x434;&#x43E;&#x431;&#x430;&#x432;&#x44F;&#x442; &#x43F;&#x435;&#x440;&#x447;&#x438;&#x43D;&#x43A;&#x438; &#x432; &#x441;&#x44E;&#x436;&#x435;&#x442;. &#x41A;&#x443;&#x434;&#x430; &#x43B;&#x443;&#x447;&#x448;&#x435; &#x441;&#x44E;&#x436;&#x435;&#x442;&#x430; &#x443;&#x434;&#x430;&#x43B;&#x43E;&#x441;&#x44C; &#x43F;&#x43E;&#x432;&#x435;&#x441;&#x442;&#x432;&#x43E;&#x432;&#x430;&#x43D;&#x438;&#x435; -- &#x43E;&#x447;&#x435;&#x43D;&#x44C; &#x438; &#x43E;&#x447;&#x435;&#x43D;&#x44C; &#x43A;&#x43B;&#x430;&#x441;&#x441;&#x43D;&#x43E; &#x432;&#x441;&#x435; &#x441;&#x442;&#x438;&#x43B;&#x438;&#x437;&#x43E;&#x432;&#x430;&#x43D;&#x43D;&#x43E; &#x43F;&#x43E;&#x434; &#x43A;&#x43E;&#x43C;&#x438;&#x43A;&#x441; &#x438; &#x420;&#x430;&#x441;&#x441;&#x43A;&#x430;&#x437;&#x447;&#x438;&#x43A; &#x434;&#x43E;&#x432;&#x43E;&#x43B;&#x44C;&#x43D;&#x43E; &#x437;&#x430;&#x431;&#x430;&#x432;&#x43D;&#x430;&#x44F; &#x43B;&#x438;&#x447;&#x43D;&#x43E;&#x441;&#x442;&#x44C;, &#x43A;&#x43E;&#x442;&#x43E;&#x440;&#x430;&#x44F; &#x43D;&#x435; &#x443;&#x43F;&#x443;&#x441;&#x442;&#x438;&#x442; &#x432;&#x43E;&#x437;&#x43C;&#x43E;&#x436;&#x43D;&#x43E;&#x441;&#x442;&#x438; &#x43D;&#x430;&#x434; &#x43D;&#x430;&#x43C;&#x438; &#x43F;&#x43E;&#x434;&#x448;&#x443;&#x442;&#x438;&#x442;&#x44C;. &#x41D;&#x435; &#x43E;&#x442;&#x441;&#x442;&#x430;&#x435;&#x442; &#x438; &#x433;&#x440;&#x430;&#x444;&#x438;&#x447;&#x435;&#x441;&#x43A;&#x438;&#x439; &#x441;&#x442;&#x438;&#x43B;&#x44C; -- &#x432;&#x441;&#x435; &#x43E;&#x447;&#x435;&#x43D;&#x44C; &#x441;&#x43E;&#x447;&#x43D;&#x43E; &#x438; &#x43A;&#x440;&#x430;&#x441;&#x438;&#x432;&#x43E;, &#x432;&#x43E;&#x442; &#x442;&#x43E;&#x43B;&#x44C;&#x43A;&#x43E; &#x430;&#x43D;&#x438;&#x43C;&#x430;&#x446;&#x438;&#x438; &#x436;&#x443;&#x442;&#x43A;&#x43E; &#x441;&#x442;&#x440;&#x430;&#x448;&#x43D;&#x44B;&#x435; :) &#x417;&#x430;&#x433;&#x430;&#x434;&#x43A;&#x438; &#x442;&#x443;&#x442; &#x442;&#x438;&#x43F;&#x438;&#x447;&#x43D;&#x44B;&#x435; &#x434;&#x43B;&#x44F; &#x43A;&#x432;&#x435;&#x441;&#x442;&#x43E;&#x432; -- &#x441;&#x43E;&#x432;&#x43C;&#x435;&#x441;&#x442;&#x438; &#x442;&#x43E;, &#x441;&#x43E;&#x432;&#x43C;&#x435;&#x441;&#x442;&#x438; &#x441;&#x435;, &#x432;&#x43F;&#x43E;&#x43B;&#x43D;&#x435; &#x43B;&#x43E;&#x433;&#x438;&#x447;&#x43D;&#x44B; &#x438; &#x43F;&#x440;&#x435;&#x434;&#x435;&#x43B;&#x44C;&#x43D;&#x43E; &#x43F;&#x440;&#x43E;&#x441;&#x442;&#x44B;, &#x445;&#x43E;&#x442;&#x44F; &#x432; &#x441;&#x430;&#x43C;&#x43E;&#x43C; &#x43D;&#x430;&#x447;&#x430;&#x43B;&#x435; &#x438;&#x433;&#x440;&#x430; &#x432;&#x44B;&#x43A;&#x438;&#x43D;&#x435;&#x442; &#x444;&#x43E;&#x440;&#x442;&#x435;&#x43B;&#x44C; &#x438; &#x434;&#x430;&#x441;&#x442; &#x432;&#x430;&#x43C; &#x442;&#x440;&#x438; &#x448;&#x430;&#x445;&#x43C;&#x430;&#x442;&#x43D;&#x44B;&#x445; &#x437;&#x430;&#x434;&#x430;&#x447;&#x43A;&#x438;. &#x41D;&#x435;&#x43F;&#x43B;&#x43E;&#x445;&#x43E;, &#x43D;&#x435;&#x43F;&#x43B;&#x43E;&#x445;&#x43E;.
<br>
<br>&#x41D;&#x443; &#x430; &#x442;&#x435;&#x43F;&#x435;&#x440;&#x44C; &#x43E;&#x431; &#x43C;&#x438;&#x43D;&#x443;&#x441;&#x430;&#x445;, &#x442;&#x43E;&#x447;&#x43D;&#x435;&#x439; &#x43E;&#x431; &#x43C;&#x438;&#x43D;&#x443;&#x441;&#x435; -- &#x434;&#x43B;&#x44F; &#x43C;&#x435;&#x43D;&#x44F; &#x43E;&#x43D; &#x43E;&#x434;&#x438;&#x43D;.
<br>&#x41D;&#x435;&#x43B;&#x44C;&#x437;&#x44F; &#x432;&#x44B;&#x431;&#x440;&#x430;&#x442;&#x44C; &#x441;&#x43E;&#x447;&#x435;&#x442;&#x430;&#x43D;&#x438;&#x435; &#x43E;&#x437;&#x432;&#x443;&#x447;&#x43A;&#x438;&#x438;&#x43D;&#x442;&#x435;&#x440;&#x444;&#x435;&#x439;&#x441;&#x430;. &#x410; &#x440;&#x443;&#x441;&#x441;&#x43A;&#x430;&#x44F; &#x43E;&#x437;&#x432;&#x443;&#x447;&#x43A;&#x430;.. &#x41E;&#x43D;&#x430; &#x43D;&#x435;&#x43F;&#x43B;&#x43E;&#x445;&#x430; &#x433;&#x43E;&#x43B;&#x43E;&#x441;&#x430;&#x43C;&#x438;, &#x43D;&#x43E; &#x438;&#x43D;&#x442;&#x43E;&#x43D;&#x430;&#x446;&#x438;&#x438;.. &#x418;&#x445; &#x43D;&#x435;&#x442;. &#x422;&#x430;&#x43A;&#x43E;&#x435; &#x43E;&#x449;&#x443;&#x449;&#x435;&#x43D;&#x438;&#x435;, &#x447;&#x442;&#x43E; &#x430;&#x43A;&#x442;&#x435;&#x440;&#x430;&#x43C; &#x431;&#x44B;&#x43B;&#x43E; &#x43E;&#x442;&#x43A;&#x440;&#x43E;&#x432;&#x435;&#x43D;&#x43D;&#x43E; &#x43D;&#x430;&#x2665;&#x2665;&#x2665;&#x2665;&#x2665;&#x2665;&#x2665;&#x2665;&#x2665;&#x2665; &#x43D;&#x430; &#x442;&#x43E;, &#x447;&#x442;&#x43E; &#x43E;&#x43D;&#x438; &#x437;&#x430;&#x43F;&#x438;&#x441;&#x44B;&#x432;&#x430;&#x44E;&#x442;.
<br>
<br>&#x420;&#x435;&#x437;&#x44E;&#x43C;&#x438;&#x440;&#x443;&#x44F; -- &#x43D;&#x435;&#x43F;&#x43B;&#x43E;&#x445;&#x43E;&#x439;, &#x43E;&#x447;&#x435;&#x43D;&#x44C; &#x434;&#x430;&#x436;&#x435; &#x43D;&#x435;&#x43F;&#x43B;&#x43E;&#x445;&#x43E;&#x439; &#x43A;&#x432;&#x435;&#x441;&#x442;, &#x441; &#x43F;&#x440;&#x43E;&#x441;&#x442;&#x435;&#x43D;&#x44C;&#x43A;&#x438;&#x43C;&#x438; &#x437;&#x430;&#x434;&#x430;&#x447;&#x43A;&#x430;&#x43C;&#x438;, &#x434;&#x430;, &#x43D;&#x43E; &#x43C;&#x435;&#x43D;&#x435;&#x435; &#x443;&#x432;&#x43B;&#x435;&#x43A;&#x430;&#x442;&#x435;&#x43B;&#x44C;&#x43D;&#x44B;&#x43C; &#x43E;&#x43D; &#x43D;&#x435; &#x441;&#x442;&#x430;&#x43D;&#x43E;&#x432;&#x438;&#x442;&#x441;&#x44F;. &#x420;&#x435;&#x43A;&#x43E;&#x43C;&#x435;&#x43D;&#x434;&#x443;&#x44E;! &#x422;&#x43E;&#x43B;&#x44C;&#x43A;&#x43E; &#x43C;&#x435;&#x43D;&#x44F;&#x439;&#x442;&#x435; &#x43E;&#x437;&#x432;&#x443;&#x447;&#x43A;&#x443;, &#x440;&#x443;&#x441;&#x441;&#x43A;&#x430;&#x44F; &#x43F;&#x43B;&#x43E;&#x445;&#x430;, &#x435;&#x439; &#x431;&#x43E;&#x433;&#x443;.</span><span class="blurb_etc">&#x2026;</span> <a rel="nofollow" class="toggle_expand_collapse toggle_expand" href="/game/pc/yesterday/user-reviews?user_review_id=7087171">Expand</a></span>
            </div>
                            </div>
                                                        <div class="review_section review_actions ">
                                <ul class="review_actions">
                                                                            <li class="review_action review_helpful">
                                            <div class="review_helpful">
    <div class="rating_thumbs">
        			<div class="helpful_summary thumb_count">
				<a href="https://secure.metacritic.com/login">
				<span class="total_ups">1</span>
				of 
				<span class="total_thumbs">1</span>
				users found this helpful
                </a>
			</div>
                <div style="clear:both;"></div>
    </div>
</div>
                                        </li>
                                                                                                                                                <li class="review_action">
                                        <a href="/user/VoxMare">All this user&apos;s reviews</a>
                                    </li>
                                                                    </ul>
                            </div>
                            
                                                    </div>
                    </div></div></div></div>
                </li>
                                                                                    <li id="user_review_2276999" class="review user_review">
                    <div class="review_btm review_btm_r"><div class="review_btm review_btm_l"><div class="review_top review_top_r"><div class="review_top review_top_l">
                        <div class="review_content">
                            <div class="review_section">
                                <div class="review_stats">
                                    <div class="review_critic">
                                        <div class="name">
                                                                                            <a href="/user/DThomson">DThomson</a>
                                                                                                                                </div>

                                                                                    <div class="date">Mar 28, 2012</div>
                                                                            </div>
                                    
                                    <div class="review_grade">
                                                
<div class="metascore_w user medium game positive indiv">8</div>

                                    </div>
                                </div>
                                <div class="review_body">
                                                        
                                        <span class="inline_expand_collapse inline_collapsed" id="review_blurb_2276999"><span class="blurb blurb_collapsed">Short but stunningly sweet. I thoroughly enjoyed Yesterday from start to finish (although that might not be saying as much as you think!), it has everything a brilliant point-and-click adventure needs: an engaging plot, attractive styling, credible characters and humour in all the right places. Unfortunately the game was *so* short, taking me around 4 hours to complete, that Pendulo</span><span class="blurb blurb_expanded">Short but stunningly sweet. I thoroughly enjoyed Yesterday from start to finish (although that might not be saying as much as you think!), it has everything a brilliant point-and-click adventure needs: an engaging plot, attractive styling, credible characters and humour in all the right places. Unfortunately the game was *so* short, taking me around 4 hours to complete, that Pendulo Studios neglected the opportunity to capitalise on these positive qualities. Unfortunately, as I feared, the current price of &#xC2;&#xA3;20 is completely unrealistic for what&apos;s on offer. Yesterday is a great example of what the point-and-click genre has to offer, but dies down all too quickly and just leaves you wanting more. A fantastic game, and definitely worth playing... But unfortunately at &#xC2;&#xA3;5 per hour of gameplay the price is just too high.</span><span class="blurb_etc">&#x2026;</span> <a rel="nofollow" class="toggle_expand_collapse toggle_expand" href="/game/pc/yesterday/user-reviews?user_review_id=2276999">Expand</a></span>
            </div>
                            </div>
                                                        <div class="review_section review_actions ">
                                <ul class="review_actions">
                                                                            <li class="review_action review_helpful">
                                            <div class="review_helpful">
    <div class="rating_thumbs">
        			<div class="helpful_summary thumb_count">
				<a href="https://secure.metacritic.com/login">
				<span class="total_ups">5</span>
				of 
				<span class="total_thumbs">6</span>
				users found this helpful
                </a>
			</div>
                <div style="clear:both;"></div>
    </div>
</div>
                                        </li>
                                                                                                                                                <li class="review_action">
                                        <a href="/user/DThomson">All this user&apos;s reviews</a>
                                    </li>
                                                                    </ul>
                            </div>
                            
                                                    </div>
                    </div></div></div></div>
                </li>
                                                                                    <li id="user_review_2278730" class="review user_review">
                    <div class="review_btm review_btm_r"><div class="review_btm review_btm_l"><div class="review_top review_top_r"><div class="review_top review_top_l">
                        <div class="review_content">
                            <div class="review_section">
                                <div class="review_stats">
                                    <div class="review_critic">
                                        <div class="name">
                                                                                            <a href="/user/six30two">six30two</a>
                                                                                                                                </div>

                                                                                    <div class="date">Mar 30, 2012</div>
                                                                            </div>
                                    
                                    <div class="review_grade">
                                                
<div class="metascore_w user medium game negative indiv">0</div>

                                    </div>
                                </div>
                                <div class="review_body">
                                                        
                                        <span class="inline_expand_collapse inline_collapsed" id="review_blurb_2278730"><span class="blurb blurb_collapsed">Point n&apos; Click adventure games have been my thing since I started using computers. My very first was Monkey Island, back when DOS was an operating system and Windows 3.1 was the next big thing. I&apos;ve played classics like The Dig, all of the Monkey Island series, Sam n&apos; Max classics, some of the Leisure Suit Larry classics, Indiana Jones and the Fate of Atlantis. Modern ones like Gemini Rue</span><span class="blurb blurb_expanded">Point n&apos; Click adventure games have been my thing since I started using computers. My very first was Monkey Island, back when DOS was an operating system and Windows 3.1 was the next big thing. I&apos;ve played classics like The Dig, all of the Monkey Island series, Sam n&apos; Max classics, some of the Leisure Suit Larry classics, Indiana Jones and the Fate of Atlantis. Modern ones like Gemini Rue and Yahtzee&apos;s Trilby/5 Days a Stranger series. To put it simply, I know Point n&apos; Clicks. To put it simply, Yesterday was a waste of time. I was wary of Pendulo for some reason, and now I know why. The game is entirely too short, the plot and the way it progresses is ridiculously fast and feels contrived. I literally felt like I missed the first half of the game and felt no emotional connection to any of the characters. There was a little bit of reasonable humor, but it was brief and overshadowed by both the dark story and the overfast pacing of the game. INCREDIBLY overpriced, not even getting started on that. Pass this up and go play a classic, like Day of the Tentacle - now there&apos;s a real gem of point n&apos; clicks.</span><span class="blurb_etc">&#x2026;</span> <a rel="nofollow" class="toggle_expand_collapse toggle_expand" href="/game/pc/yesterday/user-reviews?user_review_id=2278730">Expand</a></span>
            </div>
                            </div>
                                                        <div class="review_section review_actions ">
                                <ul class="review_actions">
                                                                            <li class="review_action review_helpful">
                                            <div class="review_helpful">
    <div class="rating_thumbs">
        			<div class="helpful_summary thumb_count">
				<a href="https://secure.metacritic.com/login">
				<span class="total_ups">8</span>
				of 
				<span class="total_thumbs">10</span>
				users found this helpful
                </a>
			</div>
                <div style="clear:both;"></div>
    </div>
</div>
                                        </li>
                                                                                                                                                <li class="review_action">
                                        <a href="/user/six30two">All this user&apos;s reviews</a>
                                    </li>
                                                                    </ul>
                            </div>
                            
                                                    </div>
                    </div></div></div></div>
                </li>
                                                                                    <li id="user_review_2843839" class="review user_review">
                    <div class="review_btm review_btm_r"><div class="review_btm review_btm_l"><div class="review_top review_top_r"><div class="review_top review_top_l">
                        <div class="review_content">
                            <div class="review_section">
                                <div class="review_stats">
                                    <div class="review_critic">
                                        <div class="name">
                                                                                            <a href="/user/kagetto">kagetto</a>
                                                                                                                                </div>

                                                                                    <div class="date">Dec 19, 2012</div>
                                                                            </div>
                                    
                                    <div class="review_grade">
                                                
<div class="metascore_w user medium game negative indiv">2</div>

                                    </div>
                                </div>
                                <div class="review_body">
                                                        
                                        <span class="inline_expand_collapse inline_collapsed" id="review_blurb_2843839"><span class="blurb blurb_collapsed">It is unreal how short this game is. I have played previous Pendulo games and generally enjoyed them, not sure what they were going for here.
<br>
<br>The story itself is mildly interesting but lack any real direction. There is too much bouncing around or at least bouncing around in a way you don&apos;t get until the end. There is also too much hand holding. This is one of the first adventure games</span><span class="blurb blurb_expanded">It is unreal how short this game is. I have played previous Pendulo games and generally enjoyed them, not sure what they were going for here.
<br>
<br>The story itself is mildly interesting but lack any real direction. There is too much bouncing around or at least bouncing around in a way you don&apos;t get until the end. There is also too much hand holding. This is one of the first adventure games that basically gives away the clues to every puzzle. Extremely disappointed. High points were graphics and voice acting. Lowe points, playing the &quot;game&quot;.</span><span class="blurb_etc">&#x2026;</span> <a rel="nofollow" class="toggle_expand_collapse toggle_expand" href="/game/pc/yesterday/user-reviews?user_review_id=2843839">Expand</a></span>
            </div>
                            </div>
                                                        <div class="review_section review_actions ">
                                <ul class="review_actions">
                                                                            <li class="review_action review_helpful">
                                            <div class="review_helpful">
    <div class="rating_thumbs">
        			<div class="helpful_summary thumb_count">
				<a href="https://secure.metacritic.com/login">
				<span class="total_ups">3</span>
				of 
				<span class="total_thumbs">4</span>
				users found this helpful
                </a>
			</div>
                <div style="clear:both;"></div>
    </div>
</div>
                                        </li>
                                                                                                                                                <li class="review_action">
                                        <a href="/user/kagetto">All this user&apos;s reviews</a>
                                    </li>
                                                                    </ul>
                            </div>
                            
                                                    </div>
                    </div></div></div></div>
                </li>
                                                                                    <li id="user_review_2268428" class="review user_review">
                    <div class="review_btm review_btm_r"><div class="review_btm review_btm_l"><div class="review_top review_top_r"><div class="review_top review_top_l">
                        <div class="review_content">
                            <div class="review_section">
                                <div class="review_stats">
                                    <div class="review_critic">
                                        <div class="name">
                                                                                            <a href="/user/spikie1011">spikie1011</a>
                                                                                                                                </div>

                                                                                    <div class="date">Mar 24, 2012</div>
                                                                            </div>
                                    
                                    <div class="review_grade">
                                                
<div class="metascore_w user medium game negative indiv">3</div>

                                    </div>
                                </div>
                                <div class="review_body">
                                                        
                                        <span>Pendulo should take one more year to develop this game, maybe the story is good, but the game is too damn short. The music and the dubbing are for the most part nonexistent.  There are so many bug on the subtitles ( for a point &amp; click it&apos;s just a joke ). If u ( like me ) love all the pendulo&apos;s game, avoid this one !</span>
            </div>
                            </div>
                                                        <div class="review_section review_actions ">
                                <ul class="review_actions">
                                                                            <li class="review_action review_helpful">
                                            <div class="review_helpful">
    <div class="rating_thumbs">
        			<div class="helpful_summary thumb_count">
				<a href="https://secure.metacritic.com/login">
				<span class="total_ups">3</span>
				of 
				<span class="total_thumbs">5</span>
				users found this helpful
                </a>
			</div>
                <div style="clear:both;"></div>
    </div>
</div>
                                        </li>
                                                                                                                                                <li class="review_action">
                                        <a href="/user/spikie1011">All this user&apos;s reviews</a>
                                    </li>
                                                                    </ul>
                            </div>
                            
                                                    </div>
                    </div></div></div></div>
                </li>
                                                                                    <li id="user_review_3135276" class="review user_review">
                    <div class="review_btm review_btm_r"><div class="review_btm review_btm_l"><div class="review_top review_top_r"><div class="review_top review_top_l">
                        <div class="review_content">
                            <div class="review_section">
                                <div class="review_stats">
                                    <div class="review_critic">
                                        <div class="name">
                                                                                            <a href="/user/ChoicestGames">ChoicestGames</a>
                                                                                                                                </div>

                                                                                    <div class="date">Apr 28, 2013</div>
                                                                            </div>
                                    
                                    <div class="review_grade">
                                                
<div class="metascore_w user medium game mixed indiv">7</div>

                                    </div>
                                </div>
                                <div class="review_body">
                                                        
                                        <span>A short point &#x2018;n&#x2019; click adventure with lots of twists to keep you entertained. Unfortunately, the inability to connect with any of the characters and the lack of any truly memorable scenes means the short playthrough will be easily forgotten; just like the eponymous protagonist&#x2019;s memories.</span>
            </div>
                            </div>
                                                        <div class="review_section review_actions ">
                                <ul class="review_actions">
                                                                            <li class="review_action review_helpful">
                                            <div class="review_helpful">
    <div class="rating_thumbs">
        			<div class="helpful_summary thumb_count">
				<a href="https://secure.metacritic.com/login">
				<span class="total_ups">1</span>
				of 
				<span class="total_thumbs">2</span>
				users found this helpful
                </a>
			</div>
                <div style="clear:both;"></div>
    </div>
</div>
                                        </li>
                                                                                                                                                <li class="review_action">
                                        <a href="/user/ChoicestGames">All this user&apos;s reviews</a>
                                    </li>
                                                                    </ul>
                            </div>
                            
                                                    </div>
                    </div></div></div></div>
                </li>
                                                                                    <li id="user_review_2269822" class="review user_review">
                    <div class="review_btm review_btm_r"><div class="review_btm review_btm_l"><div class="review_top review_top_r"><div class="review_top review_top_l">
                        <div class="review_content">
                            <div class="review_section">
                                <div class="review_stats">
                                    <div class="review_critic">
                                        <div class="name">
                                                                                            <a href="/user/HapexIndustries">HapexIndustries</a>
                                                                                                                                </div>

                                                                                    <div class="date">Mar 25, 2012</div>
                                                                            </div>
                                    
                                    <div class="review_grade">
                                                
<div class="metascore_w user medium game mixed indiv">5</div>

                                    </div>
                                </div>
                                <div class="review_body">
                                                        
                                        <span class="inline_expand_collapse inline_collapsed" id="review_blurb_2269822"><span class="blurb blurb_collapsed">There are 3 things you won&apos;t expect in this game:  first, how dark and interesting the story is; second, how many bugs there are; third, how quickly it ends.  With occasional assistance from the in-game help system, I finished this game in under 5 hours, getting all three endings.  I found it to be very well done and thoroughly enjoyable and yet way, waaaay too short for a full price</span><span class="blurb blurb_expanded">There are 3 things you won&apos;t expect in this game:  first, how dark and interesting the story is; second, how many bugs there are; third, how quickly it ends.  With occasional assistance from the in-game help system, I finished this game in under 5 hours, getting all three endings.  I found it to be very well done and thoroughly enjoyable and yet way, waaaay too short for a full price purchase.  If the game were twice as long I&apos;d be giving it a 7 for STILL being kind of short.  Then there are several extremely annoying bugs, the worst of which are sequences in the game where your inventory either becomes invisible or vanishes entirely.  Kind of a big deal in an adventure game.  As it is, I have to give the game a 5 if you pay full price, 6 if it&apos;s patched properly.  If you somehow get it for 10-20 bucks, or money is no object to you, that review goes up to an 8.5.</span><span class="blurb_etc">&#x2026;</span> <a rel="nofollow" class="toggle_expand_collapse toggle_expand" href="/game/pc/yesterday/user-reviews?user_review_id=2269822">Expand</a></span>
            </div>
                            </div>
                                                        <div class="review_section review_actions ">
                                <ul class="review_actions">
                                                                            <li class="review_action review_helpful">
                                            <div class="review_helpful">
    <div class="rating_thumbs">
        			<div class="helpful_summary thumb_count">
				<a href="https://secure.metacritic.com/login">
				<span class="total_ups">2</span>
				of 
				<span class="total_thumbs">5</span>
				users found this helpful
                </a>
			</div>
                <div style="clear:both;"></div>
    </div>
</div>
                                        </li>
                                                                                                                                                <li class="review_action">
                                        <a href="/user/HapexIndustries">All this user&apos;s reviews</a>
                                    </li>
                                                                    </ul>
                            </div>
                            
                                                    </div>
                    </div></div></div></div>
                </li>
                                                                                    <li id="user_review_4369783" class="review user_review">
                    <div class="review_btm review_btm_r"><div class="review_btm review_btm_l"><div class="review_top review_top_r"><div class="review_top review_top_l">
                        <div class="review_content">
                            <div class="review_section">
                                <div class="review_stats">
                                    <div class="review_critic">
                                        <div class="name">
                                                                                            <a href="/user/Chris_DK">Chris_DK</a>
                                                                                                                                </div>

                                                                                    <div class="date">Jul 19, 2014</div>
                                                                            </div>
                                    
                                    <div class="review_grade">
                                                
<div class="metascore_w user medium game negative indiv">0</div>

                                    </div>
                                </div>
                                <div class="review_body">
                                                        
                                        <span class="inline_expand_collapse inline_collapsed" id="review_blurb_4369783"><span class="blurb blurb_collapsed">I love Pendulo Studios for making Runaway 3: A Twist of Fate and The Next Big Thing, they are absolutely great games, but Yesterday is a bitter disappointment. I really don&apos;t know what they were thinking when they made this, usually Pendulo games are joyful and charming games with funny characters that are really lovable but in this game they are trying to be gloomy and serious and it&apos;s</span><span class="blurb blurb_expanded">I love Pendulo Studios for making Runaway 3: A Twist of Fate and The Next Big Thing, they are absolutely great games, but Yesterday is a bitter disappointment. I really don&apos;t know what they were thinking when they made this, usually Pendulo games are joyful and charming games with funny characters that are really lovable but in this game they are trying to be gloomy and serious and it&apos;s just not their style. The story is weak and way too short to get into. The characters in this game are all boring and weak, especially the dialogs and all the endings are completely awful and short and I really dislike the comic style they have chosen for this game.</span><span class="blurb_etc">&#x2026;</span> <a rel="nofollow" class="toggle_expand_collapse toggle_expand" href="/game/pc/yesterday/user-reviews?user_review_id=4369783">Expand</a></span>
            </div>
                            </div>
                                                        <div class="review_section review_actions ">
                                <ul class="review_actions">
                                                                            <li class="review_action review_helpful">
                                            <div class="review_helpful">
    <div class="rating_thumbs">
        			<div class="helpful_summary thumb_count">
				<a href="https://secure.metacritic.com/login">
				<span class="total_ups">2</span>
				of 
				<span class="total_thumbs">5</span>
				users found this helpful
                </a>
			</div>
                <div style="clear:both;"></div>
    </div>
</div>
                                        </li>
                                                                                                                                                <li class="review_action">
                                        <a href="/user/Chris_DK">All this user&apos;s reviews</a>
                                    </li>
                                                                    </ul>
                            </div>
                            
                                                    </div>
                    </div></div></div></div>
                </li>
                                                                                    <li id="user_review_2873344" class="review user_review">
                    <div class="review_btm review_btm_r"><div class="review_btm review_btm_l"><div class="review_top review_top_r"><div class="review_top review_top_l">
                        <div class="review_content">
                            <div class="review_section">
                                <div class="review_stats">
                                    <div class="review_critic">
                                        <div class="name">
                                                                                            <a href="/user/I_Am_Turok">I_Am_Turok</a>
                                                                                                                                </div>

                                                                                    <div class="date">Jan  3, 2013</div>
                                                                            </div>
                                    
                                    <div class="review_grade">
                                                
<div class="metascore_w user medium game mixed indiv">5</div>

                                    </div>
                                </div>
                                <div class="review_body">
                                                        
                                        <span class="inline_expand_collapse inline_collapsed" id="review_blurb_2873344"><span class="blurb blurb_collapsed">This game is competent (I found no bugs), but approach with caution and do not expect too much. As stated elsewhere, it&apos;s short (&lt; 5 hours), and if like me you rate games of 1$ per hour of game-play to be the top range, then buy for only $5. The graphics are of the Monkey Island/The Next Big Thing style, which is fine for comedy games but not for more adult themes that this tries to be. It</span><span class="blurb blurb_expanded">This game is competent (I found no bugs), but approach with caution and do not expect too much. As stated elsewhere, it&apos;s short (&lt; 5 hours), and if like me you rate games of 1$ per hour of game-play to be the top range, then buy for only $5. The graphics are of the Monkey Island/The Next Big Thing style, which is fine for comedy games but not for more adult themes that this tries to be. It needs to be a lot darker in visual tone and music. The story is a mix between Broken Sword and something from an Irvine Welsh novel, with even some curse words in there (probably best to know if buying for someone less than 10 year olds). The music is forgettable and does not add anything to the game. Overall, buy cheap, enjoy one or two solving screens, and (probably) like me, Google the other 3 alternate endings, as the last save-point is ridiculously far back in the game.</span><span class="blurb_etc">&#x2026;</span> <a rel="nofollow" class="toggle_expand_collapse toggle_expand" href="/game/pc/yesterday/user-reviews?user_review_id=2873344">Expand</a></span>
            </div>
                            </div>
                                                        <div class="review_section review_actions ">
                                <ul class="review_actions">
                                                                            <li class="review_action review_helpful">
                                            <div class="review_helpful">
    <div class="rating_thumbs">
        			<div class="helpful_summary thumb_count">
				<a href="https://secure.metacritic.com/login">
				<span class="total_ups">1</span>
				of 
				<span class="total_thumbs">3</span>
				users found this helpful
                </a>
			</div>
                <div style="clear:both;"></div>
    </div>
</div>
                                        </li>
                                                                                                                                                <li class="review_action">
                                        <a href="/user/I_Am_Turok">All this user&apos;s reviews</a>
                                    </li>
                                                                    </ul>
                            </div>
                            
                                                    </div>
                    </div></div></div></div>
                </li>
                                                                                    <li id="user_review_2695983" class="review user_review">
                    <div class="review_btm review_btm_r"><div class="review_btm review_btm_l"><div class="review_top review_top_r"><div class="review_top review_top_l">
                        <div class="review_content">
                            <div class="review_section">
                                <div class="review_stats">
                                    <div class="review_critic">
                                        <div class="name">
                                                                                            <a href="/user/LauraKat">LauraKat</a>
                                                                                                                                </div>

                                                                                    <div class="date">Oct 15, 2012</div>
                                                                            </div>
                                    
                                    <div class="review_grade">
                                                
<div class="metascore_w user medium game positive indiv">9</div>

                                    </div>
                                </div>
                                <div class="review_body">
                                                        
                                        <span class="inline_expand_collapse inline_collapsed" id="review_blurb_2695983"><span class="blurb blurb_collapsed">This game had me hooked from the get go, throwing me straight into a world with interesting, multi-faceted characters, a mystery to solve, and beautiful hand-drawn backgrounds. I was immediately struck by how player friendly the game is. I was always given enough information to work out what to do next and if I ran into trouble there was a helpful hint system. When I tried to do something</span><span class="blurb blurb_expanded">This game had me hooked from the get go, throwing me straight into a world with interesting, multi-faceted characters, a mystery to solve, and beautiful hand-drawn backgrounds. I was immediately struck by how player friendly the game is. I was always given enough information to work out what to do next and if I ran into trouble there was a helpful hint system. When I tried to do something that seemed logical to me, the game would almost always let me try it and give me an informative message about why the item combination didn&apos;t work. These qualities are sadly lacking in most adventure games I&apos;ve played so I applaud Yesterday for getting this so right and not leaving the player scratching their head as to why those items &quot;don&apos;t work together&quot;.
<br>Yesterday loses a point for, yes being too short, and because consequently the narrative felt a bit rushed and I would have liked to have seen the many reveals spread out a bit more. The game took me about 8 hours but the complex story deserved twice that. Still, the game remained engaging and fun the entire time and kept me on the edge of my seat.</span><span class="blurb_etc">&#x2026;</span> <a rel="nofollow" class="toggle_expand_collapse toggle_expand" href="/game/pc/yesterday/user-reviews?user_review_id=2695983">Expand</a></span>
            </div>
                            </div>
                                                        <div class="review_section review_actions ">
                                <ul class="review_actions">
                                                                            <li class="review_action review_helpful">
                                            <div class="review_helpful">
    <div class="rating_thumbs">
        			<div class="helpful_summary thumb_count">
				<a href="https://secure.metacritic.com/login">
				<span class="total_ups">1</span>
				of 
				<span class="total_thumbs">3</span>
				users found this helpful
                </a>
			</div>
                <div style="clear:both;"></div>
    </div>
</div>
                                        </li>
                                                                                                                                                <li class="review_action">
                                        <a href="/user/LauraKat">All this user&apos;s reviews</a>
                                    </li>
                                                                    </ul>
                            </div>
                            
                                                    </div>
                    </div></div></div></div>
                </li>
                                                                                    <li id="user_review_6992054" class="review user_review last_review">
                    <div class="review_btm review_btm_r"><div class="review_btm review_btm_l"><div class="review_top review_top_r"><div class="review_top review_top_l">
                        <div class="review_content">
                            <div class="review_section">
                                <div class="review_stats">
                                    <div class="review_critic">
                                        <div class="name">
                                                                                            <a href="/user/Mandulum">Mandulum</a>
                                                                                                                                </div>

                                                                                    <div class="date">Feb 28, 2017</div>
                                                                            </div>
                                    
                                    <div class="review_grade">
                                                
<div class="metascore_w user medium game mixed indiv">6</div>

                                    </div>
                                </div>
                                <div class="review_body">
                                                        
                                        <span>Five Word Review: By-the-numbers adventure game.
<br>Favorite Thing: The story was decently interesting, enough that I don&apos;t regret playing.
<br>Least Favorite Thing: Nothing stands out over other adventure games. Additionally, the UI is terrible.
<br>
<br>Playtime: ~ 4h
<br>Enjoyment: 6/10
<br>Recommendation: Yes, sort of. I played it because I was interested in the newly released &apos;Yesterday Origins&apos;.</span>
            </div>
                            </div>
                                                        <div class="review_section review_actions ">
                                <ul class="review_actions">
                                                                            <li class="review_action review_helpful">
                                            <div class="review_helpful">
    <div class="rating_thumbs">
        			<div class="helpful_summary thumb_count">
				<a href="https://secure.metacritic.com/login">
				<span class="total_ups">0</span>
				of 
				<span class="total_thumbs">0</span>
				users found this helpful
                </a>
			</div>
                <div style="clear:both;"></div>
    </div>
</div>
                                        </li>
                                                                                                                                                <li class="review_action">
                                        <a href="/user/Mandulum">All this user&apos;s reviews</a>
                                    </li>
                                                                    </ul>
                            </div>
                            
                                                    </div>
                    </div></div></div></div>
                </li>
                                            