
                                                            <li id="user_review_7207510" class="review user_review first_review">
                    <div class="review_btm review_btm_r"><div class="review_btm review_btm_l"><div class="review_top review_top_r"><div class="review_top review_top_l">
                        <div class="review_content">
                            <div class="review_section">
                                <div class="review_stats">
                                    <div class="review_critic">
                                        <div class="name">
                                                                                            <a href="/user/Underpants158">Underpants158</a>
                                                                                                                                </div>

                                                                                    <div class="date">Apr  6, 2017</div>
                                                                            </div>
                                    
                                    <div class="review_grade">
                                                
<div class="metascore_w user medium game mixed indiv">6</div>

                                    </div>
                                </div>
                                <div class="review_body">
                                                        
                                        <span>Too long for a game with boring gameplay. Story is slow to unfold. Game would be much better if condensed. While it is compared to Papers Please I think what makes Papers Please the superior game is emotionally gripping decisions and 5 hour length.</span>
            </div>
                            </div>
                                                        <div class="review_section review_actions ">
                                <ul class="review_actions">
                                                                            <li class="review_action review_helpful">
                                            <div class="review_helpful">
    <div class="rating_thumbs">
        			<div class="helpful_summary thumb_count">
				<a href="https://secure.metacritic.com/login">
				<span class="total_ups">1</span>
				of 
				<span class="total_thumbs">2</span>
				users found this helpful
                </a>
			</div>
                <div style="clear:both;"></div>
    </div>
</div>
                                        </li>
                                                                                                                                                <li class="review_action">
                                        <a href="/user/Underpants158">All this user&apos;s reviews</a>
                                    </li>
                                                                    </ul>
                            </div>
                            
                                                    </div>
                    </div></div></div></div>
                </li>
                                                                                    <li id="user_review_7200928" class="review user_review">
                    <div class="review_btm review_btm_r"><div class="review_btm review_btm_l"><div class="review_top review_top_r"><div class="review_top review_top_l">
                        <div class="review_content">
                            <div class="review_section">
                                <div class="review_stats">
                                    <div class="review_critic">
                                        <div class="name">
                                                                                            <a href="/user/Tatar">Tatar</a>
                                                                                                                                </div>

                                                                                    <div class="date">Apr  5, 2017</div>
                                                                            </div>
                                    
                                    <div class="review_grade">
                                                
<div class="metascore_w user medium game positive indiv">8</div>

                                    </div>
                                </div>
                                <div class="review_body">
                                                        
                                        <span>Very nice game. Very interesting story in the mood of 80&apos;s. Lots of jokes, films references, great funny dialogues and most of all good Police Story with good written characters.  Graphics maybe isn&apos;t for all players but is nice.</span>
            </div>
                            </div>
                                                        <div class="review_section review_actions ">
                                <ul class="review_actions">
                                                                            <li class="review_action review_helpful">
                                            <div class="review_helpful">
    <div class="rating_thumbs">
        			<div class="helpful_summary thumb_count">
				<a href="https://secure.metacritic.com/login">
				<span class="total_ups">1</span>
				of 
				<span class="total_thumbs">2</span>
				users found this helpful
                </a>
			</div>
                <div style="clear:both;"></div>
    </div>
</div>
                                        </li>
                                                                                                                                                <li class="review_action">
                                        <a href="/user/Tatar">All this user&apos;s reviews</a>
                                    </li>
                                                                    </ul>
                            </div>
                            
                                                    </div>
                    </div></div></div></div>
                </li>
                                                                                    <li id="user_review_7310979" class="review user_review">
                    <div class="review_btm review_btm_r"><div class="review_btm review_btm_l"><div class="review_top review_top_r"><div class="review_top review_top_l">
                        <div class="review_content">
                            <div class="review_section">
                                <div class="review_stats">
                                    <div class="review_critic">
                                        <div class="name">
                                                                                            <a href="/user/Vinor34">Vinor34</a>
                                                                                                                                </div>

                                                                                    <div class="date">May 18, 2017</div>
                                                                            </div>
                                    
                                    <div class="review_grade">
                                                
<div class="metascore_w user medium game mixed indiv">6</div>

                                    </div>
                                </div>
                                <div class="review_body">
                                                        
                                        <span>The game attracts time and atmosphere. And the first couple of hours it is very nice to play. Dialogues are excellent, the plot of the plot is intriguing. But then and before the end, the game becomes a routine. The gameplay does not change, the plot does not develop, it all coaxes boredom and despondency. You can play, but the game will quickly get bored.</span>
            </div>
                            </div>
                                                        <div class="review_section review_actions ">
                                <ul class="review_actions">
                                                                            <li class="review_action review_helpful">
                                            <div class="review_helpful">
    <div class="rating_thumbs">
        			<div class="helpful_summary thumb_count">
				<a href="https://secure.metacritic.com/login">
				<span class="total_ups">0</span>
				of 
				<span class="total_thumbs">0</span>
				users found this helpful
                </a>
			</div>
                <div style="clear:both;"></div>
    </div>
</div>
                                        </li>
                                                                                                                                                <li class="review_action">
                                        <a href="/user/Vinor34">All this user&apos;s reviews</a>
                                    </li>
                                                                    </ul>
                            </div>
                            
                                                    </div>
                    </div></div></div></div>
                </li>
                                                                                    <li id="user_review_7286050" class="review user_review">
                    <div class="review_btm review_btm_r"><div class="review_btm review_btm_l"><div class="review_top review_top_r"><div class="review_top review_top_l">
                        <div class="review_content">
                            <div class="review_section">
                                <div class="review_stats">
                                    <div class="review_critic">
                                        <div class="name">
                                                                                            <a href="/user/Mryx">Mryx</a>
                                                                                                                                </div>

                                                                                    <div class="date">May  8, 2017</div>
                                                                            </div>
                                    
                                    <div class="review_grade">
                                                
<div class="metascore_w user medium game positive indiv">9</div>

                                    </div>
                                </div>
                                <div class="review_body">
                                                        
                                        <span class="inline_expand_collapse inline_collapsed" id="review_blurb_7286050"><span class="blurb blurb_collapsed">&#x412; Beat Cop &#x43D;&#x430;&#x43C; &#x43F;&#x440;&#x435;&#x434;&#x441;&#x442;&#x430;&#x432;&#x44F;&#x442; &#x442;&#x443; &#x441;&#x430;&#x43C;&#x443;&#x44E; &#x43D;&#x435;&#x441;&#x43F;&#x440;&#x430;&#x432;&#x435;&#x434;&#x43B;&#x438;&#x432;&#x443;&#x44E; &#x436;&#x438;&#x437;&#x43D;&#x44C; &#x43F;&#x43E;&#x43B;&#x438;&#x446;&#x435;&#x439;&#x441;&#x43A;&#x43E;&#x433;&#x43E; &#x432; &#x434;&#x435;&#x43A;&#x43E;&#x440;&#x430;&#x446;&#x438;&#x44F;&#x445; &#x410;&#x43C;&#x435;&#x440;&#x438;&#x43A;&#x438; 80-&#x44B;&#x445;. &#x414;&#x436;&#x435;&#x43A; &#x41A;&#x435;&#x43B;&#x43B;&#x438; &#x438; &#x435;&#x433;&#x43E; &#x43F;&#x440;&#x438;&#x43A;&#x43B;&#x44E;&#x447;&#x435;&#x43D;&#x438;&#x435; &#x434;&#x43B;&#x438;&#x43D;&#x43E;&#x439; &#x432; 21 &#x434;&#x435;&#x43D;&#x44C; &#x434;&#x430;&#x43D;&#x44C; &#x440;&#x430;&#x437;&#x440;&#x430;&#x431;&#x43E;&#x442;&#x447;&#x438;&#x43A;&#x43E;&#x432; &#x442;&#x435;&#x43C; &#x441;&#x430;&#x43C;&#x44B;&#x43C; &#x432;&#x440;&#x435;&#x43C;&#x435;&#x43D;&#x430;&#x43C;, &#x43A;&#x43E;&#x433;&#x434;&#x430; &#x432;&#x44B; &#x431;&#x44B;&#x43B;&#x43E; &#x43D;&#x430;&#x438;&#x432;&#x43D;&#x43E; &#x438; &#x433;&#x438;&#x43F;&#x435;&#x440;&#x443;&#x442;&#x440;&#x438;&#x440;&#x43E;&#x432;&#x430;&#x43D;&#x43D;&#x43E;. &#x41E; &#x447;&#x435;&#x43C; &#x43E;&#x43D;&#x438; &#x441;&#x43E;&#x43E;&#x431;&#x449;&#x430;&#x44E;&#x442; &#x432; &#x43D;&#x430;&#x447;&#x430;&#x43B;&#x435; &#x438;&#x433;&#x440;&#x44B;. &#x41F;&#x43E;&#x441;&#x43B;&#x435; &#x44D;&#x442;&#x43E; &#x431;&#x443;&#x434;&#x44C;&#x442;&#x435; &#x433;&#x43E;&#x442;&#x43E;&#x432;&#x44B; &#x43A; &#x43E;&#x442;&#x441;&#x443;&#x442;&#x441;&#x442;&#x432;&#x438;&#x44E; &#x446;&#x435;&#x43D;&#x437;&#x443;&#x440;&#x44B; &#x438; &#x43F;&#x43E;&#x43B;&#x438;&#x442;&#x43A;&#x43E;&#x440;&#x440;&#x435;&#x43A;&#x442;&#x43D;&#x43E;&#x441;&#x442;&#x438;. &#x41A;&#x430;&#x436;&#x434;&#x44B;&#x439; &#x434;&#x435;&#x43D;&#x44C; &#x431;&#x443;&#x434;&#x435;&#x442;&#x435; &#x432; &#x442;&#x435;&#x447;&#x435;&#x43D;&#x438;&#x435; 10-15 &#x43C;&#x438;&#x43D;&#x443;&#x442; &#x43F;&#x43E;&#x43B;&#x443;&#x447;&#x430;&#x442;&#x44C; &#x43C;&#x43E;&#x449;&#x43D;&#x435;&#x439;&#x448;&#x443;&#x44E;</span><span class="blurb blurb_expanded">&#x412; Beat Cop &#x43D;&#x430;&#x43C; &#x43F;&#x440;&#x435;&#x434;&#x441;&#x442;&#x430;&#x432;&#x44F;&#x442; &#x442;&#x443; &#x441;&#x430;&#x43C;&#x443;&#x44E; &#x43D;&#x435;&#x441;&#x43F;&#x440;&#x430;&#x432;&#x435;&#x434;&#x43B;&#x438;&#x432;&#x443;&#x44E; &#x436;&#x438;&#x437;&#x43D;&#x44C; &#x43F;&#x43E;&#x43B;&#x438;&#x446;&#x435;&#x439;&#x441;&#x43A;&#x43E;&#x433;&#x43E; &#x432; &#x434;&#x435;&#x43A;&#x43E;&#x440;&#x430;&#x446;&#x438;&#x44F;&#x445; &#x410;&#x43C;&#x435;&#x440;&#x438;&#x43A;&#x438; 80-&#x44B;&#x445;. &#x414;&#x436;&#x435;&#x43A; &#x41A;&#x435;&#x43B;&#x43B;&#x438; &#x438; &#x435;&#x433;&#x43E; &#x43F;&#x440;&#x438;&#x43A;&#x43B;&#x44E;&#x447;&#x435;&#x43D;&#x438;&#x435; &#x434;&#x43B;&#x438;&#x43D;&#x43E;&#x439; &#x432; 21 &#x434;&#x435;&#x43D;&#x44C; &#x434;&#x430;&#x43D;&#x44C; &#x440;&#x430;&#x437;&#x440;&#x430;&#x431;&#x43E;&#x442;&#x447;&#x438;&#x43A;&#x43E;&#x432; &#x442;&#x435;&#x43C; &#x441;&#x430;&#x43C;&#x44B;&#x43C; &#x432;&#x440;&#x435;&#x43C;&#x435;&#x43D;&#x430;&#x43C;, &#x43A;&#x43E;&#x433;&#x434;&#x430; &#x432;&#x44B; &#x431;&#x44B;&#x43B;&#x43E; &#x43D;&#x430;&#x438;&#x432;&#x43D;&#x43E; &#x438; &#x433;&#x438;&#x43F;&#x435;&#x440;&#x443;&#x442;&#x440;&#x438;&#x440;&#x43E;&#x432;&#x430;&#x43D;&#x43D;&#x43E;. &#x41E; &#x447;&#x435;&#x43C; &#x43E;&#x43D;&#x438; &#x441;&#x43E;&#x43E;&#x431;&#x449;&#x430;&#x44E;&#x442; &#x432; &#x43D;&#x430;&#x447;&#x430;&#x43B;&#x435; &#x438;&#x433;&#x440;&#x44B;. &#x41F;&#x43E;&#x441;&#x43B;&#x435; &#x44D;&#x442;&#x43E; &#x431;&#x443;&#x434;&#x44C;&#x442;&#x435; &#x433;&#x43E;&#x442;&#x43E;&#x432;&#x44B; &#x43A; &#x43E;&#x442;&#x441;&#x443;&#x442;&#x441;&#x442;&#x432;&#x438;&#x44E; &#x446;&#x435;&#x43D;&#x437;&#x443;&#x440;&#x44B; &#x438; &#x43F;&#x43E;&#x43B;&#x438;&#x442;&#x43A;&#x43E;&#x440;&#x440;&#x435;&#x43A;&#x442;&#x43D;&#x43E;&#x441;&#x442;&#x438;. &#x41A;&#x430;&#x436;&#x434;&#x44B;&#x439; &#x434;&#x435;&#x43D;&#x44C; &#x431;&#x443;&#x434;&#x435;&#x442;&#x435; &#x432; &#x442;&#x435;&#x447;&#x435;&#x43D;&#x438;&#x435; 10-15 &#x43C;&#x438;&#x43D;&#x443;&#x442; &#x43F;&#x43E;&#x43B;&#x443;&#x447;&#x430;&#x442;&#x44C; &#x43C;&#x43E;&#x449;&#x43D;&#x435;&#x439;&#x448;&#x443;&#x44E; &#x43A;&#x43E;&#x43D;&#x446;&#x435;&#x43D;&#x442;&#x440;&#x430;&#x446;&#x438;&#x44E; &#x447;&#x435;&#x440;&#x43D;&#x43E;&#x433;&#x43E; &#x438; &#x43F;&#x43E;&#x445;&#x430;&#x431;&#x43D;&#x43E;&#x433;&#x43E; &#x44E;&#x43C;&#x43E;&#x440;&#x430;. &#x418;&#x43C;&#x435;&#x439;&#x442;&#x435; &#x432;&#x432;&#x438;&#x434;&#x443;, &#x447;&#x442;&#x43E; &#x44E;&#x43C;&#x43E;&#x440; &#x43D;&#x430;&#x441;&#x442;&#x43E;&#x44F;&#x449;&#x430;&#x44F; &#x440;&#x435;&#x442;&#x440;&#x43E;&#x441;&#x43F;&#x435;&#x43A;&#x446;&#x438;&#x44F; &#x438;&#x437; 80&#x44B;&#x445;, &#x43F;&#x43E;&#x442;&#x43E;&#x43C;&#x443; &#x43D;&#x435; &#x436;&#x434;&#x438;&#x442;&#x435; &#x432;&#x44B;&#x441;&#x43E;&#x43A;&#x43E;&#x438;&#x43D;&#x442;&#x435;&#x43B;&#x43B;&#x435;&#x43A;&#x442;&#x443;&#x430;&#x43B;&#x44C;&#x43D;&#x44B;&#x445; &#x43F;&#x430;&#x441;&#x441;&#x430;&#x436;&#x435;&#x439;. &#x428;&#x443;&#x442;&#x43A;&#x438; &#x43F;&#x440;&#x43E; &#x43C;&#x430;&#x43C;, &#x447;&#x435;&#x440;&#x43D;&#x44B;&#x445;, &#x43C;&#x430;&#x444;&#x438;&#x44E;, &#x43A;&#x43E;&#x43F;&#x43E;&#x432;, &#x43F;&#x440;&#x43E;&#x441;&#x442;&#x438;&#x442;&#x443;&#x442;&#x43E;&#x43A;, &#x433;&#x435;&#x435;&#x432;, &#x444;&#x435;&#x43C;&#x435;&#x43D;&#x438;&#x437;&#x43C;, &#x43F;&#x43E;&#x43B;&#x43E;&#x432;&#x44B;&#x435; &#x43E;&#x440;&#x433;&#x430;&#x43D;&#x44B;, &#x43D;&#x430;&#x440;&#x43A;&#x43E;&#x442;&#x438;&#x43A;&#x438; &#x43F;&#x43E;-&#x43E;&#x442;&#x434;&#x435;&#x43B;&#x44C;&#x43D;&#x43E;&#x441;&#x442;&#x438; &#x438; &#x441;&#x440;&#x430;&#x437;&#x443; &#x432; &#x43E;&#x434;&#x43D;&#x43E;&#x439; &#x444;&#x440;&#x430;&#x437;&#x435; &#x2014; &#x432;&#x43E;&#x442; &#x447;&#x442;&#x43E; &#x441;&#x43B;&#x435;&#x434;&#x443;&#x435;&#x442; &#x436;&#x434;&#x430;&#x442;&#x44C;. &#x418; &#x44D;&#x442;&#x43E;&#x442; &#x43D;&#x435; &#x43E;&#x441;&#x43D;&#x43E;&#x432;&#x43D;&#x43E;&#x439; &#x44D;&#x43B;&#x435;&#x43C;&#x435;&#x43D;&#x442; &#x438;&#x433;&#x440;&#x44B; &#x43F;&#x440;&#x438;&#x434;&#x430;&#x435;&#x442; &#x435;&#x439; &#x442;&#x443; &#x441;&#x430;&#x43C;&#x443;&#x44E; &#x43D;&#x435;&#x432;&#x435;&#x440;&#x43E;&#x44F;&#x442;&#x43D;&#x43E; &#x43F;&#x43E;&#x43B;&#x43E;&#x436;&#x438;&#x442;&#x435;&#x43B;&#x44C;&#x43D;&#x443;&#x44E; &#x43E;&#x446;&#x435;&#x43D;&#x43A;&#x443;.
<br>
<br>&#x412; &#x43F;&#x440;&#x43E;&#x442;&#x438;&#x432;&#x43D;&#x43E;&#x43C; &#x441;&#x43B;&#x443;&#x447;&#x430;&#x435;, &#x435;&#x441;&#x43B;&#x438; &#x432;&#x44B;&#x447;&#x435;&#x440;&#x43A;&#x43D;&#x443;&#x442;&#x44C; &#x430;&#x442;&#x43C;&#x43E;&#x441;&#x444;&#x435;&#x440;&#x443; 80-&#x44B;&#x445; &#x438; &#x44E;&#x43C;&#x43E;&#x440;, &#x442;&#x43E; &#x43C;&#x44B; &#x43F;&#x43E;&#x43B;&#x443;&#x447;&#x438;&#x442; &#x441;&#x438;&#x43C;&#x443;&#x43B;&#x44F;&#x442;&#x43E;&#x440; &#x432;&#x435;&#x441;&#x44C;&#x43C;&#x430; &#x43E;&#x434;&#x43D;&#x43E;&#x43E;&#x431;&#x440;&#x430;&#x437;&#x43D;&#x44B;&#x439; &#x438; &#x441; &#x43E;&#x433;&#x440;&#x430;&#x43D;&#x438;&#x447;&#x435;&#x43D;&#x43D;&#x44B;&#x43C; &#x432;&#x440;&#x435;&#x43C;&#x435;&#x43D;&#x435;&#x43C;, &#x437;&#x430; &#x43A;&#x43E;&#x442;&#x43E;&#x440;&#x43E;&#x435; &#x43D;&#x430;&#x434;&#x43E; &#x443;&#x441;&#x43F;&#x435;&#x442;&#x44C; &#x441;&#x434;&#x435;&#x43B;&#x430;&#x442;&#x44C; &#x43C;&#x43E;&#x43D;&#x43E;&#x442;&#x43E;&#x43D;&#x43D;&#x44B;&#x439; &#x442;&#x440;&#x443;&#x434;. &#x41F;&#x43E;&#x447;&#x442;&#x438; &#x43A;&#x430;&#x436;&#x434;&#x44B;&#x439; &#x434;&#x435;&#x43D;&#x44C; &#x43D;&#x430;&#x43C; &#x431;&#x443;&#x434;&#x443;&#x442; &#x434;&#x430;&#x432;&#x430;&#x442;&#x44C; &#x43E;&#x434;&#x43D;&#x43E;, &#x434;&#x432;&#x430; &#x43E;&#x441;&#x43D;&#x43E;&#x432;&#x43D;&#x44B;&#x445; &#x43F;&#x43E;&#x440;&#x443;&#x447;&#x435;&#x43D;&#x438;&#x439;. &#x42D;&#x442;&#x43E; &#x431;&#x443;&#x434;&#x443;&#x442; &#x437;&#x430;&#x434;&#x430;&#x447;&#x438; &#x432;&#x440;&#x43E;&#x434;&#x435; &#x438;&#x434;&#x438; &#x442;&#x443;&#x434;&#x430;, &#x43F;&#x43E;&#x442;&#x43E;&#x43C; &#x442;&#x443;&#x434;&#x430;, &#x43F;&#x43E;&#x442;&#x43E;&#x43C; &#x441;&#x44E;&#x434;&#x430;, &#x43F;&#x43E;&#x43B;&#x443;&#x447;&#x438; &#x43D;&#x430;&#x433;&#x440;&#x430;&#x434;&#x443;. &#x415;&#x441;&#x442;&#x435;&#x441;&#x442;&#x432;&#x435;&#x43D;&#x43D;&#x43E;, &#x440;&#x430;&#x437;&#x440;&#x430;&#x431;&#x43E;&#x442;&#x447;&#x438;&#x43A;&#x438; &#x443;&#x43C;&#x435;&#x43B;&#x43E; &#x43E;&#x431;&#x43B;&#x430;&#x447;&#x438;&#x43B;&#x438; &#x44D;&#x442;&#x438; &#x441;&#x43A;&#x443;&#x447;&#x43D;&#x44B;&#x435; &#x43F;&#x43E;&#x440;&#x443;&#x447;&#x435;&#x43D;&#x438;&#x44F; &#x432; &#x438;&#x43D;&#x442;&#x435;&#x440;&#x435;&#x441;&#x43D;&#x44B;&#x435; &#x43C;&#x438;&#x441;&#x441;&#x438;&#x438;. &#x418; &#x432;&#x43E;&#x442; &#x432;&#x44B; &#x43F;&#x440;&#x43E;&#x432;&#x43E;&#x434;&#x438;&#x442;&#x435; &#x434;&#x435;&#x43D;&#x44C; &#x441; &#x43D;&#x430;&#x433;&#x43B;&#x44B;&#x43C; &#x43A;&#x43E;&#x43B;&#x445;&#x43E;&#x437;&#x43D;&#x44B;&#x43C; &#x43F;&#x43E;&#x43B;&#x438;&#x446;&#x435;&#x439;&#x441;&#x43A;&#x438;&#x43C; &#x418;&#x433;&#x43E;&#x440;&#x435;&#x43C;, &#x43A;&#x43E;&#x442;&#x43E;&#x440;&#x43E;&#x439; &#x432;&#x435;&#x441;&#x44C; &#x434;&#x435;&#x43D;&#x44C; &#x434;&#x43E;&#x441;&#x442;&#x430;&#x432;&#x43B;&#x44F;&#x435;&#x442; &#x43D;&#x430;&#x43C; &#x43A;&#x443;&#x447;&#x443; &#x43F;&#x440;&#x43E;&#x431;&#x43B;&#x435;&#x43C;. &#x412;&#x43E;&#x442; &#x432;&#x44B; &#x43D;&#x43E;&#x441;&#x438;&#x442;&#x435;&#x441;&#x44C; &#x43F;&#x43E; &#x432;&#x441;&#x435;&#x439; &#x443;&#x43B;&#x438;&#x446;&#x435; &#x432; &#x43F;&#x43E;&#x438;&#x441;&#x43A;&#x430;&#x445; &#x440;&#x435;&#x43A;&#x442;&#x430;&#x43B;&#x44C;&#x43D;&#x44B;&#x445; &#x441;&#x432;&#x435;&#x447; &#x434;&#x43B;&#x44F; &#x441;&#x432;&#x44F;&#x442;&#x43E;&#x433;&#x43E; &#x43E;&#x442;&#x446;&#x430;, &#x43A;&#x43E;&#x442;&#x43E;&#x440;&#x44B;&#x439; &#x441;&#x43B;&#x43E;&#x432;&#x438;&#x43B; &#x432; &#x43F;&#x43E;&#x434;&#x432;&#x43E;&#x440;&#x43E;&#x442;&#x43D;&#x435; &#x43F;&#x435;&#x440;&#x435;&#x434;&#x43E;&#x437;. &#x421;&#x43E;&#x431;&#x44B;&#x442;&#x438;&#x435; &#x43F;&#x440;&#x43E;&#x438;&#x441;&#x445;&#x43E;&#x434;&#x438;&#x442; &#x43A;&#x430;&#x436;&#x434;&#x44B;&#x439; &#x434;&#x435;&#x43D;&#x44C; &#x438; &#x441;&#x442;&#x43E;&#x438;&#x442; &#x442;&#x43E;&#x433;&#x43E;, &#x447;&#x442;&#x43E;&#x431;&#x44B; &#x43E;&#x442;&#x440;&#x430;&#x431;&#x43E;&#x442;&#x430;&#x442;&#x44C; &#x435;&#x433;&#x43E;. &#x41E;&#x434;&#x43D;&#x430;&#x43A;&#x43E;, &#x432;&#x442;&#x43E;&#x440;&#x430;&#x44F; &#x447;&#x430;&#x441;&#x442;&#x44C; &#x43F;&#x43E;&#x440;&#x443;&#x447;&#x435;&#x43D;&#x438;&#x439; &#x43D;&#x435; &#x43F;&#x43E;&#x434;&#x434;&#x430;&#x435;&#x442;&#x441;&#x44F; &#x43D;&#x438;&#x43A;&#x430;&#x43A;&#x43E;&#x43C;&#x443; &#x441;&#x433;&#x43B;&#x430;&#x436;&#x438;&#x432;&#x430;&#x43D;&#x438;&#x44E; &#x434;&#x430;&#x436;&#x435; &#x448;&#x443;&#x442;&#x43A;&#x430;&#x43C;&#x438;. &#x41F;&#x440;&#x43E;&#x432;&#x435;&#x440;&#x43A;&#x430; &#x430;&#x432;&#x442;&#x43E;&#x43C;&#x43E;&#x431;&#x438;&#x43B;&#x435;&#x439; &#x438; &#x432;&#x44B;&#x43F;&#x438;&#x441;&#x43A;&#x430; &#x448;&#x442;&#x440;&#x430;&#x444;&#x43E;&#x432;. &#x42D;&#x442;&#x43E; &#x43E;&#x431;&#x44F;&#x437;&#x430;&#x442;&#x435;&#x43B;&#x44C;&#x43D;&#x430;&#x44F; &#x447;&#x430;&#x441;&#x442;&#x44C; &#x438;&#x433;&#x440;&#x44B;, &#x43A;&#x43E;&#x442;&#x43E;&#x440;&#x443;&#x44E; &#x43D;&#x435;&#x43B;&#x44C;&#x437;&#x44F; &#x438;&#x433;&#x43D;&#x43E;&#x440;&#x438;&#x440;&#x43E;&#x432;&#x430;&#x442;&#x44C;.
<br>
<br>Beat Cop &#x440;&#x430;&#x431;&#x43E;&#x442;&#x430;&#x435;&#x442; &#x442;&#x430;&#x43A;&#x438;&#x43C; &#x43E;&#x431;&#x440;&#x430;&#x437;&#x43E;&#x43C;, &#x447;&#x442;&#x43E; &#x432;&#x44B; &#x43C;&#x43E;&#x436;&#x435;&#x442;&#x435; &#x43F;&#x440;&#x43E;&#x436;&#x438;&#x442;&#x44C; 21 &#x434;&#x435;&#x43D;&#x44C;, &#x430; &#x43F;&#x43E;&#x442;&#x43E;&#x43C; &#x43F;&#x435;&#x440;&#x435;&#x43C;&#x43E;&#x442;&#x430;&#x442;&#x44C; &#x432;&#x440;&#x435;&#x43C;&#x44F; &#x432;&#x441;&#x43F;&#x44F;&#x442;&#x44C; &#x438; &#x43F;&#x440;&#x43E;&#x436;&#x438;&#x442;&#x44C; &#x438;&#x445; &#x438;&#x43D;&#x430;&#x447;&#x435;, &#x437;&#x43D;&#x430;&#x44F; &#x43A;&#x430;&#x43A; &#x440;&#x430;&#x437;&#x432;&#x438;&#x432;&#x430;&#x44E;&#x442;&#x441;&#x44F; &#x442;&#x435; &#x438;&#x43B;&#x438; &#x438;&#x43D;&#x44B;&#x435; &#x441;&#x43E;&#x431;&#x44B;&#x442;&#x438;&#x44F;. &#x41C;&#x43E;&#x436;&#x43D;&#x43E; &#x43D;&#x430;&#x437;&#x432;&#x430;&#x442;&#x44C; &#x44D;&#x442;&#x43E; &#x432; &#x43D;&#x435;&#x43A;&#x43E;&#x442;&#x43E;&#x440;&#x43E;&#x43C; &#x440;&#x43E;&#x434;&#x435; &#x440;&#x435;&#x438;&#x433;&#x440;&#x430;&#x431;&#x438;&#x43B;&#x44C;&#x43D;&#x43E;&#x441;&#x442;&#x44C;&#x44E;, &#x442;&#x430;&#x43A; &#x43A;&#x430;&#x43A; &#x447;&#x442;&#x43E;&#x431;&#x44B; &#x43F;&#x43E;&#x43B;&#x443;&#x447;&#x438;&#x442;&#x44C; &#x43E;&#x434;&#x43D;&#x443; &#x438;&#x437; &#x43A;&#x43E;&#x43D;&#x446;&#x43E;&#x432;&#x43E;&#x43A;, &#x432;&#x430;&#x43C; &#x43F;&#x440;&#x438;&#x434;&#x435;&#x442;&#x441;&#x44F; &#x441;&#x43E;&#x432;&#x435;&#x440;&#x448;&#x430;&#x442;&#x44C; &#x440;&#x44F;&#x434; &#x434;&#x435;&#x439;&#x441;&#x442;&#x432;&#x438;&#x439; &#x43F;&#x440;&#x43E;&#x442;&#x438;&#x432;&#x43E;&#x440;&#x435;&#x447;&#x430;&#x449;&#x438;&#x445; &#x434;&#x440;&#x443;&#x433;&#x438;&#x43C;. &#x41F;&#x443;&#x441;&#x442;&#x44C; &#x438; &#x43D;&#x435; &#x441; &#x43F;&#x435;&#x440;&#x432;&#x43E;&#x433;&#x43E; &#x434;&#x43D;&#x44F;, &#x43D;&#x43E; &#x43D;&#x430;&#x447;&#x430;&#x442;&#x44C; &#x43F;&#x430;&#x442;&#x440;&#x443;&#x43B;&#x438;&#x440;&#x43E;&#x432;&#x430;&#x442;&#x44C; &#x443;&#x43B;&#x438;&#x446;&#x44B; &#x438; &#x432;&#x44B;&#x43F;&#x43E;&#x43B;&#x43D;&#x44F;&#x442;&#x44C; &#x441;&#x442;&#x440;&#x430;&#x43D;&#x43D;&#x44B;&#x435; &#x437;&#x430;&#x434;&#x430;&#x43D;&#x438;&#x44F; &#x434;&#x43B;&#x44F; &#x43F;&#x43E;&#x43B;&#x438;&#x446;&#x438;&#x438;, &#x438;&#x442;&#x430;&#x43B;&#x44C;&#x44F;&#x43D;&#x441;&#x43A;&#x43E;&#x439; &#x43C;&#x430;&#x444;&#x438;&#x438; &#x438; &#x443;&#x43B;&#x438;&#x447;&#x43D;&#x44B;&#x445; &#x431;&#x430;&#x43D;&#x434;, &#x430; &#x442;&#x430;&#x43A;&#x436;&#x435; &#x43E;&#x441;&#x442;&#x430;&#x43B;&#x44C;&#x43D;&#x44B;&#x445; &#x43A;&#x43E;&#x43B;&#x43E;&#x440;&#x438;&#x442;&#x43D;&#x44B;&#x445; &#x43E;&#x431;&#x438;&#x442;&#x430;&#x442;&#x435;&#x43B;&#x435;&#x439; &#x443;&#x43B;&#x438;&#x446;&#x44B; &#x432;&#x430;&#x43C; &#x43F;&#x440;&#x438;&#x434;&#x435;&#x442;&#x441;&#x44F; &#x432;&#x43D;&#x43E;&#x432;&#x44C; &#x438; &#x432;&#x43D;&#x43E;&#x432;&#x44C;. &#x41A;&#x441;&#x442;&#x430;&#x442;&#x438;, &#x440;&#x430;&#x437;&#x440;&#x430;&#x431;&#x43E;&#x442;&#x447;&#x438;&#x43A;&#x430;&#x43C; &#x432;&#x43E;&#x43E;&#x431;&#x449;&#x435; &#x43D;&#x438;&#x447;&#x435;&#x433;&#x43E; &#x43D;&#x435; &#x43C;&#x435;&#x448;&#x430;&#x435;&#x442; &#x432;&#x43F;&#x43B;&#x435;&#x441;&#x442;&#x438; &#x432; &#x441;&#x44E;&#x436;&#x435;&#x442; &#x43D;&#x435;&#x441;&#x43A;&#x43E;&#x43B;&#x44C;&#x43A;&#x43E; &#x43D;&#x43E;&#x432;&#x44B;&#x445; &#x43B;&#x438;&#x446; &#x438; &#x43F;&#x43E;&#x44F;&#x432;&#x438;&#x442;&#x441;&#x44F; &#x435;&#x449;&#x451; &#x43F;&#x430;&#x440;&#x430;-&#x442;&#x440;&#x43E;&#x439;&#x43A;&#x430; &#x43A;&#x43E;&#x43D;&#x446;&#x43E;&#x432;&#x43E;&#x43A; &#x437;&#x430;&#x432;&#x44F;&#x437;&#x430;&#x43D;&#x43D;&#x430;&#x44F; &#x43D;&#x430; &#x44D;&#x442;&#x438;&#x445; &#x442;&#x438;&#x43F;&#x430;&#x445;. &#x422;&#x430;&#x43A; &#x447;&#x442;&#x43E; &#x441;&#x43D;&#x43E;&#x432;&#x430; &#x43F;&#x43E;&#x43B;&#x43E;&#x436;&#x438;&#x442;&#x435;&#x43B;&#x44C;&#x43D;&#x430;&#x44F; &#x441;&#x442;&#x43E;&#x440;&#x43E;&#x43D;&#x430; &#x438; &#x438;&#x441;&#x442;&#x43E;&#x440;&#x438;&#x44F; &#x43D;&#x435; &#x442;&#x430;&#x43A; &#x437;&#x430;&#x442;&#x44F;&#x43D;&#x443;&#x442;&#x430; &#x43A;&#x430;&#x43A; &#x438;&#x441;&#x442;&#x43E;&#x440;&#x438;&#x44F; This Is Police.
<br>
<br>&#x41E;&#x43F;&#x43E;&#x441;&#x442;&#x44B;&#x43B;&#x435;&#x432;&#x448;&#x438;&#x435; &#x438;&#x433;&#x440;&#x43E;&#x432;&#x43E;&#x43C;&#x443; &#x441;&#x43E;&#x43E;&#x431;&#x449;&#x435;&#x441;&#x442;&#x432;&#x443; &#x43F;&#x438;&#x43A;&#x441;&#x435;&#x43B;&#x438; &#x43D;&#x435; &#x442;&#x430;&#x43A; &#x443;&#x436; &#x438; &#x440;&#x430;&#x437;&#x434;&#x440;&#x430;&#x436;&#x430;&#x44E;&#x442;, &#x43A;&#x43E;&#x433;&#x434;&#x430; &#x432;&#x441;&#x435; &#x43E;&#x441;&#x442;&#x430;&#x43B;&#x44C;&#x43D;&#x44B;&#x435; &#x441;&#x43E;&#x441;&#x442;&#x430;&#x432;&#x43B;&#x44F;&#x44E;&#x449;&#x438;&#x435; &#x43F;&#x43E;&#x434;&#x43E;&#x431;&#x440;&#x430;&#x43D;&#x44B; &#x441;&#x43E; &#x432;&#x43A;&#x443;&#x441;&#x43E;&#x43C;. &#x41D;&#x430;&#x441;&#x442;&#x43E;&#x44F;&#x442;&#x435;&#x43B;&#x44C;&#x43D;&#x43E; &#x440;&#x435;&#x43A;&#x43E;&#x43C;&#x435;&#x43D;&#x434;&#x443;&#x44E; &#x43E;&#x43F;&#x440;&#x43E;&#x431;&#x43E;&#x432;&#x430;&#x442;&#x44C; Beat Cop. &#x422;&#x43E; &#x441;&#x430;&#x43C;&#x43E;&#x435;, &#x447;&#x442;&#x43E;&#x431;&#x44B; &#x43F;&#x440;&#x43E;&#x432;&#x435;&#x441;&#x442;&#x438; &#x432;&#x435;&#x447;&#x435;&#x440;-&#x434;&#x440;&#x443;&#x433;&#x43E;&#x439; &#x432; &#x43F;&#x440;&#x438;&#x44F;&#x442;&#x43D;&#x43E;&#x439; &#x430;&#x442;&#x43C;&#x43E;&#x441;&#x444;&#x435;&#x440;&#x435; &#x442;&#x440;&#x443;&#x434;&#x44F;&#x433;&#x438; &#x432;&#x44B;&#x43D;&#x443;&#x436;&#x434;&#x435;&#x43D;&#x43D;&#x43E;&#x433;&#x43E; &#x43E;&#x43F;&#x440;&#x430;&#x432;&#x434;&#x44B;&#x432;&#x430;&#x442;&#x44C;&#x441;&#x44F; &#x43F;&#x435;&#x440;&#x435;&#x434; &#x43E;&#x431;&#x449;&#x435;&#x441;&#x442;&#x432;&#x43E;&#x43C;, &#x432;&#x44B;&#x441;&#x43B;&#x443;&#x436;&#x438;&#x432;&#x430;&#x442;&#x44C;&#x441;&#x44F; &#x43F;&#x435;&#x440;&#x435;&#x434; &#x43D;&#x430;&#x447;&#x430;&#x43B;&#x44C;&#x441;&#x442;&#x432;&#x43E;&#x43C;, &#x43F;&#x440;&#x435;&#x441;&#x43C;&#x44B;&#x43A;&#x430;&#x442;&#x44C;&#x441;&#x44F; &#x43F;&#x435;&#x440;&#x435;&#x434; &#x431;&#x430;&#x43D;&#x434;&#x430;&#x43C;&#x438; &#x438;&#x43B;&#x438; &#x434;&#x430;&#x442;&#x44C; &#x43E;&#x442;&#x43F;&#x43E;&#x440; &#x432;&#x441;&#x435;&#x439; &#x44D;&#x442;&#x43E;&#x439; &#x448;&#x443;&#x448;&#x435;&#x440;&#x435;?</span><span class="blurb_etc">&#x2026;</span> <a rel="nofollow" class="toggle_expand_collapse toggle_expand" href="/game/pc/beat-cop/user-reviews?user_review_id=7286050">Expand</a></span>
            </div>
                            </div>
                                                        <div class="review_section review_actions ">
                                <ul class="review_actions">
                                                                            <li class="review_action review_helpful">
                                            <div class="review_helpful">
    <div class="rating_thumbs">
        			<div class="helpful_summary thumb_count">
				<a href="https://secure.metacritic.com/login">
				<span class="total_ups">0</span>
				of 
				<span class="total_thumbs">0</span>
				users found this helpful
                </a>
			</div>
                <div style="clear:both;"></div>
    </div>
</div>
                                        </li>
                                                                                                                                                <li class="review_action">
                                        <a href="/user/Mryx">All this user&apos;s reviews</a>
                                    </li>
                                                                    </ul>
                            </div>
                            
                                                    </div>
                    </div></div></div></div>
                </li>
                                                                                    <li id="user_review_7216018" class="review user_review">
                    <div class="review_btm review_btm_r"><div class="review_btm review_btm_l"><div class="review_top review_top_r"><div class="review_top review_top_l">
                        <div class="review_content">
                            <div class="review_section">
                                <div class="review_stats">
                                    <div class="review_critic">
                                        <div class="name">
                                                                                            <a href="/user/hassall">hassall</a>
                                                                                                                                </div>

                                                                                    <div class="date">Apr 10, 2017</div>
                                                                            </div>
                                    
                                    <div class="review_grade">
                                                
<div class="metascore_w user medium game positive indiv">8</div>

                                    </div>
                                </div>
                                <div class="review_body">
                                                        
                                        <span>Very nice game to play when you are bored and you need something to do, Story is slow to unfold and you have got too many jobs to do at one time, apart from that good game</span>
            </div>
                            </div>
                                                        <div class="review_section review_actions ">
                                <ul class="review_actions">
                                                                            <li class="review_action review_helpful">
                                            <div class="review_helpful">
    <div class="rating_thumbs">
        			<div class="helpful_summary thumb_count">
				<a href="https://secure.metacritic.com/login">
				<span class="total_ups">0</span>
				of 
				<span class="total_thumbs">0</span>
				users found this helpful
                </a>
			</div>
                <div style="clear:both;"></div>
    </div>
</div>
                                        </li>
                                                                                                                                                <li class="review_action">
                                        <a href="/user/hassall">All this user&apos;s reviews</a>
                                    </li>
                                                                    </ul>
                            </div>
                            
                                                    </div>
                    </div></div></div></div>
                </li>
                                                                                    <li id="user_review_7281245" class="review user_review">
                    <div class="review_btm review_btm_r"><div class="review_btm review_btm_l"><div class="review_top review_top_r"><div class="review_top review_top_l">
                        <div class="review_content">
                            <div class="review_section">
                                <div class="review_stats">
                                    <div class="review_critic">
                                        <div class="name">
                                                                                            <a href="/user/brazzerq">brazzerq</a>
                                                                                                                                </div>

                                                                                    <div class="date">May  6, 2017</div>
                                                                            </div>
                                    
                                    <div class="review_grade">
                                                
<div class="metascore_w user medium game mixed indiv">7</div>

                                    </div>
                                </div>
                                <div class="review_body">
                                                        
                                        <span>Beat Cop is a cool, pixel production based on old cop movies and serials. It has interesting gameplay, great dark humor, and entertaining characters. It&apos;s one of the best retro adventure of 2017.</span>
            </div>
                            </div>
                                                        <div class="review_section review_actions ">
                                <ul class="review_actions">
                                                                            <li class="review_action review_helpful">
                                            <div class="review_helpful">
    <div class="rating_thumbs">
        			<div class="helpful_summary thumb_count">
				<a href="https://secure.metacritic.com/login">
				<span class="total_ups">0</span>
				of 
				<span class="total_thumbs">0</span>
				users found this helpful
                </a>
			</div>
                <div style="clear:both;"></div>
    </div>
</div>
                                        </li>
                                                                                                                                                <li class="review_action">
                                        <a href="/user/brazzerq">All this user&apos;s reviews</a>
                                    </li>
                                                                    </ul>
                            </div>
                            
                                                    </div>
                    </div></div></div></div>
                </li>
                                                                                    <li id="user_review_7326933" class="review user_review last_review">
                    <div class="review_btm review_btm_r"><div class="review_btm review_btm_l"><div class="review_top review_top_r"><div class="review_top review_top_l">
                        <div class="review_content">
                            <div class="review_section">
                                <div class="review_stats">
                                    <div class="review_critic">
                                        <div class="name">
                                                                                            <a href="/user/Joe126">Joe126</a>
                                                                                                                                </div>

                                                                                    <div class="date">May 27, 2017</div>
                                                                            </div>
                                    
                                    <div class="review_grade">
                                                
<div class="metascore_w user medium game positive indiv">8</div>

                                    </div>
                                </div>
                                <div class="review_body">
                                                        
                                        <span>Very nice game to play when you are bored and you need something to do, Story is slow to unfold and you have got too many jobs to do at one time, apart from that good game.</span>
            </div>
                            </div>
                                                        <div class="review_section review_actions ">
                                <ul class="review_actions">
                                                                            <li class="review_action review_helpful">
                                            <div class="review_helpful">
    <div class="rating_thumbs">
        			<div class="helpful_summary thumb_count">
				<a href="https://secure.metacritic.com/login">
				<span class="total_ups">0</span>
				of 
				<span class="total_thumbs">0</span>
				users found this helpful
                </a>
			</div>
                <div style="clear:both;"></div>
    </div>
</div>
                                        </li>
                                                                                                                                                <li class="review_action">
                                        <a href="/user/Joe126">All this user&apos;s reviews</a>
                                    </li>
                                                                    </ul>
                            </div>
                            
                                                    </div>
                    </div></div></div></div>
                </li>
                                            