
                                                            <li id="user_review_4814265" class="review user_review first_review">
                    <div class="review_btm review_btm_r"><div class="review_btm review_btm_l"><div class="review_top review_top_r"><div class="review_top review_top_l">
                        <div class="review_content">
                            <div class="review_section">
                                <div class="review_stats">
                                    <div class="review_critic">
                                        <div class="name">
                                                                                            <a href="/user/iamthewizard2">iamthewizard2</a>
                                                                                                                                </div>

                                                                                    <div class="date">Dec 13, 2014</div>
                                                                            </div>
                                    
                                    <div class="review_grade">
                                                
<div class="metascore_w user medium game mixed indiv">7</div>

                                    </div>
                                </div>
                                <div class="review_body">
                                                        
                                        <span class="inline_expand_collapse inline_collapsed" id="review_blurb_4814265"><span class="blurb blurb_collapsed">Playing the game solo is just too easy and too short (in fact its easier and shorter than guardians of light).  For a furthermore challenge and true enjoyment the game should technically be played with 2 or more players.  The use of gems to open up treasure chests is a nice new feature but the actual loot itself is just not varied or powerful enough to warrant replayability.  Further cons</span><span class="blurb blurb_expanded">Playing the game solo is just too easy and too short (in fact its easier and shorter than guardians of light).  For a furthermore challenge and true enjoyment the game should technically be played with 2 or more players.  The use of gems to open up treasure chests is a nice new feature but the actual loot itself is just not varied or powerful enough to warrant replayability.  Further cons including lack of 21:9 support, sometimes buggy, laggy and poor co-op connection. Overall, an enjoyable experience none the less but the game has so much potential which wasn&apos;t explored fully enough.</span><span class="blurb_etc">&#x2026;</span> <a rel="nofollow" class="toggle_expand_collapse toggle_expand" href="/game/pc/lara-croft-and-the-temple-of-osiris/user-reviews?user_review_id=4814265">Expand</a></span>
            </div>
                            </div>
                                                        <div class="review_section review_actions ">
                                <ul class="review_actions">
                                                                            <li class="review_action review_helpful">
                                            <div class="review_helpful">
    <div class="rating_thumbs">
        			<div class="helpful_summary thumb_count">
				<a href="https://secure.metacritic.com/login">
				<span class="total_ups">6</span>
				of 
				<span class="total_thumbs">7</span>
				users found this helpful
                </a>
			</div>
                <div style="clear:both;"></div>
    </div>
</div>
                                        </li>
                                                                                                                                                <li class="review_action">
                                        <a href="/user/iamthewizard2">All this user&apos;s reviews</a>
                                    </li>
                                                                    </ul>
                            </div>
                            
                                                    </div>
                    </div></div></div></div>
                </li>
                                                                                    <li id="user_review_4808505" class="review user_review">
                    <div class="review_btm review_btm_r"><div class="review_btm review_btm_l"><div class="review_top review_top_r"><div class="review_top review_top_l">
                        <div class="review_content">
                            <div class="review_section">
                                <div class="review_stats">
                                    <div class="review_critic">
                                        <div class="name">
                                                                                            <a href="/user/t0nytzu">t0nytzu</a>
                                                                                                                                </div>

                                                                                    <div class="date">Dec 11, 2014</div>
                                                                            </div>
                                    
                                    <div class="review_grade">
                                                
<div class="metascore_w user medium game positive indiv perfect">10</div>

                                    </div>
                                </div>
                                <div class="review_body">
                                                        
                                        <span class="inline_expand_collapse inline_collapsed" id="review_blurb_4808505"><span class="blurb blurb_collapsed">Just finished it and I must say that it&apos;s a pretty smart made game with lots of nice puzzles, weapons, upgrades and secrets. It had some issues with the performance (it really needs a lot) and the controls but once I got used to it everything was fine. Of course it has to have some degree of error since it&apos;s a challenging game and some things must be done after a few tries. It was rather</span><span class="blurb blurb_expanded">Just finished it and I must say that it&apos;s a pretty smart made game with lots of nice puzzles, weapons, upgrades and secrets. It had some issues with the performance (it really needs a lot) and the controls but once I got used to it everything was fine. Of course it has to have some degree of error since it&apos;s a challenging game and some things must be done after a few tries. It was rather easy, I managed to find all the Red Skulls and an overall great experience, especially with friends.</span><span class="blurb_etc">&#x2026;</span> <a rel="nofollow" class="toggle_expand_collapse toggle_expand" href="/game/pc/lara-croft-and-the-temple-of-osiris/user-reviews?user_review_id=4808505">Expand</a></span>
            </div>
                            </div>
                                                        <div class="review_section review_actions ">
                                <ul class="review_actions">
                                                                            <li class="review_action review_helpful">
                                            <div class="review_helpful">
    <div class="rating_thumbs">
        			<div class="helpful_summary thumb_count">
				<a href="https://secure.metacritic.com/login">
				<span class="total_ups">2</span>
				of 
				<span class="total_thumbs">9</span>
				users found this helpful
                </a>
			</div>
                <div style="clear:both;"></div>
    </div>
</div>
                                        </li>
                                                                                                                                                <li class="review_action">
                                        <a href="/user/t0nytzu">All this user&apos;s reviews</a>
                                    </li>
                                                                    </ul>
                            </div>
                            
                                                    </div>
                    </div></div></div></div>
                </li>
                                                                                    <li id="user_review_5684528" class="review user_review">
                    <div class="review_btm review_btm_r"><div class="review_btm review_btm_l"><div class="review_top review_top_r"><div class="review_top review_top_l">
                        <div class="review_content">
                            <div class="review_section">
                                <div class="review_stats">
                                    <div class="review_critic">
                                        <div class="name">
                                                                                            <a href="/user/tainanlctr">tainanlctr</a>
                                                                                                                                </div>

                                                                                    <div class="date">Nov 10, 2015</div>
                                                                            </div>
                                    
                                    <div class="review_grade">
                                                
<div class="metascore_w user medium game positive indiv">9</div>

                                    </div>
                                </div>
                                <div class="review_body">
                                                        
                                        <span class="inline_expand_collapse inline_collapsed" id="review_blurb_5684528"><span class="blurb blurb_collapsed">Antes de tudo mais preciso ser bem enf&#xE1;tico: este &#xE9; superior em todos os quesitos ao seu antecessor Lara Croft eo Guardi&#xE3;o da Luz, dito isso vamos aos detalhes...
<br>
<br>Gr&#xE1;ficos: Todas as areas s&#xE3;o muito bonitas com detalhes que comprovam o bom trabalho que fizeram mostrando a qualidade da pesquisa feita em torno do Egito. Elementos simples que somados voc&#xEA; observa como esta bem feito, uma</span><span class="blurb blurb_expanded">Antes de tudo mais preciso ser bem enf&#xE1;tico: este &#xE9; superior em todos os quesitos ao seu antecessor Lara Croft eo Guardi&#xE3;o da Luz, dito isso vamos aos detalhes...
<br>
<br>Gr&#xE1;ficos: Todas as areas s&#xE3;o muito bonitas com detalhes que comprovam o bom trabalho que fizeram mostrando a qualidade da pesquisa feita em torno do Egito. Elementos simples que somados voc&#xEA; observa como esta bem feito, uma parede que entre os hier&#xF3;glifos a partes destacadas em ouro sobressalentes, os vasos desenhados como se fossem pintados a m&#xE3;o, as pilastras milimetricamente rachadas no lugar exato... e ainda os elementos fisicos, a ilumina&#xE7;&#xE3;o, a sombra, como tudo tem uma cara muito real e particular dentro de cada um dos os climas; ensolarado, chuvoso, nevasca e entre o dia e a noite. Preciso dizer como eu estou surpreso positivamente como conseguiram fazer m&#xED;seros 3.2GB ter uma aparencia t&#xE3;o linda, fizeram um excelente trabalho de otimiza&#xE7;&#xE3;o
<br>Trilha sonora: &#xC9; maravilhosa, &#xE9; perfeitamente combinada com cada situa&#xE7;&#xE3;o e perfeitamente sincronizada. diferente do guardi&#xE3;o da Luz que fizeram um trabalho porco de s&#xF3; pegar os sons da trilogia TR Legend Anniversary e Underworld e joga de qualquer jeito, neste Templo de Osiris criaram uma trilha completamente nova e envolvente at&#xE9; quando o clima muda por exemplo a trilha de fundo quando se esta chovendo combinando com as gotas de caindo no ch&#xE3;o e os grunhidos dos jacar&#xE9;s pr&#xF3;ximos. Eu valorizo bons efeitos sonoros e nesse quesito dou nota 10.
<br>Jogabilidade: N&#xE3;o h&#xE1; muitas novidades em compara&#xE7;&#xE3;o ao Guardi&#xE3;o da Luz mas as poucas novidades que trouxeram junto com os j&#xE1; antigos ( e muitos ) comandos faz uma infinidade de puzzles muito divertidos.
<br>Enredo: &#xC9; aquele clich&#xEA; do antigo Egito, deus do mau deus do bem, maldi&#xE7;&#xF5;es, escaravelhos e bl&#xE1;bl&#xE1; mas a maneira que introduziram todos os de mais quesitos od jogo ( trilha, gr&#xE1;ficos, jogabilidade ) tora tudo muito interessante. Os puzzles realmente s&#xE3;o o foco e muito &#xE9; ca&#xF3;tico jogar em co-op quanto mais jogadores mais ca&#xF3;tico e + divers&#xE3;o e + tem que fazer trabalhar essa mat&#xE9;ria cinzenta hehehe. Por sinal cada combina&#xE7;&#xE3;o de 2 3 ou 4 jogadores foi muito bem trabalhada exatamente para que os puzzles e combates exigissem o m&#xE1;ximo da quantidade de jogadores para que todos trabalhem e existe uma depend&#xEA;ncia total eu diria ( logo se um for noob pode @#$%&amp;&#x2620; com todos kkkk ).
<br>
<br>Uma cosia nova que veio a calhar que j&#xE1; existe j&#xE1; a tempos em outros games, &#xE9; a din&#xE2;mica dos desafios da comunidade. Aumenta dura&#xE7;&#xE3;o do game e tamb&#xE9;m lhe tr&#xE1;s novidades al&#xE9;m do enredo que n&#xE3;o posso falar se n&#xE3;o darei spoiler
<br>A dura&#xE7;&#xE3;o do game enfim depende somente de voc&#xEA;, caso for s&#xF3; jogar o modo hist&#xF3;ria correndo de qualquer jeito termina super r&#xE1;pido mas se quiser 100% j&#xE1; vai ter uma dura&#xE7;&#xE3;o bem longa..... completar todoss os desafios, os time trials, as pontua&#xE7;&#xF5;es, fazer todoas as tumbas opcionais, os desafios de combate nos obeliscos, abrir todos os ba&#xFA;s para obter todas as armas, an&#xE9;is e amuletos comuns, incomuns raros e lend&#xE1;rios, pegar todos colecion&#xE1;veis ( caveiras e upgrades ).
<br>
<br>Enfim tirando alguns bugs grotescos que varias pessoas pelo mundo estam reclamando e que infelizmente &#xE9; normal hoje em dia em jogos rec&#xE9;m lan&#xE7;ados, o game tem todo um conjunto muito bem realizado e conectado. Botei f&#xE9;, criei bastante expectativa antes de lan&#xE7;ado e veio como o esperado: uns 80 85/100 com muito gosto.</span><span class="blurb_etc">&#x2026;</span> <a rel="nofollow" class="toggle_expand_collapse toggle_expand" href="/game/pc/lara-croft-and-the-temple-of-osiris/user-reviews?user_review_id=5684528">Expand</a></span>
            </div>
                            </div>
                                                        <div class="review_section review_actions ">
                                <ul class="review_actions">
                                                                            <li class="review_action review_helpful">
                                            <div class="review_helpful">
    <div class="rating_thumbs">
        			<div class="helpful_summary thumb_count">
				<a href="https://secure.metacritic.com/login">
				<span class="total_ups">0</span>
				of 
				<span class="total_thumbs">0</span>
				users found this helpful
                </a>
			</div>
                <div style="clear:both;"></div>
    </div>
</div>
                                        </li>
                                                                                                                                                <li class="review_action">
                                        <a href="/user/tainanlctr">All this user&apos;s reviews</a>
                                    </li>
                                                                    </ul>
                            </div>
                            
                                                    </div>
                    </div></div></div></div>
                </li>
                                                                                    <li id="user_review_6913430" class="review user_review">
                    <div class="review_btm review_btm_r"><div class="review_btm review_btm_l"><div class="review_top review_top_r"><div class="review_top review_top_l">
                        <div class="review_content">
                            <div class="review_section">
                                <div class="review_stats">
                                    <div class="review_critic">
                                        <div class="name">
                                                                                            <a href="/user/Toothpicker">Toothpicker</a>
                                                                                                                                </div>

                                                                                    <div class="date">Jan  3, 2017</div>
                                                                            </div>
                                    
                                    <div class="review_grade">
                                                
<div class="metascore_w user medium game mixed indiv">6</div>

                                    </div>
                                </div>
                                <div class="review_body">
                                                        
                                        <span>Loved the first one, wasn&apos;t too enamoured with this though.  Puzzles were easy, quite a lot of bugs and frustrating moments, the perspective of the camera is often an obstacle, not much variation throughout.  Generally too easy, and convoluted weapons upgrade/perk gem/chest system was unnecessary.  Wouldn&apos;t play a third instalment.</span>
            </div>
                            </div>
                                                        <div class="review_section review_actions ">
                                <ul class="review_actions">
                                                                            <li class="review_action review_helpful">
                                            <div class="review_helpful">
    <div class="rating_thumbs">
        			<div class="helpful_summary thumb_count">
				<a href="https://secure.metacritic.com/login">
				<span class="total_ups">0</span>
				of 
				<span class="total_thumbs">0</span>
				users found this helpful
                </a>
			</div>
                <div style="clear:both;"></div>
    </div>
</div>
                                        </li>
                                                                                                                                                <li class="review_action">
                                        <a href="/user/Toothpicker">All this user&apos;s reviews</a>
                                    </li>
                                                                    </ul>
                            </div>
                            
                                                    </div>
                    </div></div></div></div>
                </li>
                                                                                    <li id="user_review_5469074" class="review user_review">
                    <div class="review_btm review_btm_r"><div class="review_btm review_btm_l"><div class="review_top review_top_r"><div class="review_top review_top_l">
                        <div class="review_content">
                            <div class="review_section">
                                <div class="review_stats">
                                    <div class="review_critic">
                                        <div class="name">
                                                                                            <a href="/user/peterjson">peterjson</a>
                                                                                                                                </div>

                                                                                    <div class="date">Sep  8, 2015</div>
                                                                            </div>
                                    
                                    <div class="review_grade">
                                                
<div class="metascore_w user medium game negative indiv">1</div>

                                    </div>
                                </div>
                                <div class="review_body">
                                                        
                                        <span class="inline_expand_collapse inline_collapsed" id="review_blurb_5469074"><span class="blurb blurb_collapsed">After playing Guardian of Light, I expected a similar experience with co-op added. However, this game is barely playable on the game hardware. Even in single-player mode, it lags. Still I tried to do it and suffer through terrible frame rate, but the game is full of bugs and I just could not play it properly. I really don&apos;t understand how developers could&apos;ve done this, when they have the</span><span class="blurb blurb_expanded">After playing Guardian of Light, I expected a similar experience with co-op added. However, this game is barely playable on the game hardware. Even in single-player mode, it lags. Still I tried to do it and suffer through terrible frame rate, but the game is full of bugs and I just could not play it properly. I really don&apos;t understand how developers could&apos;ve done this, when they have the engine that works well. Obviously, it was a rushed release looking to capitalize on popularity of Guardian of Light.
<br>
<br>If you haven&apos;t played Guardian of Light, get that one instead.</span><span class="blurb_etc">&#x2026;</span> <a rel="nofollow" class="toggle_expand_collapse toggle_expand" href="/game/pc/lara-croft-and-the-temple-of-osiris/user-reviews?user_review_id=5469074">Expand</a></span>
            </div>
                            </div>
                                                        <div class="review_section review_actions ">
                                <ul class="review_actions">
                                                                            <li class="review_action review_helpful">
                                            <div class="review_helpful">
    <div class="rating_thumbs">
        			<div class="helpful_summary thumb_count">
				<a href="https://secure.metacritic.com/login">
				<span class="total_ups">0</span>
				of 
				<span class="total_thumbs">0</span>
				users found this helpful
                </a>
			</div>
                <div style="clear:both;"></div>
    </div>
</div>
                                        </li>
                                                                                                                                                <li class="review_action">
                                        <a href="/user/peterjson">All this user&apos;s reviews</a>
                                    </li>
                                                                    </ul>
                            </div>
                            
                                                    </div>
                    </div></div></div></div>
                </li>
                                                                                    <li id="user_review_7279250" class="review user_review last_review">
                    <div class="review_btm review_btm_r"><div class="review_btm review_btm_l"><div class="review_top review_top_r"><div class="review_top review_top_l">
                        <div class="review_content">
                            <div class="review_section">
                                <div class="review_stats">
                                    <div class="review_critic">
                                        <div class="name">
                                                                                            <a href="/user/lhmtgame">lhmtgame</a>
                                                                                                                                </div>

                                                                                    <div class="date">May  5, 2017</div>
                                                                            </div>
                                    
                                    <div class="review_grade">
                                                
<div class="metascore_w user medium game mixed indiv">5</div>

                                    </div>
                                </div>
                                <div class="review_body">
                                                        
                                        <span>The game&apos;s graphics is good! Lara looks cute and sexy! But the game&apos;s story is bad!
<br>The story is too short, Lara&apos;s gears are too many but almost useless. No replay option as LC &amp; Guardians of Light.
<br>The same as Hitman, SquareEnix would&apos;ve not made a good LC series since Eidos has no longer developed it.</span>
            </div>
                            </div>
                                                        <div class="review_section review_actions ">
                                <ul class="review_actions">
                                                                            <li class="review_action review_helpful">
                                            <div class="review_helpful">
    <div class="rating_thumbs">
        			<div class="helpful_summary thumb_count">
				<a href="https://secure.metacritic.com/login">
				<span class="total_ups">0</span>
				of 
				<span class="total_thumbs">0</span>
				users found this helpful
                </a>
			</div>
                <div style="clear:both;"></div>
    </div>
</div>
                                        </li>
                                                                                                                                                <li class="review_action">
                                        <a href="/user/lhmtgame">All this user&apos;s reviews</a>
                                    </li>
                                                                    </ul>
                            </div>
                            
                                                    </div>
                    </div></div></div></div>
                </li>
                                            