
                                                            <li id="user_review_7464276" class="review user_review first_review">
                    <div class="review_btm review_btm_r"><div class="review_btm review_btm_l"><div class="review_top review_top_r"><div class="review_top review_top_l">
                        <div class="review_content">
                            <div class="review_section">
                                <div class="review_stats">
                                    <div class="review_critic">
                                        <div class="name">
                                                                                            <a href="/user/WereSuricat">WereSuricat</a>
                                                                                                                                </div>

                                                                                    <div class="date">Aug 12, 2017</div>
                                                                            </div>
                                    
                                    <div class="review_grade">
                                                
<div class="metascore_w user medium game positive indiv perfect">10</div>

                                    </div>
                                </div>
                                <div class="review_body">
                                                        
                                        <span>Really good game. Good graphic, 21 single missions, 7 on each side : allied, german and soviet. And a skirmish mode. ++ Multiplayer good but not enough maps maybe. For the little price (37.50$ cad) its a really good choice</span>
            </div>
                            </div>
                                                        <div class="review_section review_actions ">
                                <ul class="review_actions">
                                                                            <li class="review_action review_helpful">
                                            <div class="review_helpful">
    <div class="rating_thumbs">
        			<div class="helpful_summary thumb_count">
				<a href="https://secure.metacritic.com/login">
				<span class="total_ups">8</span>
				of 
				<span class="total_thumbs">11</span>
				users found this helpful
                </a>
			</div>
                <div style="clear:both;"></div>
    </div>
</div>
                                        </li>
                                                                                                                                                <li class="review_action">
                                        <a href="/user/WereSuricat">All this user&apos;s reviews</a>
                                    </li>
                                                                    </ul>
                            </div>
                            
                                                    </div>
                    </div></div></div></div>
                </li>
                                                                                    <li id="user_review_7468033" class="review user_review">
                    <div class="review_btm review_btm_r"><div class="review_btm review_btm_l"><div class="review_top review_top_r"><div class="review_top review_top_l">
                        <div class="review_content">
                            <div class="review_section">
                                <div class="review_stats">
                                    <div class="review_critic">
                                        <div class="name">
                                                                                            <a href="/user/SMIICE">SMIICE</a>
                                                                                                                                </div>

                                                                                    <div class="date">Aug 15, 2017</div>
                                                                            </div>
                                    
                                    <div class="review_grade">
                                                
<div class="metascore_w user medium game positive indiv perfect">10</div>

                                    </div>
                                </div>
                                <div class="review_body">
                                                        
                                        <span class="inline_expand_collapse inline_collapsed" id="review_blurb_7468033"><span class="blurb blurb_collapsed">Amazing gaming experience. Love new engine. The new team captured the fantastic atmosphere of first two games. Must buy, I would not play it with a controller on PC or PS4 but on it is a gem. Who ever says that it lacks real time game play - their ton of game with real time gameplay. Sudden Strike 4 is a tactical game, and I hope developers keep it that way. I will buy every expansion and</span><span class="blurb blurb_expanded">Amazing gaming experience. Love new engine. The new team captured the fantastic atmosphere of first two games. Must buy, I would not play it with a controller on PC or PS4 but on it is a gem. Who ever says that it lacks real time game play - their ton of game with real time gameplay. Sudden Strike 4 is a tactical game, and I hope developers keep it that way. I will buy every expansion and every DLC for this game. Thank you for making it. I purchased it on GOG. Must buy for sure for any tactical WW2 fan, people who like Halo Wars should skip that one.</span><span class="blurb_etc">&#x2026;</span> <a rel="nofollow" class="toggle_expand_collapse toggle_expand" href="/game/pc/sudden-strike-4/user-reviews?user_review_id=7468033">Expand</a></span>
            </div>
                            </div>
                                                        <div class="review_section review_actions ">
                                <ul class="review_actions">
                                                                            <li class="review_action review_helpful">
                                            <div class="review_helpful">
    <div class="rating_thumbs">
        			<div class="helpful_summary thumb_count">
				<a href="https://secure.metacritic.com/login">
				<span class="total_ups">7</span>
				of 
				<span class="total_thumbs">10</span>
				users found this helpful
                </a>
			</div>
                <div style="clear:both;"></div>
    </div>
</div>
                                        </li>
                                                                                                                                                <li class="review_action">
                                        <a href="/user/SMIICE">All this user&apos;s reviews</a>
                                    </li>
                                                                    </ul>
                            </div>
                            
                                                    </div>
                    </div></div></div></div>
                </li>
                                                                                    <li id="user_review_7474205" class="review user_review">
                    <div class="review_btm review_btm_r"><div class="review_btm review_btm_l"><div class="review_top review_top_r"><div class="review_top review_top_l">
                        <div class="review_content">
                            <div class="review_section">
                                <div class="review_stats">
                                    <div class="review_critic">
                                        <div class="name">
                                                                                            <a href="/user/BigBossManXXXX">BigBossManXXXX</a>
                                                                                                                                </div>

                                                                                    <div class="date">Aug 22, 2017</div>
                                                                            </div>
                                    
                                    <div class="review_grade">
                                                
<div class="metascore_w user medium game mixed indiv">7</div>

                                    </div>
                                </div>
                                <div class="review_body">
                                                        
                                        <span class="inline_expand_collapse inline_collapsed" id="review_blurb_7474205"><span class="blurb blurb_collapsed">Whilst not the best of the series, it&apos;s still a huge improvement over the last (sudden strike 3).
<br>The graphics are beautiful (although the zooming is rather limited) and the effects are good too.
<br>The sound and music are very well implemented into the game and work quite nicely together.
(the voice acting could have been more realistic tbh, but that is just my opinion)
The campaigns (3</span><span class="blurb blurb_expanded">Whilst not the best of the series, it&apos;s still a huge improvement over the last (sudden strike 3).
<br>The graphics are beautiful (although the zooming is rather limited) and the effects are good too.
<br>The sound and music are very well implemented into the game and work quite nicely together.
<br>(the voice acting could have been more realistic tbh, but that is just my opinion)
<br>The campaigns (3 in total) are good fun, although not that difficult or super interesting within Sudden Strike 4 to be honest and i feel that they could have done better although it still is fun to play.
<br>The Skirmish aspect is very limited and unbalance at this time which is a shame really because i personally love playing skirmishes against a good balanced AI. (there are also too few missions available impo)
<br>The overall AI is not too bright either in the single player campaigns which also limits my personal joy and amusement by quite a bit (until patched/improved)..
<br>The multiplayer aspect is currently the worst factor by far, but given the fact that the devs clearly have stated it&apos;s not their main concern, i will allow them some time to look it over and reconsider if they would fix/improve it with the upcoming patches and dlcs..
<br>The use of a controller would have been great if the bugs would have been fixed by the time of my writing, but sadly it&apos;s still work in progress.. I think they might have been better of sticking to mouse and keyboard, but it should work for me when it&apos;s optimized at least..
<br>Overall an enjoying game with nice graphics, sounds and plenty of missions.
<br>The price is debatable and i would say buy it, try it or refund it if you need to.
<br>One more thing, i&apos;ll also advice to consider getting it with a discount or sales because 50$ on Steam is a bit too much in my personal opinion.
<br>I&apos;m rating it a solid 75/100.</span><span class="blurb_etc">&#x2026;</span> <a rel="nofollow" class="toggle_expand_collapse toggle_expand" href="/game/pc/sudden-strike-4/user-reviews?user_review_id=7474205">Expand</a></span>
            </div>
                            </div>
                                                        <div class="review_section review_actions ">
                                <ul class="review_actions">
                                                                            <li class="review_action review_helpful">
                                            <div class="review_helpful">
    <div class="rating_thumbs">
        			<div class="helpful_summary thumb_count">
				<a href="https://secure.metacritic.com/login">
				<span class="total_ups">2</span>
				of 
				<span class="total_thumbs">4</span>
				users found this helpful
                </a>
			</div>
                <div style="clear:both;"></div>
    </div>
</div>
                                        </li>
                                                                                                                                                <li class="review_action">
                                        <a href="/user/BigBossManXXXX">All this user&apos;s reviews</a>
                                    </li>
                                                                    </ul>
                            </div>
                            
                                                    </div>
                    </div></div></div></div>
                </li>
                                                                                    <li id="user_review_7472173" class="review user_review">
                    <div class="review_btm review_btm_r"><div class="review_btm review_btm_l"><div class="review_top review_top_r"><div class="review_top review_top_l">
                        <div class="review_content">
                            <div class="review_section">
                                <div class="review_stats">
                                    <div class="review_critic">
                                        <div class="name">
                                                                                            <a href="/user/Libertalia">Libertalia</a>
                                                                                                                                </div>

                                                                                    <div class="date">Aug 18, 2017</div>
                                                                            </div>
                                    
                                    <div class="review_grade">
                                                
<div class="metascore_w user medium game mixed indiv">5</div>

                                    </div>
                                </div>
                                <div class="review_body">
                                                        
                                        <span class="inline_expand_collapse inline_collapsed" id="review_blurb_7472173"><span class="blurb blurb_collapsed">&#x41A; &#x441;&#x43E;&#x436;&#x430;&#x43B;&#x435;&#x43D;&#x438;&#x44E;, &#x434;&#x43E;&#x43B;&#x433;&#x438;&#x435; &#x43E;&#x436;&#x438;&#x434;&#x430;&#x43D;&#x438;&#x44F; &#x43F;&#x440;&#x43E;&#x434;&#x43E;&#x43B;&#x436;&#x435;&#x43D;&#x438;&#x44F; &#x43D;&#x435;&#x43A;&#x43E;&#x433;&#x434;&#x430; &#x437;&#x43D;&#x430;&#x43C;&#x435;&#x43D;&#x438;&#x442;&#x43E;&#x439; &#x441;&#x435;&#x440;&#x438;&#x438; &#x441;&#x442;&#x440;&#x430;&#x442;&#x435;&#x433;&#x438;&#x439;, &#x43E;&#x431;&#x435;&#x440;&#x43D;&#x443;&#x43B;&#x438;&#x441;&#x44C; &#x43F;&#x440;&#x43E;&#x432;&#x430;&#x43B;&#x43E;&#x43C;. &#x418;&#x433;&#x440;&#x430; &#x438;&#x43C;&#x435;&#x435;&#x442; &#x43E;&#x447;&#x435;&#x43D;&#x44C; &#x43C;&#x430;&#x43B;&#x43E; &#x43A;&#x43E;&#x43D;&#x442;&#x435;&#x43D;&#x442;&#x430;, &#x432;&#x441;&#x435;&#x433;&#x43E; 21 &#x43C;&#x438;&#x441;&#x441;&#x438;&#x44F;, &#x431;&#x43E;&#x43B;&#x44C;&#x448;&#x430;&#x44F; &#x447;&#x430;&#x441;&#x442;&#x44C; &#x43A;&#x43E;&#x442;&#x43E;&#x440;&#x44B;&#x445; &#x441;&#x434;&#x435;&#x43B;&#x430;&#x43D;&#x44B; &#x43E;&#x447;&#x435;&#x43D;&#x44C; &#x445;&#x430;&#x43B;&#x442;&#x443;&#x440;&#x43D;&#x43E; &#x438; &#x43F;&#x440;&#x43E;&#x445;&#x43E;&#x434;&#x44F;&#x442;&#x441;&#x44F; &#x437;&#x430; 10-15 &#x43C;&#x438;&#x43D;&#x443;&#x442;. &#x423;&#x43F;&#x440;&#x430;&#x432;&#x43B;&#x435;&#x43D;&#x438;&#x435; &#x44E;&#x43D;&#x438;&#x442;&#x43E;&#x432; &#x438;&#x43C;&#x435;&#x435;&#x442; &#x43E;&#x447;&#x435;&#x43D;&#x44C; &#x441;&#x43F;&#x43E;&#x440;&#x43D;&#x44B;&#x435; &#x43E;&#x441;&#x43D;&#x43E;&#x432;&#x44B;, &#x43F;&#x43E;&#x440;&#x43E;&#x439; &#x43E;&#x43D;&#x438; &#x432;&#x430;&#x441; &#x43F;&#x440;&#x43E;&#x441;&#x442;&#x43E; &#x43D;&#x435; &#x441;&#x43B;&#x443;&#x448;&#x430;&#x44E;&#x442;&#x441;&#x44F; &#x438; &#x43D;&#x435; &#x445;&#x43E;&#x442;&#x44F;&#x442; &#x434;&#x435;&#x43B;&#x430;&#x442;&#x44C; &#x442;&#x43E;, &#x447;&#x442;&#x43E; &#x432;&#x44B; &#x445;&#x43E;&#x442;&#x438;&#x442;&#x435;. &#x41C;&#x443;&#x43B;&#x44C;&#x442;&#x438;&#x43F;&#x43B;&#x435;&#x435;&#x440; &#x436;&#x435; &#x438; &#x432;&#x43E;&#x432;&#x441;&#x435; &#x431;&#x44B;&#x43B; &#x437;&#x430;&#x431;&#x44B;&#x442; &#x440;&#x430;&#x437;&#x440;&#x430;&#x431;&#x43E;&#x442;&#x447;&#x438;&#x43A;&#x430;&#x43C;&#x438;,</span><span class="blurb blurb_expanded">&#x41A; &#x441;&#x43E;&#x436;&#x430;&#x43B;&#x435;&#x43D;&#x438;&#x44E;, &#x434;&#x43E;&#x43B;&#x433;&#x438;&#x435; &#x43E;&#x436;&#x438;&#x434;&#x430;&#x43D;&#x438;&#x44F; &#x43F;&#x440;&#x43E;&#x434;&#x43E;&#x43B;&#x436;&#x435;&#x43D;&#x438;&#x44F; &#x43D;&#x435;&#x43A;&#x43E;&#x433;&#x434;&#x430; &#x437;&#x43D;&#x430;&#x43C;&#x435;&#x43D;&#x438;&#x442;&#x43E;&#x439; &#x441;&#x435;&#x440;&#x438;&#x438; &#x441;&#x442;&#x440;&#x430;&#x442;&#x435;&#x433;&#x438;&#x439;, &#x43E;&#x431;&#x435;&#x440;&#x43D;&#x443;&#x43B;&#x438;&#x441;&#x44C; &#x43F;&#x440;&#x43E;&#x432;&#x430;&#x43B;&#x43E;&#x43C;. &#x418;&#x433;&#x440;&#x430; &#x438;&#x43C;&#x435;&#x435;&#x442; &#x43E;&#x447;&#x435;&#x43D;&#x44C; &#x43C;&#x430;&#x43B;&#x43E; &#x43A;&#x43E;&#x43D;&#x442;&#x435;&#x43D;&#x442;&#x430;, &#x432;&#x441;&#x435;&#x433;&#x43E; 21 &#x43C;&#x438;&#x441;&#x441;&#x438;&#x44F;, &#x431;&#x43E;&#x43B;&#x44C;&#x448;&#x430;&#x44F; &#x447;&#x430;&#x441;&#x442;&#x44C; &#x43A;&#x43E;&#x442;&#x43E;&#x440;&#x44B;&#x445; &#x441;&#x434;&#x435;&#x43B;&#x430;&#x43D;&#x44B; &#x43E;&#x447;&#x435;&#x43D;&#x44C; &#x445;&#x430;&#x43B;&#x442;&#x443;&#x440;&#x43D;&#x43E; &#x438; &#x43F;&#x440;&#x43E;&#x445;&#x43E;&#x434;&#x44F;&#x442;&#x441;&#x44F; &#x437;&#x430; 10-15 &#x43C;&#x438;&#x43D;&#x443;&#x442;. &#x423;&#x43F;&#x440;&#x430;&#x432;&#x43B;&#x435;&#x43D;&#x438;&#x435; &#x44E;&#x43D;&#x438;&#x442;&#x43E;&#x432; &#x438;&#x43C;&#x435;&#x435;&#x442; &#x43E;&#x447;&#x435;&#x43D;&#x44C; &#x441;&#x43F;&#x43E;&#x440;&#x43D;&#x44B;&#x435; &#x43E;&#x441;&#x43D;&#x43E;&#x432;&#x44B;, &#x43F;&#x43E;&#x440;&#x43E;&#x439; &#x43E;&#x43D;&#x438; &#x432;&#x430;&#x441; &#x43F;&#x440;&#x43E;&#x441;&#x442;&#x43E; &#x43D;&#x435; &#x441;&#x43B;&#x443;&#x448;&#x430;&#x44E;&#x442;&#x441;&#x44F; &#x438; &#x43D;&#x435; &#x445;&#x43E;&#x442;&#x44F;&#x442; &#x434;&#x435;&#x43B;&#x430;&#x442;&#x44C; &#x442;&#x43E;, &#x447;&#x442;&#x43E; &#x432;&#x44B; &#x445;&#x43E;&#x442;&#x438;&#x442;&#x435;. &#x41C;&#x443;&#x43B;&#x44C;&#x442;&#x438;&#x43F;&#x43B;&#x435;&#x435;&#x440; &#x436;&#x435; &#x438; &#x432;&#x43E;&#x432;&#x441;&#x435; &#x431;&#x44B;&#x43B; &#x437;&#x430;&#x431;&#x44B;&#x442; &#x440;&#x430;&#x437;&#x440;&#x430;&#x431;&#x43E;&#x442;&#x447;&#x438;&#x43A;&#x430;&#x43C;&#x438;, &#x442;&#x430;&#x43A;-&#x43A;&#x430;&#x43A; &#x442;&#x430;&#x43C; &#x432;&#x441;&#x435;&#x433;&#x43E; 4 &#x43D;&#x435; &#x43E;&#x441;&#x43E;&#x431;&#x43E; &#x438;&#x43D;&#x442;&#x435;&#x440;&#x435;&#x441;&#x43D;&#x44B;&#x445; &#x43A;&#x430;&#x440;&#x442;&#x44B;, &#x43A;&#x43E;&#x442;&#x43E;&#x440;&#x44B;&#x435; &#x434;&#x435;&#x43B;&#x430;&#x43B; &#x44F;&#x432;&#x43D;&#x43E; &#x447;&#x435;&#x43B;&#x43E;&#x432;&#x435;&#x43A;, &#x43D;&#x435; &#x43E;&#x441;&#x43E;&#x431;&#x43E; &#x43F;&#x430;&#x440;&#x438;&#x432;&#x448;&#x438;&#x439;&#x441;&#x44F; &#x43D;&#x430;&#x434; &#x441;&#x432;&#x43E;&#x435;&#x439; &#x440;&#x430;&#x431;&#x43E;&#x442;&#x43E;&#x439;. &#x410; &#x443;&#x436; &#x433;&#x435;&#x439;&#x43C;&#x43F;&#x43B;&#x435;&#x439; &#x442;&#x430;&#x43C; &#x438; &#x432;&#x43E;&#x432;&#x441;&#x435; &#x432;&#x44B;&#x437;&#x44B;&#x432;&#x430;&#x435;&#x442; &#x443;&#x43D;&#x44B;&#x43D;&#x438;&#x435;, &#x432;&#x44B; &#x437;&#x430;&#x445;&#x432;&#x430;&#x442;&#x44B;&#x432;&#x430;&#x439;&#x442;&#x435; &#x442;&#x43E;&#x447;&#x43A;&#x443; &#x438; &#x43D;&#x430;&#x447;&#x438;&#x43D;&#x430;&#x435;&#x442;&#x435; &#x43A;&#x43B;&#x435;&#x43F;&#x430;&#x442;&#x44C; &#x442;&#x430;&#x43D;&#x43A;&#x438;, &#x447;&#x442;&#x43E; &#x435;&#x441;&#x442;&#x44C; &#x441;&#x438;&#x43B;&#x44B;. &#x421;&#x438;&#x441;&#x442;&#x435;&#x43C;&#x430; &#x433;&#x435;&#x43D;&#x435;&#x440;&#x430;&#x43B;&#x43E;&#x432; &#x43F;&#x440;&#x435;&#x434;&#x441;&#x442;&#x430;&#x432;&#x43B;&#x44F;&#x435;&#x442; &#x438;&#x437; &#x441;&#x435;&#x431;&#x44F; 3-&#x445; &#x433;&#x435;&#x43D;&#x435;&#x440;&#x430;&#x43B;&#x43E;&#x432; - &#x43F;&#x435;&#x445;&#x43E;&#x442;&#x44B;, &#x442;&#x430;&#x43D;&#x43A;&#x43E;&#x432; &#x438; &#x430;&#x440;&#x442;&#x438;&#x43B;&#x43B;&#x435;&#x440;&#x438;&#x438;, &#x43A;&#x43E;&#x442;&#x43E;&#x440;&#x44B;&#x435; &#x43E;&#x434;&#x438;&#x43D;&#x430;&#x43A;&#x43E;&#x432;&#x44B; &#x443; &#x43A;&#x430;&#x436;&#x434;&#x43E;&#x439; &#x441;&#x442;&#x43E;&#x440;&#x43E;&#x43D;&#x44B; &#x438; &#x43F;&#x440;&#x438; &#x438;&#x445; &#x43F;&#x440;&#x43E;&#x43A;&#x430;&#x447;&#x43A;&#x435; &#x43F;&#x43E; &#x445;&#x43E;&#x434;&#x443; &#x43F;&#x440;&#x43E;&#x445;&#x43E;&#x436;&#x434;&#x435;&#x43D;&#x438;&#x44F; &#x43A;&#x43E;&#x43C;&#x43F;&#x430;&#x43D;&#x438;&#x438;, &#x43E;&#x43D;&#x438; &#x43F;&#x43E;&#x437;&#x432;&#x43E;&#x43B;&#x44F;&#x44E;&#x442; &#x432;&#x430;&#x43C; &#x447;&#x443;&#x442;&#x43E;&#x43A; &#x43F;&#x43E;&#x432;&#x44B;&#x441;&#x438;&#x442;&#x44C; &#x442;&#x442;&#x445; &#x432;&#x430;&#x448;&#x438;&#x445; &#x44E;&#x43D;&#x438;&#x442;&#x43E;&#x432;. &#x415;&#x434;&#x438;&#x43D;&#x441;&#x442;&#x432;&#x435;&#x43D;&#x43D;&#x43E;&#x435;, &#x447;&#x442;&#x43E; &#x43F;&#x440;&#x438;&#x432;&#x43B;&#x435;&#x43A;&#x430;&#x435;&#x442; &#x432; &#x44D;&#x442;&#x43E;&#x439; &#x438;&#x433;&#x440;&#x435; - &#x435;&#x451; &#x430;&#x440;&#x442; &#x434;&#x438;&#x437;&#x430;&#x439;&#x43D;, &#x43D;&#x43E; &#x43A; &#x441;&#x43E;&#x436;&#x430;&#x43B;&#x435;&#x43D;&#x438;&#x44E;, &#x432;&#x43E;&#x435;&#x43D;&#x43D;&#x430;&#x44F; &#x441;&#x442;&#x440;&#x430;&#x442;&#x435;&#x433;&#x438;&#x44F;, &#x432; &#x43A;&#x43E;&#x442;&#x43E;&#x440;&#x43E;&#x439; &#x435;&#x434;&#x438;&#x43D;&#x441;&#x442;&#x432;&#x435;&#x43D;&#x43D;&#x44B;&#x43C; &#x43F;&#x43B;&#x44E;&#x441;&#x43E;&#x43C; &#x44F;&#x432;&#x43B;&#x44F;&#x435;&#x442;&#x441;&#x44F; &#x433;&#x440;&#x430;&#x444;&#x438;&#x43A;&#x430;, &#x43D;&#x435; &#x43C;&#x43E;&#x436;&#x435;&#x442; &#x431;&#x44B;&#x442;&#x44C; &#x445;&#x43E;&#x440;&#x43E;&#x448;&#x435;&#x439;. &#x420;&#x430;&#x437;&#x443;&#x43C;&#x435;&#x435;&#x442;&#x441;&#x44F; &#x440;&#x430;&#x437;&#x440;&#x430;&#x431;&#x43E;&#x442;&#x447;&#x438;&#x43A;&#x438; &#x432;&#x44B;&#x43F;&#x443;&#x441;&#x442;&#x438;&#x43B;&#x438; &#x440;&#x435;&#x434;&#x430;&#x43A;&#x442;&#x43E;&#x440;, &#x43A;&#x430;&#x43A; &#x43E;&#x442;&#x434;&#x435;&#x43B;&#x44C;&#x43D;&#x43E;&#x435; &#x43F;&#x440;&#x438;&#x43B;&#x43E;&#x436;&#x435;&#x43D;&#x438;&#x435;, &#x43D;&#x43E; &#x437;&#x43D;&#x430;&#x435;&#x442;&#x435; &#x43B;&#x438;, &#x434;&#x43E;&#x441;&#x442;&#x43E;&#x439;&#x43D;&#x430; &#x43B;&#x438; &#x43F;&#x43E;&#x43A;&#x443;&#x43F;&#x43A;&#x438; &#x438;&#x433;&#x440;&#x430;, &#x432; &#x43A;&#x43E;&#x442;&#x43E;&#x440;&#x43E;&#x439; &#x441;&#x442;&#x43E;&#x440;&#x43E;&#x43D;&#x43D;&#x438;&#x43C; &#x43B;&#x44E;&#x434;&#x44F;&#x43C; &#x43F;&#x440;&#x438;&#x434;&#x435;&#x442;&#x441;&#x44F; &#x434;&#x43E;&#x434;&#x435;&#x43B;&#x44B;&#x432;&#x430;&#x442;&#x44C; &#x440;&#x430;&#x431;&#x43E;&#x442;&#x443; &#x437;&#x430; &#x440;&#x430;&#x437;&#x440;&#x430;&#x431;&#x43E;&#x442;&#x447;&#x438;&#x43A;&#x43E;&#x432;? &#x42F; &#x434;&#x443;&#x43C;&#x430;&#x44E; &#x43E;&#x442;&#x432;&#x435;&#x442; &#x43E;&#x447;&#x435;&#x432;&#x438;&#x434;&#x435;&#x43D;....</span><span class="blurb_etc">&#x2026;</span> <a rel="nofollow" class="toggle_expand_collapse toggle_expand" href="/game/pc/sudden-strike-4/user-reviews?user_review_id=7472173">Expand</a></span>
            </div>
                            </div>
                                                        <div class="review_section review_actions ">
                                <ul class="review_actions">
                                                                            <li class="review_action review_helpful">
                                            <div class="review_helpful">
    <div class="rating_thumbs">
        			<div class="helpful_summary thumb_count">
				<a href="https://secure.metacritic.com/login">
				<span class="total_ups">2</span>
				of 
				<span class="total_thumbs">6</span>
				users found this helpful
                </a>
			</div>
                <div style="clear:both;"></div>
    </div>
</div>
                                        </li>
                                                                                                                                                <li class="review_action">
                                        <a href="/user/Libertalia">All this user&apos;s reviews</a>
                                    </li>
                                                                    </ul>
                            </div>
                            
                                                    </div>
                    </div></div></div></div>
                </li>
                                                                                    <li id="user_review_7463589" class="review user_review">
                    <div class="review_btm review_btm_r"><div class="review_btm review_btm_l"><div class="review_top review_top_r"><div class="review_top review_top_l">
                        <div class="review_content">
                            <div class="review_section">
                                <div class="review_stats">
                                    <div class="review_critic">
                                        <div class="name">
                                                                                            <a href="/user/Figaro79">Figaro79</a>
                                                                                                                                </div>

                                                                                    <div class="date">Aug 12, 2017</div>
                                                                            </div>
                                    
                                    <div class="review_grade">
                                                
<div class="metascore_w user medium game positive indiv">9</div>

                                    </div>
                                </div>
                                <div class="review_body">
                                                        
                                        <span>&#x413;&#x43B;&#x443;&#x431;&#x43E;&#x43A;&#x438;&#x439; &#x442;&#x430;&#x43A;&#x442;&#x438;&#x447;&#x435;&#x441;&#x43A;&#x438;&#x439; &#x433;&#x435;&#x439;&#x43C;&#x43F;&#x43B;&#x435;&#x439;, &#x43E;&#x442;&#x43B;&#x438;&#x447;&#x43D;&#x43E; &#x441;&#x43F;&#x43B;&#x430;&#x43D;&#x438;&#x440;&#x43E;&#x432;&#x430;&#x43D;&#x43D;&#x44B;&#x435; &#x43C;&#x438;&#x441;&#x441;&#x438;&#x438;, &#x43F;&#x440;&#x438;&#x44F;&#x442;&#x43D;&#x430;&#x44F; &#x43A;&#x430;&#x440;&#x442;&#x438;&#x43D;&#x43A;&#x430;, &#x445;&#x43E;&#x440;&#x43E;&#x448;&#x438;&#x439; &#x437;&#x432;&#x443;&#x43A; &#x438; &#x43E;&#x437;&#x432;&#x443;&#x447;&#x43A;&#x430; &#x434;&#x435;&#x43B;&#x430;&#x44E;&#x442; Sudden Strike 4 &#x43B;&#x443;&#x447;&#x448;&#x435;&#x439; RTS &#x43F;&#x43E;&#x441;&#x43B;&#x435;&#x434;&#x43D;&#x438;&#x445; &#x43B;&#x435;&#x442;.
<br>Dawn of War III &#x438; &#x411;&#x43B;&#x438;&#x446;&#x43A;&#x440;&#x438;&#x433; 3 &#x43F;&#x43E;&#x437;&#x43E;&#x440;&#x43D;&#x44B;&#x435; &#x43F;&#x43E;&#x434;&#x435;&#x43B;&#x43A;&#x438; &#x43D;&#x430; &#x444;&#x43E;&#x43D;&#x435; SS4.</span>
            </div>
                            </div>
                                                        <div class="review_section review_actions ">
                                <ul class="review_actions">
                                                                            <li class="review_action review_helpful">
                                            <div class="review_helpful">
    <div class="rating_thumbs">
        			<div class="helpful_summary thumb_count">
				<a href="https://secure.metacritic.com/login">
				<span class="total_ups">2</span>
				of 
				<span class="total_thumbs">7</span>
				users found this helpful
                </a>
			</div>
                <div style="clear:both;"></div>
    </div>
</div>
                                        </li>
                                                                                                                                                <li class="review_action">
                                        <a href="/user/Figaro79">All this user&apos;s reviews</a>
                                    </li>
                                                                    </ul>
                            </div>
                            
                                                    </div>
                    </div></div></div></div>
                </li>
                                                                                    <li id="user_review_7474256" class="review user_review">
                    <div class="review_btm review_btm_r"><div class="review_btm review_btm_l"><div class="review_top review_top_r"><div class="review_top review_top_l">
                        <div class="review_content">
                            <div class="review_section">
                                <div class="review_stats">
                                    <div class="review_critic">
                                        <div class="name">
                                                                                            <a href="/user/okitapci">okitapci</a>
                                                                                                                                </div>

                                                                                    <div class="date">Aug 20, 2017</div>
                                                                            </div>
                                    
                                    <div class="review_grade">
                                                
<div class="metascore_w user medium game negative indiv">4</div>

                                    </div>
                                </div>
                                <div class="review_body">
                                                        
                                        <span>It&apos;s a shadow of its former self. The SS 3 and 4 are a shame to the title. It&apos;s like it was simplified beyond playable, the campaign is short, you can micromanage units like you did before, you are asked to select everything and throw them on top of the enemy thats it.</span>
            </div>
                            </div>
                                                        <div class="review_section review_actions ">
                                <ul class="review_actions">
                                                                            <li class="review_action review_helpful">
                                            <div class="review_helpful">
    <div class="rating_thumbs">
        			<div class="helpful_summary thumb_count">
				<a href="https://secure.metacritic.com/login">
				<span class="total_ups">1</span>
				of 
				<span class="total_thumbs">6</span>
				users found this helpful
                </a>
			</div>
                <div style="clear:both;"></div>
    </div>
</div>
                                        </li>
                                                                                                                                                <li class="review_action">
                                        <a href="/user/okitapci">All this user&apos;s reviews</a>
                                    </li>
                                                                    </ul>
                            </div>
                            
                                                    </div>
                    </div></div></div></div>
                </li>
                                                                                    <li id="user_review_7625260" class="review user_review last_review">
                    <div class="review_btm review_btm_r"><div class="review_btm review_btm_l"><div class="review_top review_top_r"><div class="review_top review_top_l">
                        <div class="review_content">
                            <div class="review_section">
                                <div class="review_stats">
                                    <div class="review_critic">
                                        <div class="name">
                                                                                            <a href="/user/Noktu">Noktu</a>
                                                                                                                                </div>

                                                                                    <div class="date">Oct 21, 2017</div>
                                                                            </div>
                                    
                                    <div class="review_grade">
                                                
<div class="metascore_w user medium game positive indiv perfect">10</div>

                                    </div>
                                </div>
                                <div class="review_body">
                                                        
                                        <span>With every update the game gets refined into the direction the players want, one of the top RTS games out there for year 2017! I suggest this game for all ww2 rts fans.</span>
            </div>
                            </div>
                                                        <div class="review_section review_actions ">
                                <ul class="review_actions">
                                                                            <li class="review_action review_helpful">
                                            <div class="review_helpful">
    <div class="rating_thumbs">
        			<div class="helpful_summary thumb_count">
				<a href="https://secure.metacritic.com/login">
				<span class="total_ups">0</span>
				of 
				<span class="total_thumbs">0</span>
				users found this helpful
                </a>
			</div>
                <div style="clear:both;"></div>
    </div>
</div>
                                        </li>
                                                                                                                                                <li class="review_action">
                                        <a href="/user/Noktu">All this user&apos;s reviews</a>
                                    </li>
                                                                    </ul>
                            </div>
                            
                                                    </div>
                    </div></div></div></div>
                </li>
                                            