
                                                            <li id="user_review_7601592" class="review user_review first_review">
                    <div class="review_btm review_btm_r"><div class="review_btm review_btm_l"><div class="review_top review_top_r"><div class="review_top review_top_l">
                        <div class="review_content">
                            <div class="review_section">
                                <div class="review_stats">
                                    <div class="review_critic">
                                        <div class="name">
                                                                                            <a href="/user/Mosku">Mosku</a>
                                                                                                                                </div>

                                                                                    <div class="date">Oct 15, 2017</div>
                                                                            </div>
                                    
                                    <div class="review_grade">
                                                
<div class="metascore_w user medium game positive indiv">9</div>

                                    </div>
                                </div>
                                <div class="review_body">
                                                        
                                        <span class="inline_expand_collapse inline_collapsed" id="review_blurb_7601592"><span class="blurb blurb_collapsed">last time i had this much fun on any horror game was resident evil 4 ( 2005 ) The evil within 2 is awesome game. All bad stuff from the first game was taken away and replaced to better. story was great and game play was fantastic open areas you can move way you want, there are lots of guns, there is stealth, if you like survival horror and thinking is this a good game i can say it is solid</span><span class="blurb blurb_expanded">last time i had this much fun on any horror game was resident evil 4 ( 2005 ) The evil within 2 is awesome game. All bad stuff from the first game was taken away and replaced to better. story was great and game play was fantastic open areas you can move way you want, there are lots of guns, there is stealth, if you like survival horror and thinking is this a good game i can say it is solid 9/10. This became one of my favorite games i have played.</span><span class="blurb_etc">&#x2026;</span> <a rel="nofollow" class="toggle_expand_collapse toggle_expand" href="/game/pc/the-evil-within-2/user-reviews?user_review_id=7601592">Expand</a></span>
            </div>
                            </div>
                                                        <div class="review_section review_actions ">
                                <ul class="review_actions">
                                                                            <li class="review_action review_helpful">
                                            <div class="review_helpful">
    <div class="rating_thumbs">
        			<div class="helpful_summary thumb_count">
				<a href="https://secure.metacritic.com/login">
				<span class="total_ups">2</span>
				of 
				<span class="total_thumbs">2</span>
				users found this helpful
                </a>
			</div>
                <div style="clear:both;"></div>
    </div>
</div>
                                        </li>
                                                                                                                                                <li class="review_action">
                                        <a href="/user/Mosku">All this user&apos;s reviews</a>
                                    </li>
                                                                    </ul>
                            </div>
                            
                                                    </div>
                    </div></div></div></div>
                </li>
                                                                                    <li id="user_review_7603918" class="review user_review">
                    <div class="review_btm review_btm_r"><div class="review_btm review_btm_l"><div class="review_top review_top_r"><div class="review_top review_top_l">
                        <div class="review_content">
                            <div class="review_section">
                                <div class="review_stats">
                                    <div class="review_critic">
                                        <div class="name">
                                                                                            <a href="/user/VeryGooDiS">VeryGooDiS</a>
                                                                                                                                </div>

                                                                                    <div class="date">Oct 16, 2017</div>
                                                                            </div>
                                    
                                    <div class="review_grade">
                                                
<div class="metascore_w user medium game positive indiv">9</div>

                                    </div>
                                </div>
                                <div class="review_body">
                                                        
                                        <span class="inline_expand_collapse inline_collapsed" id="review_blurb_7603918"><span class="blurb blurb_collapsed">&#x417;&#x430;&#x43A;&#x43E;&#x43D;&#x447;&#x438;&#x43B; &#x412;&#x438;&#x437;&#x438;&#x43D; 2 (&#x43E;&#x43D; &#x436;&#x435; The Evil Within 2). &#x418;&#x442;&#x43E;&#x433;&#x43E; &#x437;&#x430;&#x43D;&#x44F;&#x43B;&#x43E; 17 &#x441; &#x445;&#x432;&#x43E;&#x441;&#x442;&#x438;&#x43A;&#x43E;&#x43C; &#x447;&#x430;&#x441;&#x43E;&#x432; &#x447;&#x438;&#x441;&#x442;&#x43E;&#x433;&#x43E; &#x433;&#x435;&#x438;&#x43F;&#x43B;&#x435;&#x439; &#x432;&#x440;&#x435;&#x43C;&#x435;&#x43D;&#x438;. &#x415;&#x441;&#x43B;&#x438; &#x43A;&#x440;&#x430;&#x442;&#x43A;&#x43E; - &#x43E;&#x442;&#x43B;&#x438;&#x447;&#x43D;&#x430;&#x44F; &#x438;&#x433;&#x440;&#x430;. &#x417;&#x430;&#x43C;&#x435;&#x447;&#x430;&#x43D;&#x438;&#x44F; &#x438; &#x43F;&#x440;&#x435;&#x442;&#x435;&#x43D;&#x437;&#x438;&#x438; &#x435;&#x441;&#x442;&#x44C;, &#x43D;&#x43E; &#x44D;&#x442;&#x43E; &#x43F;&#x440;&#x438;&#x434;&#x438;&#x440;&#x43E;&#x447;&#x43A;&#x438; &#x447;&#x438;&#x441;&#x442;&#x43E; &#x43E;&#x442; &#x43C;&#x435;&#x43D;&#x44F;, &#x43A;&#x43E;&#x442;&#x43E;&#x440;&#x44B;&#x435; &#x434;&#x440;&#x443;&#x433;&#x438;&#x43C; &#x43B;&#x44E;&#x434;&#x44F;&#x43C; &#x441;&#x43A;&#x43E;&#x440;&#x435;&#x439; &#x432;&#x441;&#x435;&#x433;&#x43E; &#x432;&#x43E;&#x43E;&#x431;&#x449;&#x435; &#x43D;&#x435; &#x43E;&#x441;&#x43E;&#x431;&#x43E; &#x43D;&#x443;&#x436;&#x43D;&#x44B;.
<br>
<br>&#x41F;&#x43B;&#x44E;&#x441;&#x44B;:

1) &#x41D;&#x435;&#x431;&#x43E;&#x43B;&#x44C;&#x448;&#x43E;&#x439; &#x43E;&#x442;&#x43A;&#x440;&#x44B;&#x442;&#x44B;&#x439; &#x43C;&#x438;&#x440; &#x440;&#x430;&#x437;&#x434;&#x435;&#x43B;&#x435;&#x43D;&#x43D;&#x44B;&#x435; &#x43D;&#x430; &#x43B;&#x43E;&#x43A;&#x430;&#x446;&#x438;&#x438; - &#x43E;&#x442;&#x43B;&#x438;&#x447;&#x43D;&#x430;&#x44F; &#x448;&#x442;&#x443;&#x43A;&#x430; &#x43A;&#x43E;&#x442;&#x43E;&#x440;&#x443;&#x44E; &#x436;&#x435;&#x441;&#x442;&#x43A;&#x43E; &#x43D;&#x435; &#x44E;&#x437;&#x430;&#x44E;&#x442; &#x43F;&#x43E;&#x441;&#x43B;&#x435; &#x441;&#x443;&#x43F;&#x435;&#x440; &#x43A;&#x43E;&#x440;&#x438;&#x434;&#x43E;&#x440;&#x43D;&#x43E;&#x439; &#x43F;&#x435;&#x440;&#x432;&#x43E;&#x439; &#x447;&#x430;&#x441;&#x442;&#x438;.</span><span class="blurb blurb_expanded">&#x417;&#x430;&#x43A;&#x43E;&#x43D;&#x447;&#x438;&#x43B; &#x412;&#x438;&#x437;&#x438;&#x43D; 2 (&#x43E;&#x43D; &#x436;&#x435; The Evil Within 2). &#x418;&#x442;&#x43E;&#x433;&#x43E; &#x437;&#x430;&#x43D;&#x44F;&#x43B;&#x43E; 17 &#x441; &#x445;&#x432;&#x43E;&#x441;&#x442;&#x438;&#x43A;&#x43E;&#x43C; &#x447;&#x430;&#x441;&#x43E;&#x432; &#x447;&#x438;&#x441;&#x442;&#x43E;&#x433;&#x43E; &#x433;&#x435;&#x438;&#x43F;&#x43B;&#x435;&#x439; &#x432;&#x440;&#x435;&#x43C;&#x435;&#x43D;&#x438;. &#x415;&#x441;&#x43B;&#x438; &#x43A;&#x440;&#x430;&#x442;&#x43A;&#x43E; - &#x43E;&#x442;&#x43B;&#x438;&#x447;&#x43D;&#x430;&#x44F; &#x438;&#x433;&#x440;&#x430;. &#x417;&#x430;&#x43C;&#x435;&#x447;&#x430;&#x43D;&#x438;&#x44F; &#x438; &#x43F;&#x440;&#x435;&#x442;&#x435;&#x43D;&#x437;&#x438;&#x438; &#x435;&#x441;&#x442;&#x44C;, &#x43D;&#x43E; &#x44D;&#x442;&#x43E; &#x43F;&#x440;&#x438;&#x434;&#x438;&#x440;&#x43E;&#x447;&#x43A;&#x438; &#x447;&#x438;&#x441;&#x442;&#x43E; &#x43E;&#x442; &#x43C;&#x435;&#x43D;&#x44F;, &#x43A;&#x43E;&#x442;&#x43E;&#x440;&#x44B;&#x435; &#x434;&#x440;&#x443;&#x433;&#x438;&#x43C; &#x43B;&#x44E;&#x434;&#x44F;&#x43C; &#x441;&#x43A;&#x43E;&#x440;&#x435;&#x439; &#x432;&#x441;&#x435;&#x433;&#x43E; &#x432;&#x43E;&#x43E;&#x431;&#x449;&#x435; &#x43D;&#x435; &#x43E;&#x441;&#x43E;&#x431;&#x43E; &#x43D;&#x443;&#x436;&#x43D;&#x44B;.
<br>
<br>&#x41F;&#x43B;&#x44E;&#x441;&#x44B;:
<br>
<br>1) &#x41D;&#x435;&#x431;&#x43E;&#x43B;&#x44C;&#x448;&#x43E;&#x439; &#x43E;&#x442;&#x43A;&#x440;&#x44B;&#x442;&#x44B;&#x439; &#x43C;&#x438;&#x440; &#x440;&#x430;&#x437;&#x434;&#x435;&#x43B;&#x435;&#x43D;&#x43D;&#x44B;&#x435; &#x43D;&#x430; &#x43B;&#x43E;&#x43A;&#x430;&#x446;&#x438;&#x438; - &#x43E;&#x442;&#x43B;&#x438;&#x447;&#x43D;&#x430;&#x44F; &#x448;&#x442;&#x443;&#x43A;&#x430; &#x43A;&#x43E;&#x442;&#x43E;&#x440;&#x443;&#x44E; &#x436;&#x435;&#x441;&#x442;&#x43A;&#x43E; &#x43D;&#x435; &#x44E;&#x437;&#x430;&#x44E;&#x442; &#x43F;&#x43E;&#x441;&#x43B;&#x435; &#x441;&#x443;&#x43F;&#x435;&#x440; &#x43A;&#x43E;&#x440;&#x438;&#x434;&#x43E;&#x440;&#x43D;&#x43E;&#x439; &#x43F;&#x435;&#x440;&#x432;&#x43E;&#x439; &#x447;&#x430;&#x441;&#x442;&#x438;.
<br>2) &#x41C;&#x43D;&#x43E;&#x433;&#x43E; &#x43A;&#x43E;&#x43D;&#x442;&#x435;&#x43D;&#x442;&#x430;
<br>3) &#x420;&#x435;&#x430;&#x43B;&#x44C;&#x43D;&#x44B;&#x439; &#x432;&#x44B;&#x436;&#x438;&#x432;&#x430;&#x447;, &#x43A;&#x430;&#x43A; &#x438; &#x43F;&#x435;&#x440;&#x432;&#x430;&#x44F; &#x447;&#x430;&#x441;&#x442;&#x44C;, &#x43D;&#x43E; &#x43D;&#x435;&#x43C;&#x43D;&#x43E;&#x433;&#x43E; (&#x43A;&#x430;&#x43A; &#x43C;&#x43D;&#x435; &#x43F;&#x43E;&#x43A;&#x430;&#x437;&#x430;&#x43B;&#x43E;&#x441;&#x44C;) &#x443;&#x43C;&#x435;&#x43D;&#x44C;&#x448;&#x435;&#x43D; &#x433;&#x440;&#x430;&#x434;&#x443;&#x441; &#x445;&#x430;&#x440;&#x434;&#x43A;&#x43E;&#x440;&#x43D;&#x43E;&#x441;&#x442;&#x438; (&#x43C;&#x431; &#x43D;&#x430; &#x43B;&#x430;&#x441;&#x442; &#x441;&#x43B;&#x43E;&#x436;&#x43D;&#x43E;&#x441;&#x442;&#x438; &#x442;&#x430;&#x43C; &#x43A;&#x430;&#x43A; &#x440;&#x430;&#x437; &#x442;&#x43E;&#x442; &#x441;&#x430;&#x43C;&#x44B;&#x439; &quot;&#x43E;&#x441;&#x442;&#x440;&#x44B;&#x439; &#x43F;&#x435;&#x440;&#x447;&#x438;&#x43A;&quot; &#x43A;&#x430;&#x43A; &#x432; &#x43F;&#x435;&#x440;&#x432;&#x43E;&#x439; &#x438;&#x433;&#x440;&#x435;).
<br>4) &#x41E;&#x442;&#x43B;&#x438;&#x447;&#x43D;&#x430;&#x44F; &#x438;&#x441;&#x442;&#x43E;&#x440;&#x438;&#x44F; (&#x43F;&#x440;&#x430;&#x432;&#x434;&#x430; &#x43D;&#x435;&#x43A;&#x43E;&#x442;&#x43E;&#x440;&#x443;&#x44E; &#x447;&#x430;&#x441;&#x442;&#x44C; &#x438;&#x441;&#x442;&#x43E;&#x440;&#x438;&#x438; &#x432;&#x44B;&#x43A;&#x438;&#x43D;&#x443;&#x43B;&#x438;, &#x43A;&#x43E;&#x442;&#x43E;&#x440;&#x443;&#x44E; &#x442;&#x430;&#x43A; &#x436;&#x435; &#x43C;&#x43E;&#x433;&#x43B;&#x438; &#x43F;&#x43B;&#x435;&#x441;&#x442;&#x438; &#x438;&#x437; &#x43F;&#x435;&#x440;&#x432;&#x43E;&#x439; &#x447;&#x430;&#x441;&#x442;&#x438;)
<br>5) &#x41A;&#x43E;&#x43D;&#x446;&#x43E;&#x432;&#x43A;&#x430; &#x434;&#x430;&#x435;&#x442; &#x43D;&#x430;&#x434;&#x435;&#x436;&#x434;&#x443; &#x43D;&#x430; &#x432;&#x43E;&#x437;&#x43C;&#x43E;&#x436;&#x43D;&#x43E; &#x43F;&#x440;&#x43E;&#x434;&#x43E;&#x43B;&#x436;&#x435;&#x43D;&#x438;&#x435; (&#x438;&#x43B;&#x438; &#x414;&#x43B;&#x446;?)
<br>6) &#x41E;&#x440;&#x443;&#x436;&#x438;&#x435; &#x43D;&#x435; &#x434;&#x435;&#x43B;&#x430;&#x435;&#x442; &#x432;&#x430;&#x441; &quot;&#x41E;&#x432;&#x435;&#x440;&#x43F;&#x43E;&#x432;&#x435;&#x440;&#x43E;&#x43C;&quot; &#x438;&#x437; &#x437;&#x430; &#x43E;&#x447;&#x435;&#x43D;&#x44C; &#x43C;&#x430;&#x43B;&#x43E;&#x433;&#x43E; &#x43A;&#x43E;&#x43B;-&#x432;&#x430; &#x43F;&#x430;&#x442;&#x440;&#x43E;&#x43D;&#x43E;&#x432; &#x43F;&#x43E; &#x432;&#x441;&#x435;&#x439; &#x438;&#x433;&#x440;&#x435; + &#x431;&#x435;&#x437; &#x43F;&#x440;&#x43E;&#x43A;&#x430;&#x447;&#x43A;&#x438; &#x43C;&#x43D;&#x43E;&#x433;&#x438;&#x435; &#x43F;&#x443;&#x448;&#x43A;&#x438; &#x43D;&#x435; &#x43E;&#x441;&#x43E;&#x431;&#x43E; &#x441;&#x438;&#x43B;&#x44C;&#x43D;&#x44B;&#x435;.
<br>7) &#x415;&#x441;&#x442;&#x44C; &#x432;&#x440;&#x430;&#x433;&#x438; &#x43A;&#x43E;&#x442;&#x43E;&#x440;&#x44B;&#x435; &quot;&#x41B;&#x44E;&#x442;&#x43E; &#x43D;&#x435;&#x43D;&#x430;&#x432;&#x438;&#x436;&#x443; &#x430;&#x430;&#x430;&#x430; &#x443;&#x439;&#x434;&#x438; &#x43E;&#x442; &#x43C;&#x435;&#x43D;&#x44F; &#x441;&#x432;&#x43E;&#x43B;&#x43E;&#x447;&#x44C;&quot;
<br>8) &#x41A;&#x443;&#x447;&#x443; &#x43F;&#x430;&#x440;&#x430;&#x43D;&#x43E;&#x440;&#x43C;&#x430;&#x43B;&#x44C;&#x43D;&#x44B;&#x445; &#x448;&#x442;&#x443;&#x43A;
<br>9) 17 &#x447;&#x430;&#x441;&#x43E;&#x432; &#x447;&#x438;&#x441;&#x442;&#x43E;&#x433;&#x43E; &#x433;&#x435;&#x438;&#x43F;&#x43B;&#x435;&#x44F; - &#x43C;&#x43D;&#x43E;&#x433;&#x438;&#x435; &#x438;&#x433;&#x440;&#x44B; &#x441;&#x435;&#x438;&#x447;&#x430;&#x441; &#x438; &#x441;&#x442;&#x43E;&#x43B;&#x44C;&#x43A;&#x43E; &#x43D;&#x435; &#x43C;&#x43E;&#x433;&#x443;&#x442; &#x434;&#x430;&#x442;&#x44C;.
<br>10) &#x412; &#x43A;&#x43E;&#x43D;&#x446;&#x435; (&#x432; &#x43B;&#x430;&#x441;&#x442; 1-2 &#x447;&#x430;&#x441;&#x430;) &#x43A;&#x440;&#x443;&#x442;&#x44B;&#x435; &#x43E;&#x442;&#x441;&#x44B;&#x43B;&#x43A;&#x438; &#x43A; &#x43F;&#x435;&#x440;&#x432;&#x43E;&#x439; &#x447;&#x430;&#x441;&#x442;&#x438;.
<br>
<br>&#x41C;&#x438;&#x43D;&#x443;&#x441;&#x44B;:
<br>
<br>1) &#x410;&#x440;&#x431;&#x430;&#x43B;&#x435;&#x442; &#x438;&#x441;&#x43F;&#x43E;&#x433;&#x430;&#x43D;&#x438;&#x43B;&#x438; &#x43A;&#x430;&#x43A; &#x43E;&#x440;&#x443;&#x436;&#x438;&#x435; &#x43F;&#x43E;&#x447;&#x442;&#x438; &#x43F;&#x43E;&#x43B;&#x43D;&#x43E;&#x441;&#x442;&#x44C;&#x44E; &#x432; &#x441;&#x440;&#x430;&#x432;&#x43D;&#x435;&#x43D;&#x438;&#x44E; &#x441; &#x43F;&#x435;&#x440;&#x432;&#x43E;&#x439; &#x447;&#x430;&#x441;&#x442;&#x44C;&#x44E;.
<br>2) &#x41C;&#x430;&#x43B;&#x43E; (&#x43F;&#x43E;&#x447;&#x442;&#x438; &#x43D;&#x435;&#x442;) &#x43F;&#x430;&#x442;&#x440;&#x43E;&#x43D;&#x43E;&#x432; &#x43D;&#x430; &#x441;&#x43D;&#x430;&#x438;&#x43F;&#x435;&#x440;&#x43A;&#x443; &#x438; &#x430;&#x432;&#x442;&#x43E;&#x43C;&#x430;&#x442; (&#x43D;&#x430; &#x43D;&#x435;&#x433;&#x43E; &#x442;&#x43E;&#x43B;&#x44C;&#x43A;&#x43E; &#x43A;&#x440;&#x430;&#x444;&#x442;&#x438;&#x442;&#x44C;)
<br>3) &#x41D;&#x435;&#x43A;&#x43E;&#x442;&#x43E;&#x440;&#x44B;&#x435; &#x447;&#x430;&#x441;&#x442;&#x438; &#x43B;&#x43E;&#x43A;&#x430;&#x446;&#x438;&#x438; &#x44F;&#x432;&#x43D;&#x43E; &#x437;&#x430;&#x431;&#x44B;&#x43B;&#x438; &#x434;&#x43E;&#x434;&#x435;&#x43B;&#x430;&#x442;&#x44C; (&#x442;.&#x435;. &#x43C;&#x435;&#x436;&#x434;&#x443; &#x434;&#x43E;&#x43C;&#x430;&#x43C;&#x438; &#x43C;&#x43E;&#x436;&#x435;&#x442; &#x431;&#x44B;&#x442;&#x44C; &#x441;&#x442;&#x440;&#x430;&#x43D;&#x43D;&#x430;&#x44F; &#x43F;&#x443;&#x441;&#x442;&#x43E;&#x442;&#x430; &#x438;&#x437; &#x437;&#x435;&#x43C;&#x43B;&#x438; &#x438; &#x442;.&#x43F;.)
<br>4) &#x41C;&#x438;&#x43B;&#x438;-&#x431;&#x43E;&#x439; &#x442;&#x430;&#x43A; &#x436;&#x435; &#x443;&#x449;&#x435;&#x440;&#x431;&#x43D;&#x44B;&#x439; &#x43A;&#x430;&#x43A; &#x438; &#x432; &#x43F;&#x435;&#x440;&#x432;&#x43E;&#x439; &#x447;&#x430;&#x441;&#x442;&#x438;.
<br>5) &#x418;&#x437; &#x438;&#x433;&#x440;&#x44B; &#x43F;&#x440;&#x43E;&#x43F;&#x430;&#x43B;&#x438; &#x43B;&#x43E;&#x432;&#x443;&#x448;&#x43A;&#x438; (&#x445;&#x43E;&#x442;&#x44F; &#x432; &#x43F;&#x435;&#x440;&#x432;&#x43E;&#x439; &#x447;&#x430;&#x441;&#x442;&#x438; &#x438;&#x445; &#x431;&#x44B;&#x43B;&#x43E; &#x43E;&#x447;&#x435;&#x43D;&#x44C; &#x43C;&#x43D;&#x43E;&#x433;&#x43E; &#x438; &#x43E;&#x43D;&#x438; &#x434;&#x43E;&#x431;&#x430;&#x432;&#x43B;&#x44F;&#x43B;&#x438; &#x43E;&#x433;&#x440;&#x43E;&#x43C;&#x43D;&#x44B;&#x439; &#x433;&#x440;&#x430;&#x434;&#x443;&#x441; &#x43E;&#x441;&#x442;&#x440;&#x43E;&#x442;&#x44B;)
<br>6) &#x41E;&#x427;&#x415;&#x41D;&#x42C; &#x41C;&#x41D;&#x41E;&#x413;&#x41E; &#x445;&#x438;&#x43B;&#x43B; &#x442;&#x440;&#x430;&#x432;&#x44B; (&#x43F;&#x43E;&#x434; &#x43A;&#x43E;&#x43D;&#x435;&#x446; &#x437;&#x430;&#x43A;&#x43E;&#x43D;&#x447;&#x438;&#x43B; &#x441; 50+ &#x448;&#x442;&#x443;&#x43A;&#x430;&#x43C;&#x438;)
<br>7) &#x421;&#x43F;&#x43E;&#x440;&#x43D;&#x44B;&#x439; &#x431;&#x430;&#x43B;&#x430;&#x43D;&#x441; &quot;&#x441;&#x43F;&#x435;&#x43B;&#x43E;&#x432;&quot; &#x43F;&#x43E; &#x441;&#x442;&#x43E;&#x438;&#x43C;&#x43E;&#x441;&#x442;&#x438; (&#x434;&#x430; &#x438; &#x432;&#x43E;&#x43E;&#x431;&#x449;&#x435; &#x435;&#x441;&#x442;&#x44C; &#x441;&#x43F;&#x43E;&#x440;&#x43D;&#x44B;&#x435;)
<br>8) &#x41D;&#x435;&#x43A;&#x43E;&#x442;&#x43E;&#x440;&#x44B;&#x435; &#x443;&#x434;&#x430;&#x440;&#x44B; &#x431;&#x43E;&#x441;&#x441;&#x43E;&#x432; &#x43C;&#x43E;&#x433;&#x443;&#x442; &#x442;&#x435;&#x431;&#x44F; &#x432;&#x430;&#x43D;&#x448;&#x43E;&#x442;&#x43D;&#x443;&#x442;&#x44C; &#x438; &#x43F;&#x43E;&#x445;&#x443;&#x439; &#x447;&#x442;&#x43E; &#x443; &#x442;&#x435;&#x431;&#x44F; &#x43C;&#x430;&#x43A;&#x441; &#x432;&#x44B;&#x43A;&#x430;&#x447;&#x435;&#x43D;&#x43E; &#x445;&#x43F; &#x438; &#x443; &#x442;&#x435;&#x431;&#x44F; &#x444;&#x443;&#x43B;&#x43B; &#x43F;&#x43E;&#x43B;&#x43E;&#x441;&#x43A;&#x430;. &#x412;&#x43E;&#x442; &#x442;&#x443;&#x43F;&#x43E; &#x432;&#x430;&#x43D;&#x448;&#x43E;&#x442;-&#x443;&#x434;&#x430;&#x440;. &#x41A;&#x430;&#x43A; &#x441; &#x442;&#x430;&#x43A;&#x438;&#x43C; &quot;&#x438;&#x433;&#x440;&#x430;&#x442;&#x44C;&quot; &#x438; &#x43F;&#x440;&#x43E;&#x445;&#x43E;&#x434;&#x438;&#x442;&#x44C; &#x441;&#x43B;&#x43E;&#x436;&#x43D;&#x43E;&#x441;&#x442;&#x44C; - 1 &#x441;&#x43C;&#x435;&#x440;&#x442;&#x44C; = &#x43D;&#x430;&#x447;&#x438;&#x43D;&#x430;&#x435;&#x448;&#x44C; &#x444;&#x443;&#x43B;&#x43B; &#x438;&#x433;&#x440;&#x443; &#x441; &#x43D;&#x430;&#x447;&#x430;&#x43B;&#x430; - &#x43C;&#x43D;&#x435; &#x43D;&#x435; &#x44F;&#x441;&#x43D;&#x43E;. (&#x43F;&#x440;&#x438; &#x442;&#x43E;&#x43C; &#x447;&#x442;&#x43E; &#x434;&#x430;&#x436;&#x435; &#x43F;&#x435;&#x440;&#x43A;&#x438; &#x43D;&#x435; &#x440;&#x430;&#x431;&#x43E;&#x442;&#x430;&#x44E;&#x442; &#x43D;&#x430; &#x442;&#x430;&#x43A;&#x43E;&#x439; &#x432;&#x430;&#x43D;&#x448;&#x43E;&#x442;)
<br>9) &#x411;&#x43E;&#x438; &#x441; &#x43D;&#x435;&#x43A;&#x43E;&#x442;&#x43E;&#x440;&#x44B;&#x43C;&#x438; &#x431;&#x43E;&#x441;&#x441;&#x430;&#x43C;&#x438; &#x43C;&#x43E;&#x436;&#x43D;&#x43E; &#x431;&#x44B;&#x43B;&#x43E; &#x441;&#x434;&#x435;&#x43B;&#x430;&#x442;&#x44C; &#x438;&#x43D;&#x442;&#x435;&#x440;&#x435;&#x441;&#x43D;&#x435;&#x435;.
<br>10) &#x427;&#x430;&#x441;&#x442;&#x44C; &#x437;&#x430; &#x41A;&#x438;&#x434;&#x43C;&#x430;&#x43D; &#x44F;&#x432;&#x43D;&#x43E; &#x43E;&#x431;&#x440;&#x435;&#x437;&#x430;&#x43B;&#x438; &#x438; &#x43D;&#x435; &#x434;&#x43E;&#x434;&#x435;&#x43B;&#x430;&#x43B;&#x438;.
<br>11) &#x41F;&#x43E;&#x441;&#x43B;&#x435; &#x43A;&#x43E;&#x43D;&#x446;&#x430; &#x438;&#x433;&#x440;&#x44B; &#x43E;&#x441;&#x442;&#x430;&#x43B;&#x43E;&#x441;&#x44C; &#x43A;&#x443;&#x447;&#x443; &#x432;&#x43E;&#x43F;&#x440;&#x43E;&#x441;&#x43E;&#x432; - &#x43D;&#x435; &#x44F;&#x441;&#x43D;&#x43E; &#x43A;&#x43E;&#x433;&#x434;&#x430; &#x43F;&#x43E;&#x43B;&#x443;&#x447;&#x438;&#x43C; (&#x438; &#x43F;&#x43E;&#x43B;&#x443;&#x447;&#x438;&#x43C; &#x43B;&#x438;) &#x43E;&#x442;&#x432;&#x435;&#x442;&#x44B;. &#x41D;&#x430;&#x434;&#x435;&#x44E;&#x441;&#x44C; &#x43D;&#x430; &#x414;&#x41B;&#x426; &#x43A; &#x438;&#x433;&#x440;&#x435; &#x43A;&#x430;&#x43A; &#x43C;&#x438;&#x43D;&#x438;&#x43C;&#x443;&#x43C; (&#x43A;&#x430;&#x43A; &#x432; &#x43F;&#x435;&#x440;&#x432;&#x43E;&#x439; &#x447;&#x430;&#x441;&#x442;&#x438;)
<br>12) &#x41D;&#x430; &#x431;&#x43E;&#x441;&#x441;&#x430;&#x445; &#x442;&#x432;&#x43E;&#x439; &#x43D;&#x430;&#x432;&#x44B;&#x43A; &#x441;&#x442;&#x435;&#x43B;&#x441;&#x430; - &#x44D;&#x442;&#x43E; &#x43A;&#x443;&#x441;&#x43E;&#x43A; &#x434;&#x435;&#x440;&#x44C;&#x43C;&#x430; (&#x431;&#x435;&#x441;&#x43F;&#x43E;&#x43B;&#x435;&#x437;&#x43D;&#x44B;&#x439;), &#x437;&#x430; &#x442;&#x43E; &#x432; &#x43E;&#x441;&#x442;&#x430;&#x43B;&#x44C;&#x43D;&#x43E;&#x435; &#x432;&#x440;&#x435;&#x43C;&#x44F; &#x43E;&#x447;&#x435;&#x43D;&#x44C; &#x43D;&#x443;&#x436;&#x43D;&#x430;&#x44F; &#x448;&#x442;&#x443;&#x43A;&#x430;.
<br>
<br>&#x41D;&#x435; &#x441;&#x43C;&#x43E;&#x442;&#x440;&#x438;&#x442;&#x435; &#x447;&#x442;&#x43E; &#x44F; &#x441;&#x442;&#x43E;&#x43B;&#x44C;&#x43A;&#x43E; &#x43D;&#x430;&#x43F;&#x438;&#x441;&#x430;&#x43B;, &#x44D;&#x442;&#x43E; &#x43F;&#x43E; &#x431;&#x43E;&#x43B;&#x44C;&#x448;&#x435;&#x439; &#x447;&#x430;&#x441;&#x442;&#x438; &#x442;&#x43E;, &#x447;&#x442;&#x43E; &#x43D;&#x430;&#x432;&#x435;&#x440;&#x43D;&#x43E;&#x435; &#x43E;&#x442;&#x434;&#x435;&#x43B;&#x44F;&#x435;&#x442; &#x438;&#x433;&#x440;&#x443; &#x43E;&#x442; &quot;10 &#x438;&#x437; 10&quot;. &#x414;&#x443;&#x43C;&#x430;&#x44E; &#x432; &#x441;&#x440;&#x435;&#x434;&#x43D;&#x435;&#x43C; &#x43E;&#x446;&#x435;&#x43D;&#x43A;&#x430; &#x432; 8 &#x438;&#x43B;&#x438; 8.5 &#x431;&#x44B;&#x43B;&#x430; &#x431;&#x44B; &#x441;&#x43F;&#x440;&#x430;&#x432;&#x435;&#x434;&#x43B;&#x438;&#x432;&#x43E;&#x439; &#x434;&#x43B;&#x44F; &#x434;&#x430;&#x43D;&#x43D;&#x43E;&#x439; &#x438;&#x433;&#x440;&#x44B;. &#x41B;&#x44E;&#x431;&#x438;&#x442;&#x435;&#x43B;&#x44F;&#x43C; &#x436;&#x430;&#x43D;&#x440;&#x430; &#x44D;&#x442;&#x43E; 9 &#x438; &#x432;&#x44B;&#x448;&#x435;. &#x41A;&#x43E;&#x440;&#x43E;&#x447;&#x435;, &#x440;&#x435;&#x43A;&#x43E;&#x43C;&#x435;&#x43D;&#x434;&#x443;&#x44E;, &#x43D;&#x43E; &#x43D;&#x443;&#x436;&#x43D;&#x43E; &#x43A;&#x430;&#x43A; &#x43C;&#x438;&#x43D;&#x438;&#x43C;&#x443;&#x43C; &#x437;&#x43D;&#x430;&#x43D;&#x438;&#x435; &#x441;&#x44E;&#x436;&#x435;&#x442;&#x430; &#x43F;&#x435;&#x440;&#x432;&#x43E;&#x439; &#x447;&#x430;&#x441;&#x442;&#x438; (&#x438;&#x433;&#x440;&#x430;&#x442;&#x44C; &#x432; &#x43D;&#x435;&#x451; &#x432; &#x43D;&#x430;&#x448;&#x435; &#x432;&#x440;&#x435;&#x43C;&#x44F; &#x443;&#x436;&#x435; &#x43C;&#x43E;&#x436;&#x435;&#x442; &#x431;&#x44B;&#x442;&#x44C; &#x431;&#x43E;&#x43B;&#x44C;&#x43D;&#x43E; &#x434;&#x43B;&#x44F; &#x433;&#x43B;&#x430;&#x437; &#x43A; &#x441;&#x43E;&#x436;&#x430;&#x43B;&#x435;&#x43D;&#x438;&#x44E;).</span><span class="blurb_etc">&#x2026;</span> <a rel="nofollow" class="toggle_expand_collapse toggle_expand" href="/game/pc/the-evil-within-2/user-reviews?user_review_id=7603918">Expand</a></span>
            </div>
                            </div>
                                                        <div class="review_section review_actions ">
                                <ul class="review_actions">
                                                                            <li class="review_action review_helpful">
                                            <div class="review_helpful">
    <div class="rating_thumbs">
        			<div class="helpful_summary thumb_count">
				<a href="https://secure.metacritic.com/login">
				<span class="total_ups">2</span>
				of 
				<span class="total_thumbs">2</span>
				users found this helpful
                </a>
			</div>
                <div style="clear:both;"></div>
    </div>
</div>
                                        </li>
                                                                                                                                                <li class="review_action">
                                        <a href="/user/VeryGooDiS">All this user&apos;s reviews</a>
                                    </li>
                                                                    </ul>
                            </div>
                            
                                                    </div>
                    </div></div></div></div>
                </li>
                                                                                    <li id="user_review_7627117" class="review user_review">
                    <div class="review_btm review_btm_r"><div class="review_btm review_btm_l"><div class="review_top review_top_r"><div class="review_top review_top_l">
                        <div class="review_content">
                            <div class="review_section">
                                <div class="review_stats">
                                    <div class="review_critic">
                                        <div class="name">
                                                                                            <a href="/user/grimsfield">grimsfield</a>
                                                                                                                                </div>

                                                                                    <div class="date">Oct 21, 2017</div>
                                                                            </div>
                                    
                                    <div class="review_grade">
                                                
<div class="metascore_w user medium game positive indiv">8</div>

                                    </div>
                                </div>
                                <div class="review_body">
                                                        
                                        <span>Best horror game of 2017. Characters can be a little bland at points, but overall the game is sufficiently creepy with an interesting story and very entertaining gameplay.</span>
            </div>
                            </div>
                                                        <div class="review_section review_actions ">
                                <ul class="review_actions">
                                                                            <li class="review_action review_helpful">
                                            <div class="review_helpful">
    <div class="rating_thumbs">
        			<div class="helpful_summary thumb_count">
				<a href="https://secure.metacritic.com/login">
				<span class="total_ups">1</span>
				of 
				<span class="total_thumbs">1</span>
				users found this helpful
                </a>
			</div>
                <div style="clear:both;"></div>
    </div>
</div>
                                        </li>
                                                                                                                                                <li class="review_action">
                                        <a href="/user/grimsfield">All this user&apos;s reviews</a>
                                    </li>
                                                                    </ul>
                            </div>
                            
                                                    </div>
                    </div></div></div></div>
                </li>
                                                                                    <li id="user_review_7635992" class="review user_review">
                    <div class="review_btm review_btm_r"><div class="review_btm review_btm_l"><div class="review_top review_top_r"><div class="review_top review_top_l">
                        <div class="review_content">
                            <div class="review_section">
                                <div class="review_stats">
                                    <div class="review_critic">
                                        <div class="name">
                                                                                            <a href="/user/Twirlenkiller">Twirlenkiller</a>
                                                                                                                                </div>

                                                                                    <div class="date">Oct 24, 2017</div>
                                                                            </div>
                                    
                                    <div class="review_grade">
                                                
<div class="metascore_w user medium game positive indiv perfect">10</div>

                                    </div>
                                </div>
                                <div class="review_body">
                                                        
                                        <span>Excellent game, I enjoyed it completely. Loved the open areas, the improved stealth (new ways to kill enemies), the story, everything. Its better than its predecessor.</span>
            </div>
                            </div>
                                                        <div class="review_section review_actions ">
                                <ul class="review_actions">
                                                                            <li class="review_action review_helpful">
                                            <div class="review_helpful">
    <div class="rating_thumbs">
        			<div class="helpful_summary thumb_count">
				<a href="https://secure.metacritic.com/login">
				<span class="total_ups">1</span>
				of 
				<span class="total_thumbs">1</span>
				users found this helpful
                </a>
			</div>
                <div style="clear:both;"></div>
    </div>
</div>
                                        </li>
                                                                                                                                                <li class="review_action">
                                        <a href="/user/Twirlenkiller">All this user&apos;s reviews</a>
                                    </li>
                                                                    </ul>
                            </div>
                            
                                                    </div>
                    </div></div></div></div>
                </li>
                                                                                    <li id="user_review_7616658" class="review user_review">
                    <div class="review_btm review_btm_r"><div class="review_btm review_btm_l"><div class="review_top review_top_r"><div class="review_top review_top_l">
                        <div class="review_content">
                            <div class="review_section">
                                <div class="review_stats">
                                    <div class="review_critic">
                                        <div class="name">
                                                                                            <a href="/user/downliner">downliner</a>
                                                                                                                                </div>

                                                                                    <div class="date">Oct 18, 2017</div>
                                                                            </div>
                                    
                                    <div class="review_grade">
                                                
<div class="metascore_w user medium game positive indiv">9</div>

                                    </div>
                                </div>
                                <div class="review_body">
                                                        
                                        <span class="inline_expand_collapse inline_collapsed" id="review_blurb_7616658"><span class="blurb blurb_collapsed">When you first start Evil Within 2 and reach Act 3 you&apos;ll probably ask yourself what exactly was the point in Acts 1 &amp; 2? But considering this game has 17 Acts you&apos;ll soon learn why as you progress. The Evil Within 2 is everything the first game in the series should&apos;ve been. It&apos;s clean, creepy with some disturbing locations and the Story including the cutscenes is well executed. The open</span><span class="blurb blurb_expanded">When you first start Evil Within 2 and reach Act 3 you&apos;ll probably ask yourself what exactly was the point in Acts 1 &amp; 2? But considering this game has 17 Acts you&apos;ll soon learn why as you progress. The Evil Within 2 is everything the first game in the series should&apos;ve been. It&apos;s clean, creepy with some disturbing locations and the Story including the cutscenes is well executed. The open world transition in the first game didn&apos;t really pan out but it works great here. I don&apos;t think i&apos;ve had to sneak around any open world map as much as i did in Evil Within 2. Well worth the price. One annoyance is the number of times the Clint Eastwood voiceover says &quot;What the...&quot;</span><span class="blurb_etc">&#x2026;</span> <a rel="nofollow" class="toggle_expand_collapse toggle_expand" href="/game/pc/the-evil-within-2/user-reviews?user_review_id=7616658">Expand</a></span>
            </div>
                            </div>
                                                        <div class="review_section review_actions ">
                                <ul class="review_actions">
                                                                            <li class="review_action review_helpful">
                                            <div class="review_helpful">
    <div class="rating_thumbs">
        			<div class="helpful_summary thumb_count">
				<a href="https://secure.metacritic.com/login">
				<span class="total_ups">1</span>
				of 
				<span class="total_thumbs">1</span>
				users found this helpful
                </a>
			</div>
                <div style="clear:both;"></div>
    </div>
</div>
                                        </li>
                                                                                                                                                <li class="review_action">
                                        <a href="/user/downliner">All this user&apos;s reviews</a>
                                    </li>
                                                                    </ul>
                            </div>
                            
                                                    </div>
                    </div></div></div></div>
                </li>
                                                                                    <li id="user_review_7615188" class="review user_review">
                    <div class="review_btm review_btm_r"><div class="review_btm review_btm_l"><div class="review_top review_top_r"><div class="review_top review_top_l">
                        <div class="review_content">
                            <div class="review_section">
                                <div class="review_stats">
                                    <div class="review_critic">
                                        <div class="name">
                                                                                            <a href="/user/DaggasPlays">DaggasPlays</a>
                                                                                                                                </div>

                                                                                    <div class="date">Oct 18, 2017</div>
                                                                            </div>
                                    
                                    <div class="review_grade">
                                                
<div class="metascore_w user medium game positive indiv perfect">10</div>

                                    </div>
                                </div>
                                <div class="review_body">
                                                        
                                        <span class="inline_expand_collapse inline_collapsed" id="review_blurb_7615188"><span class="blurb blurb_collapsed">Amazing game
<br>First game was good but here everything is just better. No more small corridors and more bigger open areas which are fun and useful to explore as u find ammunition, gear, resources for crafting and collectibles which are references to other great games (which will most likely make u smile)
<br>In conclusion: everything that&apos;s been in the 1st game got improved and the things</span><span class="blurb blurb_expanded">Amazing game
<br>First game was good but here everything is just better. No more small corridors and more bigger open areas which are fun and useful to explore as u find ammunition, gear, resources for crafting and collectibles which are references to other great games (which will most likely make u smile)
<br>In conclusion: everything that&apos;s been in the 1st game got improved and the things players didn&apos;t like in the first game got changed in a better way. Not mentioning that the graphics got improved.
<br>10/10 without any doubt
<br>(also, I didn&apos;t expect this game to be a success or be better after the first one)</span><span class="blurb_etc">&#x2026;</span> <a rel="nofollow" class="toggle_expand_collapse toggle_expand" href="/game/pc/the-evil-within-2/user-reviews?user_review_id=7615188">Expand</a></span>
            </div>
                            </div>
                                                        <div class="review_section review_actions ">
                                <ul class="review_actions">
                                                                            <li class="review_action review_helpful">
                                            <div class="review_helpful">
    <div class="rating_thumbs">
        			<div class="helpful_summary thumb_count">
				<a href="https://secure.metacritic.com/login">
				<span class="total_ups">1</span>
				of 
				<span class="total_thumbs">1</span>
				users found this helpful
                </a>
			</div>
                <div style="clear:both;"></div>
    </div>
</div>
                                        </li>
                                                                                                                                                <li class="review_action">
                                        <a href="/user/DaggasPlays">All this user&apos;s reviews</a>
                                    </li>
                                                                    </ul>
                            </div>
                            
                                                    </div>
                    </div></div></div></div>
                </li>
                                                                                    <li id="user_review_7607232" class="review user_review">
                    <div class="review_btm review_btm_r"><div class="review_btm review_btm_l"><div class="review_top review_top_r"><div class="review_top review_top_l">
                        <div class="review_content">
                            <div class="review_section">
                                <div class="review_stats">
                                    <div class="review_critic">
                                        <div class="name">
                                                                                            <a href="/user/LastGunslinger">LastGunslinger</a>
                                                                                                                                </div>

                                                                                    <div class="date">Oct 17, 2017</div>
                                                                            </div>
                                    
                                    <div class="review_grade">
                                                
<div class="metascore_w user medium game positive indiv">9</div>

                                    </div>
                                </div>
                                <div class="review_body">
                                                        
                                        <span class="inline_expand_collapse inline_collapsed" id="review_blurb_7607232"><span class="blurb blurb_collapsed">Hi, been gaming since the days of the ZX-81 (35 years), first review here though as enjoying the game;
<br>
<br>Playing the game on survival first at WQHD on a 50&quot; TV, using keyboard and mouse as have a bed stand so no discomfort there, compared with using controller. (Better headshot rate with the mouse)
(Rig GTX 1080, 16gb ram, i5 intel OC&apos;d to 4.8mhz)

Pros
- Similar shooting / melee</span><span class="blurb blurb_expanded">Hi, been gaming since the days of the ZX-81 (35 years), first review here though as enjoying the game;
<br>
<br>Playing the game on survival first at WQHD on a 50&quot; TV, using keyboard and mouse as have a bed stand so no discomfort there, compared with using controller. (Better headshot rate with the mouse)
<br>(Rig GTX 1080, 16gb ram, i5 intel OC&apos;d to 4.8mhz)
<br>
<br>Pros
<br>- Similar shooting / melee mechanics as RE4 which is not a bad thing
<br>- Great graphics, getting 40fps at 4k ultra settings and 80fps at 2560 x 1440 (WQHD) ultra settings. 40fps is fine though as it a third person. Graphics look AAA to me.
<br>- Like the way you can forage for ages (as I am a completionist) or just stay on the main quest line.
<br>- great enemy animations (I like fleshy looking monsters rather than daft ones like in prey 2017, especially when you blow the guts out of them).
<br>- Like the shooting gallery in the nurses room just in case you need a bit more equipment.
<br>
<br>Cons
<br>- Bit of a slow start, not much to fight for a while (you can skip most cut scenes with Q though)
<br>- A few bugs like NPC&apos;s missing in safe rooms but you can still hear them speaking. (I Just went through the broken mirror and back into the room to fix this bug, as the man reappeared) Also a bug in a safe room were the workbench disappeared until i saved the game and went back into the room. I&apos;m sure a patch will be out soon for these things and nothing game breaking so...
<br>- Seems to be slight lag between picking up item (E on keyboard) and Sebastian actually picking them up also same delay when switching weapons, but this could be only for K&amp;M rather then controller as have not tried that.
<br>
<br>Overall 9/10 and will be playing again on nightmare mode and classic mode when i have the time (only 7 saves allowed in classic mode)
<br>
<br>If you like survival horror this is a no brainer purchase especially if you can get it for &#xA3;23.99 like myself from a keys company. I put this just behind RE4 and level with RE code veronica.</span><span class="blurb_etc">&#x2026;</span> <a rel="nofollow" class="toggle_expand_collapse toggle_expand" href="/game/pc/the-evil-within-2/user-reviews?user_review_id=7607232">Expand</a></span>
            </div>
                            </div>
                                                        <div class="review_section review_actions ">
                                <ul class="review_actions">
                                                                            <li class="review_action review_helpful">
                                            <div class="review_helpful">
    <div class="rating_thumbs">
        			<div class="helpful_summary thumb_count">
				<a href="https://secure.metacritic.com/login">
				<span class="total_ups">1</span>
				of 
				<span class="total_thumbs">1</span>
				users found this helpful
                </a>
			</div>
                <div style="clear:both;"></div>
    </div>
</div>
                                        </li>
                                                                                                                                                <li class="review_action">
                                        <a href="/user/LastGunslinger">All this user&apos;s reviews</a>
                                    </li>
                                                                    </ul>
                            </div>
                            
                                                    </div>
                    </div></div></div></div>
                </li>
                                                                                    <li id="user_review_7631419" class="review user_review">
                    <div class="review_btm review_btm_r"><div class="review_btm review_btm_l"><div class="review_top review_top_r"><div class="review_top review_top_l">
                        <div class="review_content">
                            <div class="review_section">
                                <div class="review_stats">
                                    <div class="review_critic">
                                        <div class="name">
                                                                                            <a href="/user/kinglurian">kinglurian</a>
                                                                                                                                </div>

                                                                                    <div class="date">Oct 22, 2017</div>
                                                                            </div>
                                    
                                    <div class="review_grade">
                                                
<div class="metascore_w user medium game positive indiv perfect">10</div>

                                    </div>
                                </div>
                                <div class="review_body">
                                                        
                                        <span>The game is a masterpiece, the begginning is a little slower, but as you keep playing the game, he just become better and better. The history complete the story from the first game and end the journey of Sebastian Castellanos.
<br>
<br>Give a chance to the game guys, i want a sequel.</span>
            </div>
                            </div>
                                                        <div class="review_section review_actions ">
                                <ul class="review_actions">
                                                                            <li class="review_action review_helpful">
                                            <div class="review_helpful">
    <div class="rating_thumbs">
        			<div class="helpful_summary thumb_count">
				<a href="https://secure.metacritic.com/login">
				<span class="total_ups">1</span>
				of 
				<span class="total_thumbs">1</span>
				users found this helpful
                </a>
			</div>
                <div style="clear:both;"></div>
    </div>
</div>
                                        </li>
                                                                                                                                                <li class="review_action">
                                        <a href="/user/kinglurian">All this user&apos;s reviews</a>
                                    </li>
                                                                    </ul>
                            </div>
                            
                                                    </div>
                    </div></div></div></div>
                </li>
                                                                                    <li id="user_review_7634705" class="review user_review">
                    <div class="review_btm review_btm_r"><div class="review_btm review_btm_l"><div class="review_top review_top_r"><div class="review_top review_top_l">
                        <div class="review_content">
                            <div class="review_section">
                                <div class="review_stats">
                                    <div class="review_critic">
                                        <div class="name">
                                                                                            <a href="/user/byteme">byteme</a>
                                                                                                                                </div>

                                                                                    <div class="date">Oct 24, 2017</div>
                                                                            </div>
                                    
                                    <div class="review_grade">
                                                
<div class="metascore_w user medium game positive indiv perfect">10</div>

                                    </div>
                                </div>
                                <div class="review_body">
                                                        
                                        <span>The best game in years.I&apos;m tired of suspense, I need a completely complete story with a hint of the continuation of this universe.Sebastian must have.</span>
            </div>
                            </div>
                                                        <div class="review_section review_actions ">
                                <ul class="review_actions">
                                                                            <li class="review_action review_helpful">
                                            <div class="review_helpful">
    <div class="rating_thumbs">
        			<div class="helpful_summary thumb_count">
				<a href="https://secure.metacritic.com/login">
				<span class="total_ups">1</span>
				of 
				<span class="total_thumbs">1</span>
				users found this helpful
                </a>
			</div>
                <div style="clear:both;"></div>
    </div>
</div>
                                        </li>
                                                                                                                                                <li class="review_action">
                                        <a href="/user/byteme">All this user&apos;s reviews</a>
                                    </li>
                                                                    </ul>
                            </div>
                            
                                                    </div>
                    </div></div></div></div>
                </li>
                                                                                    <li id="user_review_7593506" class="review user_review">
                    <div class="review_btm review_btm_r"><div class="review_btm review_btm_l"><div class="review_top review_top_r"><div class="review_top review_top_l">
                        <div class="review_content">
                            <div class="review_section">
                                <div class="review_stats">
                                    <div class="review_critic">
                                        <div class="name">
                                                                                            <a href="/user/Drive637">Drive637</a>
                                                                                                                                </div>

                                                                                    <div class="date">Oct 13, 2017</div>
                                                                            </div>
                                    
                                    <div class="review_grade">
                                                
<div class="metascore_w user medium game positive indiv">9</div>

                                    </div>
                                </div>
                                <div class="review_body">
                                                        
                                        <span class="inline_expand_collapse inline_collapsed" id="review_blurb_7593506"><span class="blurb blurb_collapsed">That&apos;s a very good second entrance from Tango we got here.
<br>
<br>I&apos;ve just beaten the game in Nightmare and I was overall delighted with the way the game handles its new orientation. It has an interesting way of delivering its core elements to the player.

The whole game is taking place in the city of Union, pivotal place giving off plenty of room for exploration through semi-open areas.</span><span class="blurb blurb_expanded">That&apos;s a very good second entrance from Tango we got here.
<br>
<br>I&apos;ve just beaten the game in Nightmare and I was overall delighted with the way the game handles its new orientation. It has an interesting way of delivering its core elements to the player.
<br>
<br>The whole game is taking place in the city of Union, pivotal place giving off plenty of room for exploration through semi-open areas. The game design is thought in such a way that you alternate between narrow places focusing on frenzied chase scenes and more open scenery prone to exploration. As far as I&apos;m concerned the parts unfolding &quot;inside&quot; were the most thrilling as it&apos;s mainly during those closed sequences that the real survival/horrific touch springs. I recommend playing in Nightmare because the challenge is present and also because the game design choices won&apos;t make you feel uncomfortable or frustrated in any way. If you plan your escape properly relying on infiltration (you&apos;ll have to do so in Nightmare, trust me) the outcome will be rewarding because you&apos;ll save bullets and also sweat a lot from time to time for fear of getting your head topped off - some death scenes are horrendously graphic, good thing in a TEW game. While sometimes you&apos;ll be forced to run as fast as you can, you&apos;ll also have to bring out the big underloaded guns so as to make heads fall off. Given that ammunition is more a of rare commodity in this mode (though the lack never turns out to be an artificial attempt to spice up the global challenge if you thoroughly search your surroundings) shooting at enemies will always require a good aim just as did the first episode and this is an important element when it comes to inducing anxiousness. The game itself is not as terrifying as an Amnesia or Outlast primarily because of this alternation between the inside and the outside - the outside being thought as a way to take a breather between two insane sequences.
<br>
<br>The atmosphere is absolutely riveting and spine-tiggling. Both the pretty graphics (especially on PC) and FX sounds are the root of this result. A lot of questions find answers and the scenario more personal this time is very pleasant to follow. I find it good that the developers put Sebastian in the center of the plot this time. It was high time they set him forth. He&apos;s a lot more well written than before, giving rise to a more human, touching and sensitive figure. Big up to Stefano Valentini who is to my mind the best-rendered ingame antagonist alongside Obscura.
<br>
<br>Good Points :
<br>- Well-written story
<br>- Stefano Valentini has a great fu*ked up personality
<br>- Pretty-looking (especially on PC)
<br>- More accurate aiming system than in the first
<br>- Shooting, running and stealth scenes feel good
<br>- Awesome bestiary chara design, gruesomely beautiful enemies (Well Sebastian&apos;s definitely a classy detective)
<br>- Quite lengthy for such a game (20h)
<br>- Smartly implemented crafting system
<br>- The bosses (Stefano)
<br>- Clearer story
<br>- Alternations inside/outside, a good idea...
<br>
<br>Negative points :
<br>- ...resulting in a less blistering terror pace
<br>- Rigid animations (movements)
<br>- Minor collision bugs
<br>
<br>This game doesn&apos;t revolutionize anything but the execution of its mechanics is indubitably qualitative. We get to delve into a hellacious story with many strong points one should definitely consider experiencing. Do not expect this game to turn your blood into ice like Outlast or Amnesia because it&apos;s not as terrifying (neither was the first game btw) but do expect however a wacko journey that will have you venture into a twisted and impressively well rendered mad world where rationalism seems to be an intruder. A really good experience. If you loved the first iteration of the series and are fond of singular survival-horror experiences, you definitely should consider giving TEW 2 a try.</span><span class="blurb_etc">&#x2026;</span> <a rel="nofollow" class="toggle_expand_collapse toggle_expand" href="/game/pc/the-evil-within-2/user-reviews?user_review_id=7593506">Expand</a></span>
            </div>
                            </div>
                                                        <div class="review_section review_actions ">
                                <ul class="review_actions">
                                                                            <li class="review_action review_helpful">
                                            <div class="review_helpful">
    <div class="rating_thumbs">
        			<div class="helpful_summary thumb_count">
				<a href="https://secure.metacritic.com/login">
				<span class="total_ups">7</span>
				of 
				<span class="total_thumbs">9</span>
				users found this helpful
                </a>
			</div>
                <div style="clear:both;"></div>
    </div>
</div>
                                        </li>
                                                                                                                                                <li class="review_action">
                                        <a href="/user/Drive637">All this user&apos;s reviews</a>
                                    </li>
                                                                    </ul>
                            </div>
                            
                                                    </div>
                    </div></div></div></div>
                </li>
                                                                                    <li id="user_review_7594012" class="review user_review">
                    <div class="review_btm review_btm_r"><div class="review_btm review_btm_l"><div class="review_top review_top_r"><div class="review_top review_top_l">
                        <div class="review_content">
                            <div class="review_section">
                                <div class="review_stats">
                                    <div class="review_critic">
                                        <div class="name">
                                                                                            <a href="/user/Gabe20007">Gabe20007</a>
                                                                                                                                </div>

                                                                                    <div class="date">Oct 12, 2017</div>
                                                                            </div>
                                    
                                    <div class="review_grade">
                                                
<div class="metascore_w user medium game positive indiv perfect">10</div>

                                    </div>
                                </div>
                                <div class="review_body">
                                                        
                                        <span>The Evil Within 2 redeemed the first one on every aspect, superior to any RE game in the last years, Shinji Mikami truly make things right this time .</span>
            </div>
                            </div>
                                                        <div class="review_section review_actions ">
                                <ul class="review_actions">
                                                                            <li class="review_action review_helpful">
                                            <div class="review_helpful">
    <div class="rating_thumbs">
        			<div class="helpful_summary thumb_count">
				<a href="https://secure.metacritic.com/login">
				<span class="total_ups">13</span>
				of 
				<span class="total_thumbs">17</span>
				users found this helpful
                </a>
			</div>
                <div style="clear:both;"></div>
    </div>
</div>
                                        </li>
                                                                                                                                                <li class="review_action">
                                        <a href="/user/Gabe20007">All this user&apos;s reviews</a>
                                    </li>
                                                                    </ul>
                            </div>
                            
                                                    </div>
                    </div></div></div></div>
                </li>
                                                                                    <li id="user_review_7596916" class="review user_review">
                    <div class="review_btm review_btm_r"><div class="review_btm review_btm_l"><div class="review_top review_top_r"><div class="review_top review_top_l">
                        <div class="review_content">
                            <div class="review_section">
                                <div class="review_stats">
                                    <div class="review_critic">
                                        <div class="name">
                                                                                            <a href="/user/Avadon">Avadon</a>
                                                                                                                                </div>

                                                                                    <div class="date">Oct 13, 2017</div>
                                                                            </div>
                                    
                                    <div class="review_grade">
                                                
<div class="metascore_w user medium game positive indiv perfect">10</div>

                                    </div>
                                </div>
                                <div class="review_body">
                                                        
                                        <span class="inline_expand_collapse inline_collapsed" id="review_blurb_7596916"><span class="blurb blurb_collapsed">Well this is...unexpected. I did not like the first game too much. The PC version was bad and my main issue with it is that it just wasn&apos;t effective at being scary or tense or interesting or anything other than gruesome and annoying. It felt like a AAA publisher carelessly stomping on a genre that they don&apos;t understand.
<br>
<br>This, on the other hand...is hard to review without spoiling it. I</span><span class="blurb blurb_expanded">Well this is...unexpected. I did not like the first game too much. The PC version was bad and my main issue with it is that it just wasn&apos;t effective at being scary or tense or interesting or anything other than gruesome and annoying. It felt like a AAA publisher carelessly stomping on a genre that they don&apos;t understand.
<br>
<br>This, on the other hand...is hard to review without spoiling it. I will say this though, this time it is VERY effective. When it wants you to feel panic and run, you do. When it wants you to breath in its decaying atmosphere and feel claustrophobia, you absolutely do. And it switches between those two modes constantly without ever feeling disjointed. It also wants you to wander around freely and explore, while also feeling like a carefully directed experience at the same time. Impossible, right? Turns out, no, it isn&apos;t. It also wants you to feel both powerful and frail at the same time, it wants the power fantasy of Resident Evil 5, but it wants you to be terrified that one misplayed confrontation will send it all crashing down. It succeeds. Oh, and it also wants to make you care about its characters and story. It does.
<br>
<br>Evil Within 2 constantly walks on a tightrope while trying to balance opposites. The slight mistake could lead to you uninstalling it on the spot. It doesn&apos;t make that mistake. I will give it a 10, not because it is a perfect game, but because in my opinion it is a perfect sequel. It improves on Evil Within 1 as significantly as Silent hill 2 or Half Life 2 did on their part 1&apos;s. If you like survival horror, don&apos;t ignore this.</span><span class="blurb_etc">&#x2026;</span> <a rel="nofollow" class="toggle_expand_collapse toggle_expand" href="/game/pc/the-evil-within-2/user-reviews?user_review_id=7596916">Expand</a></span>
            </div>
                            </div>
                                                        <div class="review_section review_actions ">
                                <ul class="review_actions">
                                                                            <li class="review_action review_helpful">
                                            <div class="review_helpful">
    <div class="rating_thumbs">
        			<div class="helpful_summary thumb_count">
				<a href="https://secure.metacritic.com/login">
				<span class="total_ups">6</span>
				of 
				<span class="total_thumbs">8</span>
				users found this helpful
                </a>
			</div>
                <div style="clear:both;"></div>
    </div>
</div>
                                        </li>
                                                                                                                                                <li class="review_action">
                                        <a href="/user/Avadon">All this user&apos;s reviews</a>
                                    </li>
                                                                    </ul>
                            </div>
                            
                                                    </div>
                    </div></div></div></div>
                </li>
                                                                                    <li id="user_review_7608638" class="review user_review">
                    <div class="review_btm review_btm_r"><div class="review_btm review_btm_l"><div class="review_top review_top_r"><div class="review_top review_top_l">
                        <div class="review_content">
                            <div class="review_section">
                                <div class="review_stats">
                                    <div class="review_critic">
                                        <div class="name">
                                                                                            <a href="/user/CharlyPlayman">CharlyPlayman</a>
                                                                                                                                </div>

                                                                                    <div class="date">Oct 27, 2017</div>
                                                                            </div>
                                    
                                    <div class="review_grade">
                                                
<div class="metascore_w user medium game positive indiv">8</div>

                                    </div>
                                </div>
                                <div class="review_body">
                                                        
                                        <span>I didn&apos;t like the first but The Evil Within 2 has improve everything. This 2nd part is much better as the previous one.
<br>PROS: Interesting story + Nice weapons &amp; crafting system + Good ambient &amp; graphics + Good side missions + Much to explore and different ways to cope the missions + Balanced checkpoints + etc
<br>
<br>CONS: Total manual camera + No gamepad custom buttons</span>
            </div>
                            </div>
                                                        <div class="review_section review_actions ">
                                <ul class="review_actions">
                                                                            <li class="review_action review_helpful">
                                            <div class="review_helpful">
    <div class="rating_thumbs">
        			<div class="helpful_summary thumb_count">
				<a href="https://secure.metacritic.com/login">
				<span class="total_ups">3</span>
				of 
				<span class="total_thumbs">4</span>
				users found this helpful
                </a>
			</div>
                <div style="clear:both;"></div>
    </div>
</div>
                                        </li>
                                                                                                                                                <li class="review_action">
                                        <a href="/user/CharlyPlayman">All this user&apos;s reviews</a>
                                    </li>
                                                                    </ul>
                            </div>
                            
                                                    </div>
                    </div></div></div></div>
                </li>
                                                                                    <li id="user_review_7601256" class="review user_review">
                    <div class="review_btm review_btm_r"><div class="review_btm review_btm_l"><div class="review_top review_top_r"><div class="review_top review_top_l">
                        <div class="review_content">
                            <div class="review_section">
                                <div class="review_stats">
                                    <div class="review_critic">
                                        <div class="name">
                                                                                            <a href="/user/kiyevksaya">kiyevksaya</a>
                                                                                                                                </div>

                                                                                    <div class="date">Oct 15, 2017</div>
                                                                            </div>
                                    
                                    <div class="review_grade">
                                                
<div class="metascore_w user medium game positive indiv perfect">10</div>

                                    </div>
                                </div>
                                <div class="review_body">
                                                        
                                        <span>Excellent game, it takes everything from the first one, and makes it a hundred times better, absolutely loved it, despite de collision bugs, it was just perfect, a survival horror at it finest.</span>
            </div>
                            </div>
                                                        <div class="review_section review_actions ">
                                <ul class="review_actions">
                                                                            <li class="review_action review_helpful">
                                            <div class="review_helpful">
    <div class="rating_thumbs">
        			<div class="helpful_summary thumb_count">
				<a href="https://secure.metacritic.com/login">
				<span class="total_ups">3</span>
				of 
				<span class="total_thumbs">4</span>
				users found this helpful
                </a>
			</div>
                <div style="clear:both;"></div>
    </div>
</div>
                                        </li>
                                                                                                                                                <li class="review_action">
                                        <a href="/user/kiyevksaya">All this user&apos;s reviews</a>
                                    </li>
                                                                    </ul>
                            </div>
                            
                                                    </div>
                    </div></div></div></div>
                </li>
                                                                                    <li id="user_review_7594894" class="review user_review">
                    <div class="review_btm review_btm_r"><div class="review_btm review_btm_l"><div class="review_top review_top_r"><div class="review_top review_top_l">
                        <div class="review_content">
                            <div class="review_section">
                                <div class="review_stats">
                                    <div class="review_critic">
                                        <div class="name">
                                                                                            <a href="/user/Rjordian">Rjordian</a>
                                                                                                                                </div>

                                                                                    <div class="date">Oct 13, 2017</div>
                                                                            </div>
                                    
                                    <div class="review_grade">
                                                
<div class="metascore_w user medium game positive indiv perfect">10</div>

                                    </div>
                                </div>
                                <div class="review_body">
                                                        
                                        <span>Finally seems like the producers have come out of the negative spiral that enveloped the first chapter full of bugs and many other kind of mistakes. The game looks solid in all the aspects, Graphics, soundtracks, fear and mistery. Enjoyable gameplay and most of all you never know what awaits you 2 steps ahead. Strongly recommended.</span>
            </div>
                            </div>
                                                        <div class="review_section review_actions ">
                                <ul class="review_actions">
                                                                            <li class="review_action review_helpful">
                                            <div class="review_helpful">
    <div class="rating_thumbs">
        			<div class="helpful_summary thumb_count">
				<a href="https://secure.metacritic.com/login">
				<span class="total_ups">6</span>
				of 
				<span class="total_thumbs">9</span>
				users found this helpful
                </a>
			</div>
                <div style="clear:both;"></div>
    </div>
</div>
                                        </li>
                                                                                                                                                <li class="review_action">
                                        <a href="/user/Rjordian">All this user&apos;s reviews</a>
                                    </li>
                                                                    </ul>
                            </div>
                            
                                                    </div>
                    </div></div></div></div>
                </li>
                                                                                    <li id="user_review_7599080" class="review user_review">
                    <div class="review_btm review_btm_r"><div class="review_btm review_btm_l"><div class="review_top review_top_r"><div class="review_top review_top_l">
                        <div class="review_content">
                            <div class="review_section">
                                <div class="review_stats">
                                    <div class="review_critic">
                                        <div class="name">
                                                                                            <a href="/user/ahm4691">ahm4691</a>
                                                                                                                                </div>

                                                                                    <div class="date">Oct 14, 2017</div>
                                                                            </div>
                                    
                                    <div class="review_grade">
                                                
<div class="metascore_w user medium game positive indiv perfect">10</div>

                                    </div>
                                </div>
                                <div class="review_body">
                                                        
                                        <span>The Evil Within 2 is so good  that i decided to play on nightmare difficulty just to get best out of it i love the first one and the second and i will for sure play new game plus over and over again</span>
            </div>
                            </div>
                                                        <div class="review_section review_actions ">
                                <ul class="review_actions">
                                                                            <li class="review_action review_helpful">
                                            <div class="review_helpful">
    <div class="rating_thumbs">
        			<div class="helpful_summary thumb_count">
				<a href="https://secure.metacritic.com/login">
				<span class="total_ups">4</span>
				of 
				<span class="total_thumbs">6</span>
				users found this helpful
                </a>
			</div>
                <div style="clear:both;"></div>
    </div>
</div>
                                        </li>
                                                                                                                                                <li class="review_action">
                                        <a href="/user/ahm4691">All this user&apos;s reviews</a>
                                    </li>
                                                                    </ul>
                            </div>
                            
                                                    </div>
                    </div></div></div></div>
                </li>
                                                                                    <li id="user_review_7599365" class="review user_review">
                    <div class="review_btm review_btm_r"><div class="review_btm review_btm_l"><div class="review_top review_top_r"><div class="review_top review_top_l">
                        <div class="review_content">
                            <div class="review_section">
                                <div class="review_stats">
                                    <div class="review_critic">
                                        <div class="name">
                                                                                            <a href="/user/Vilogi">Vilogi</a>
                                                                                                                                </div>

                                                                                    <div class="date">Oct 14, 2017</div>
                                                                            </div>
                                    
                                    <div class="review_grade">
                                                
<div class="metascore_w user medium game positive indiv">8</div>

                                    </div>
                                </div>
                                <div class="review_body">
                                                        
                                        <span class="inline_expand_collapse inline_collapsed" id="review_blurb_7599365"><span class="blurb blurb_collapsed">I have been playing resident evil since it came out for sega saturn. Love the survival horror genre. This game does belong in the genre, but to be fair it is more &quot; the last of us on crack&quot; as opposed to &quot;resident evil &quot; style... puzzles are garbage, or it would get a 9. The graphics, voice acting all OK. My game is running on ps PRo , but lagging a bit in some areas which REALLY kills the</span><span class="blurb blurb_expanded">I have been playing resident evil since it came out for sega saturn. Love the survival horror genre. This game does belong in the genre, but to be fair it is more &quot; the last of us on crack&quot; as opposed to &quot;resident evil &quot; style... puzzles are garbage, or it would get a 9. The graphics, voice acting all OK. My game is running on ps PRo , but lagging a bit in some areas which REALLY kills the tension. Overall, im happy with this, as it was needed for the Friday the 13th vibe. If this came out in any other month than october, we would probably see 7-8 scores across the board. VAST improvement over 1, which i did not bother to finish.</span><span class="blurb_etc">&#x2026;</span> <a rel="nofollow" class="toggle_expand_collapse toggle_expand" href="/game/pc/the-evil-within-2/user-reviews?user_review_id=7599365">Expand</a></span>
            </div>
                            </div>
                                                        <div class="review_section review_actions ">
                                <ul class="review_actions">
                                                                            <li class="review_action review_helpful">
                                            <div class="review_helpful">
    <div class="rating_thumbs">
        			<div class="helpful_summary thumb_count">
				<a href="https://secure.metacritic.com/login">
				<span class="total_ups">4</span>
				of 
				<span class="total_thumbs">6</span>
				users found this helpful
                </a>
			</div>
                <div style="clear:both;"></div>
    </div>
</div>
                                        </li>
                                                                                                                                                <li class="review_action">
                                        <a href="/user/Vilogi">All this user&apos;s reviews</a>
                                    </li>
                                                                    </ul>
                            </div>
                            
                                                    </div>
                    </div></div></div></div>
                </li>
                                                                                    <li id="user_review_7614874" class="review user_review">
                    <div class="review_btm review_btm_r"><div class="review_btm review_btm_l"><div class="review_top review_top_r"><div class="review_top review_top_l">
                        <div class="review_content">
                            <div class="review_section">
                                <div class="review_stats">
                                    <div class="review_critic">
                                        <div class="name">
                                                                                            <a href="/user/TanSula">TanSula</a>
                                                                                                                                </div>

                                                                                    <div class="date">Oct 28, 2017</div>
                                                                            </div>
                                    
                                    <div class="review_grade">
                                                
<div class="metascore_w user medium game positive indiv perfect">10</div>

                                    </div>
                                </div>
                                <div class="review_body">
                                                        
                                        <span class="inline_expand_collapse inline_collapsed" id="review_blurb_7614874"><span class="blurb blurb_collapsed">&#x414;&#x430;&#x436;&#x435; &#x43B;&#x443;&#x447;&#x448;&#x435; &#x43F;&#x435;&#x440;&#x432;&#x43E;&#x439; &#x447;&#x430;&#x441;&#x442;&#x438;. &#x41D;&#x435; &#x43E;&#x436;&#x438;&#x434;&#x430;&#x43B; &#x442;&#x430;&#x43A;&#x43E;&#x433;&#x43E; &#x43A;&#x430;&#x447;&#x435;&#x441;&#x442;&#x432;&#x435;&#x43D;&#x43D;&#x43E;&#x433;&#x43E; &#x43F;&#x440;&#x43E;&#x434;&#x43E;&#x43B;&#x436;&#x435;&#x43D;&#x438;&#x44F;. &#x415;&#x441;&#x43B;&#x438; &#x43A;&#x440;&#x430;&#x442;&#x43A;&#x43E;, &#x442;&#x43E; &#x440;&#x430;&#x437;&#x440;&#x430;&#x431;&#x43E;&#x442;&#x447;&#x438;&#x43A;&#x438; &#x438;&#x441;&#x43F;&#x440;&#x430;&#x432;&#x438;&#x43B;&#x438; &#x43E;&#x448;&#x438;&#x431;&#x43A;&#x438; &#x43F;&#x435;&#x440;&#x432;&#x43E;&#x439; &#x447;&#x430;&#x441;&#x442;&#x438; &#x438; &#x443;&#x43B;&#x443;&#x447;&#x448;&#x438;&#x43B;&#x438; &#x432;&#x441;&#x435; &#x43F;&#x43B;&#x44E;&#x441;&#x44B; &#x432;&#x442;&#x43E;&#x440;&#x43E;&#x439;. &#x414;&#x430;, &#x433;&#x435;&#x439;&#x43C;&#x43F;&#x43B;&#x435;&#x439; &#x432;&#x441;&#x451; &#x435;&#x449;&#x451; &#x43D;&#x435;&#x43C;&#x43D;&#x43E;&#x433;&#x43E; &#x43F;&#x43E;&#x441;&#x440;&#x435;&#x434;&#x441;&#x442;&#x432;&#x435;&#x43D;&#x43D;&#x44B;&#x439;, &#x43D;&#x43E; &#x441;&#x44E;&#x436;&#x435;&#x442; &#x438; &#x430;&#x442;&#x43C;&#x43E;&#x441;&#x444;&#x435;&#x440;&#x430; &#x432;&#x441;&#x451; &#x432;&#x44B;&#x442;&#x44F;&#x433;&#x438;&#x432;&#x430;&#x44E;&#x442;.</span><span class="blurb blurb_expanded">&#x414;&#x430;&#x436;&#x435; &#x43B;&#x443;&#x447;&#x448;&#x435; &#x43F;&#x435;&#x440;&#x432;&#x43E;&#x439; &#x447;&#x430;&#x441;&#x442;&#x438;. &#x41D;&#x435; &#x43E;&#x436;&#x438;&#x434;&#x430;&#x43B; &#x442;&#x430;&#x43A;&#x43E;&#x433;&#x43E; &#x43A;&#x430;&#x447;&#x435;&#x441;&#x442;&#x432;&#x435;&#x43D;&#x43D;&#x43E;&#x433;&#x43E; &#x43F;&#x440;&#x43E;&#x434;&#x43E;&#x43B;&#x436;&#x435;&#x43D;&#x438;&#x44F;. &#x415;&#x441;&#x43B;&#x438; &#x43A;&#x440;&#x430;&#x442;&#x43A;&#x43E;, &#x442;&#x43E; &#x440;&#x430;&#x437;&#x440;&#x430;&#x431;&#x43E;&#x442;&#x447;&#x438;&#x43A;&#x438; &#x438;&#x441;&#x43F;&#x440;&#x430;&#x432;&#x438;&#x43B;&#x438; &#x43E;&#x448;&#x438;&#x431;&#x43A;&#x438; &#x43F;&#x435;&#x440;&#x432;&#x43E;&#x439; &#x447;&#x430;&#x441;&#x442;&#x438; &#x438; &#x443;&#x43B;&#x443;&#x447;&#x448;&#x438;&#x43B;&#x438; &#x432;&#x441;&#x435; &#x43F;&#x43B;&#x44E;&#x441;&#x44B; &#x432;&#x442;&#x43E;&#x440;&#x43E;&#x439;. &#x414;&#x430;, &#x433;&#x435;&#x439;&#x43C;&#x43F;&#x43B;&#x435;&#x439; &#x432;&#x441;&#x451; &#x435;&#x449;&#x451; &#x43D;&#x435;&#x43C;&#x43D;&#x43E;&#x433;&#x43E; &#x43F;&#x43E;&#x441;&#x440;&#x435;&#x434;&#x441;&#x442;&#x432;&#x435;&#x43D;&#x43D;&#x44B;&#x439;, &#x43D;&#x43E; &#x441;&#x44E;&#x436;&#x435;&#x442; &#x438; &#x430;&#x442;&#x43C;&#x43E;&#x441;&#x444;&#x435;&#x440;&#x430; &#x432;&#x441;&#x451; &#x432;&#x44B;&#x442;&#x44F;&#x433;&#x438;&#x432;&#x430;&#x44E;&#x442;.</span></span>
            </div>
                            </div>
                                                        <div class="review_section review_actions ">
                                <ul class="review_actions">
                                                                            <li class="review_action review_helpful">
                                            <div class="review_helpful">
    <div class="rating_thumbs">
        			<div class="helpful_summary thumb_count">
				<a href="https://secure.metacritic.com/login">
				<span class="total_ups">2</span>
				of 
				<span class="total_thumbs">3</span>
				users found this helpful
                </a>
			</div>
                <div style="clear:both;"></div>
    </div>
</div>
                                        </li>
                                                                                                                                                <li class="review_action">
                                        <a href="/user/TanSula">All this user&apos;s reviews</a>
                                    </li>
                                                                    </ul>
                            </div>
                            
                                                    </div>
                    </div></div></div></div>
                </li>
                                                                                    <li id="user_review_7628647" class="review user_review">
                    <div class="review_btm review_btm_r"><div class="review_btm review_btm_l"><div class="review_top review_top_r"><div class="review_top review_top_l">
                        <div class="review_content">
                            <div class="review_section">
                                <div class="review_stats">
                                    <div class="review_critic">
                                        <div class="name">
                                                                                            <a href="/user/HarlanDrakon">HarlanDrakon</a>
                                                                                                                                </div>

                                                                                    <div class="date">Oct 21, 2017</div>
                                                                            </div>
                                    
                                    <div class="review_grade">
                                                
<div class="metascore_w user medium game positive indiv">9</div>

                                    </div>
                                </div>
                                <div class="review_body">
                                                        
                                        <span class="inline_expand_collapse inline_collapsed" id="review_blurb_7628647"><span class="blurb blurb_collapsed">The Evil Within 2 is an incredibly addictive and fun experience, while also feeling much better in it&apos;s own skin compared to it&apos;s predecessor. Although I found myself enjoying the first game as well, this sequel really managed to do what sequels generally should, but often don&apos;t - take the unique and essential parts of the previous game, and make it better while also throwing in something</span><span class="blurb blurb_expanded">The Evil Within 2 is an incredibly addictive and fun experience, while also feeling much better in it&apos;s own skin compared to it&apos;s predecessor. Although I found myself enjoying the first game as well, this sequel really managed to do what sequels generally should, but often don&apos;t - take the unique and essential parts of the previous game, and make it better while also throwing in something new. The story, which is arguably the worst aspect of the first game, is at the very least, solid, and by the end of the game you realize that you actually started to care and sympathize with these characters, an important part of the gameplay the original is completely oblivious to. The plot is much more understandable and better paced, with more emotion and yes, even better acting.. but what helped the story of The Evil Within 2 the most, is the drive of the main character. Sebastian in the first game is a brave, but oddly indifferent detective who wants to do the right thing, busting heads and telling bad jokes on the way. Pretty much a bleak buffoon of a character with no clear motivation. Sebastian in the second game is a father, a husband, a mistrusting friend, a washed-up cop, a man who lost everything, and also a man with a second chance at life.. sure, he&apos;s still a little brash and grizzled, but hey - that&apos;s okay, because now he HAS DRIVE. The grotesque and dark gothic feel of dread of the first game was toned down as well, to a more tasteful and meaningful measure. The gameplay mechanics are pretty similar, with some clear inspiration taken from The Last Of Us - also something I met with a smile, as it blends well with the game as a whole. The first instalment was a heavily-violent bundle of a bunch of different games relatively skillfully blended into one. The second one is a game of it&apos;s own. It&apos;s not a perfect game, but it&apos;s a big step in the right direction. Should the third instalment be better from the second as much as the second was from the first, we might just be looking at a new game of the year. In my book, this game is exactly 8.5/10, but since it&apos;s really entertaining, I&apos;ll give it a 9. Cheers.</span><span class="blurb_etc">&#x2026;</span> <a rel="nofollow" class="toggle_expand_collapse toggle_expand" href="/game/pc/the-evil-within-2/user-reviews?user_review_id=7628647">Expand</a></span>
            </div>
                            </div>
                                                        <div class="review_section review_actions ">
                                <ul class="review_actions">
                                                                            <li class="review_action review_helpful">
                                            <div class="review_helpful">
    <div class="rating_thumbs">
        			<div class="helpful_summary thumb_count">
				<a href="https://secure.metacritic.com/login">
				<span class="total_ups">1</span>
				of 
				<span class="total_thumbs">2</span>
				users found this helpful
                </a>
			</div>
                <div style="clear:both;"></div>
    </div>
</div>
                                        </li>
                                                                                                                                                <li class="review_action">
                                        <a href="/user/HarlanDrakon">All this user&apos;s reviews</a>
                                    </li>
                                                                    </ul>
                            </div>
                            
                                                    </div>
                    </div></div></div></div>
                </li>
                                                                                    <li id="user_review_7611531" class="review user_review">
                    <div class="review_btm review_btm_r"><div class="review_btm review_btm_l"><div class="review_top review_top_r"><div class="review_top review_top_l">
                        <div class="review_content">
                            <div class="review_section">
                                <div class="review_stats">
                                    <div class="review_critic">
                                        <div class="name">
                                                                                            <a href="/user/SofaTrooper">SofaTrooper</a>
                                                                                                                                </div>

                                                                                    <div class="date">Nov 12, 2017</div>
                                                                            </div>
                                    
                                    <div class="review_grade">
                                                
<div class="metascore_w user medium game positive indiv perfect">10</div>

                                    </div>
                                </div>
                                <div class="review_body">
                                                        
                                        <span>A surprisingly emotional experience that had me gripped from start to finish.  Even if you&apos;re not a horror fan you should play Evil within 2.  One of my favorite games of 2017.</span>
            </div>
                            </div>
                                                        <div class="review_section review_actions ">
                                <ul class="review_actions">
                                                                            <li class="review_action review_helpful">
                                            <div class="review_helpful">
    <div class="rating_thumbs">
        			<div class="helpful_summary thumb_count">
				<a href="https://secure.metacritic.com/login">
				<span class="total_ups">1</span>
				of 
				<span class="total_thumbs">3</span>
				users found this helpful
                </a>
			</div>
                <div style="clear:both;"></div>
    </div>
</div>
                                        </li>
                                                                                                                                                <li class="review_action">
                                        <a href="/user/SofaTrooper">All this user&apos;s reviews</a>
                                    </li>
                                                                    </ul>
                            </div>
                            
                                                    </div>
                    </div></div></div></div>
                </li>
                                                                                    <li id="user_review_7599706" class="review user_review">
                    <div class="review_btm review_btm_r"><div class="review_btm review_btm_l"><div class="review_top review_top_r"><div class="review_top review_top_l">
                        <div class="review_content">
                            <div class="review_section">
                                <div class="review_stats">
                                    <div class="review_critic">
                                        <div class="name">
                                                                                            <a href="/user/Val-835">Val-835</a>
                                                                                                                                </div>

                                                                                    <div class="date">Oct 14, 2017</div>
                                                                            </div>
                                    
                                    <div class="review_grade">
                                                
<div class="metascore_w user medium game negative indiv">2</div>

                                    </div>
                                </div>
                                <div class="review_body">
                                                        
                                        <span class="inline_expand_collapse inline_collapsed" id="review_blurb_7599706"><span class="blurb blurb_collapsed">Here we are. 2017. After playing &quot;Prey&quot; over the summer ( what a great game ), I was dumb enough to give this one a try. Rinse and repeat. Rinse and repeat. What a boring game. Lousy story. Predictable action. I had to try hard on this one to keep going. What&apos;s annoying with these game developers is their cynicism. The same formula over and over again. Nothing new. And then they complain</span><span class="blurb blurb_expanded">Here we are. 2017. After playing &quot;Prey&quot; over the summer ( what a great game ), I was dumb enough to give this one a try. Rinse and repeat. Rinse and repeat. What a boring game. Lousy story. Predictable action. I had to try hard on this one to keep going. What&apos;s annoying with these game developers is their cynicism. The same formula over and over again. Nothing new. And then they complain about poor sales. Can&apos;t say nothing more. I gave it a 2 for graphics. That&apos;s about it. It&apos;s 2017. And game developers are still stuck in 2001. Let&apos;s hope Virtual Reality will change things.</span><span class="blurb_etc">&#x2026;</span> <a rel="nofollow" class="toggle_expand_collapse toggle_expand" href="/game/pc/the-evil-within-2/user-reviews?user_review_id=7599706">Expand</a></span>
            </div>
                            </div>
                                                        <div class="review_section review_actions ">
                                <ul class="review_actions">
                                                                            <li class="review_action review_helpful">
                                            <div class="review_helpful">
    <div class="rating_thumbs">
        			<div class="helpful_summary thumb_count">
				<a href="https://secure.metacritic.com/login">
				<span class="total_ups">4</span>
				of 
				<span class="total_thumbs">15</span>
				users found this helpful
                </a>
			</div>
                <div style="clear:both;"></div>
    </div>
</div>
                                        </li>
                                                                                                                                                <li class="review_action">
                                        <a href="/user/Val-835">All this user&apos;s reviews</a>
                                    </li>
                                                                    </ul>
                            </div>
                            
                                                    </div>
                    </div></div></div></div>
                </li>
                                                                                    <li id="user_review_7599331" class="review user_review">
                    <div class="review_btm review_btm_r"><div class="review_btm review_btm_l"><div class="review_top review_top_r"><div class="review_top review_top_l">
                        <div class="review_content">
                            <div class="review_section">
                                <div class="review_stats">
                                    <div class="review_critic">
                                        <div class="name">
                                                                                            <a href="/user/elitepredetor99">elitepredetor99</a>
                                                                                                                                </div>

                                                                                    <div class="date">Oct 26, 2017</div>
                                                                            </div>
                                    
                                    <div class="review_grade">
                                                
<div class="metascore_w user medium game positive indiv">8</div>

                                    </div>
                                </div>
                                <div class="review_body">
                                                        
                                        <span class="inline_expand_collapse inline_collapsed" id="review_blurb_7599331"><span class="blurb blurb_collapsed">Story:
<br>
<br>Great game to begin with:

The story was a bit absurd and exaggerated which left me with so many questions and I felt like it didn&apos;t fit the game, it felt very different from the original which was all about being inside the stem with no idea if what was happening real or not. It would of been better in my opinion if it carried of from number 1 with Ruvik. However i guess that</span><span class="blurb blurb_expanded">Story:
<br>
<br>Great game to begin with:
<br>
<br>The story was a bit absurd and exaggerated which left me with so many questions and I felt like it didn&apos;t fit the game, it felt very different from the original which was all about being inside the stem with no idea if what was happening real or not. It would of been better in my opinion if it carried of from number 1 with Ruvik. However i guess that story&apos;s next par is for another Evil within game or a DLC.
<br>
<br>One thing i really like about this game though is the references to the original game which felt really connected and really made the game feel like the game was a close sequel to The evil within 1 with a different story. References such as Safe Head, Laura, Sadist, Flash backs, talks about the previous events, Beacon hospital references and so on, also the return of Tatianna which in this game is properly done, in this game the nurse has a proper character and interacts with Sebastian a lot more, we get to learn so much more about her and why she is what she is.
<br>
<br>Gameplay:
<br>
<br>I found this game way too easy, i completed my first play through on Nightmare and it felt nothing like the originals difficulty, it was even easier than survival on the original in my opinion, and the reason for the has to be the overpowered skills such as a stealth perk which completely breaks the game and removes basically all need to use any other weapons towards 75% of the enemies. apart from it being too easy i found it really enjoyable especially the open world sections with all the side quests and loot gathering.
<br>
<br>Cons:
<br>I have a couple minor cons about this game.
<br>
<br>one of the main being the terrible mini bosses in my opinion, none of the mini bosses were able to match the mini bosses from the original such as safe head and Laura. actually the enemies all together felt like a step back from the original, the game was lacking in enemy variety.
<br>
<br>the progression. Another con i have for this game is the progression. the reason this is a flaw is because i found that the progression in this game was far too fast and easy, within the first 2 hours i was able to get my character set to finish the whole game with ease. i was able to make it to the final boss with 600+ gun powder, 70+ Herds, Full ammo including bolt in all weapons and pouches, i didn&apos;t even have to craft a single syringe in my Nightmare play through, and crafted minimal ammo which i only did craft towards the end because i felt like i was saving so much resources for no reason.
<br>
<br>And my final con is how fast the game skipped chapters, some chapters literally took 15 mins to pass.</span><span class="blurb_etc">&#x2026;</span> <a rel="nofollow" class="toggle_expand_collapse toggle_expand" href="/game/pc/the-evil-within-2/user-reviews?user_review_id=7599331">Expand</a></span>
            </div>
                            </div>
                                                        <div class="review_section review_actions ">
                                <ul class="review_actions">
                                                                            <li class="review_action review_helpful">
                                            <div class="review_helpful">
    <div class="rating_thumbs">
        			<div class="helpful_summary thumb_count">
				<a href="https://secure.metacritic.com/login">
				<span class="total_ups">7</span>
				of 
				<span class="total_thumbs">30</span>
				users found this helpful
                </a>
			</div>
                <div style="clear:both;"></div>
    </div>
</div>
                                        </li>
                                                                                                                                                <li class="review_action">
                                        <a href="/user/elitepredetor99">All this user&apos;s reviews</a>
                                    </li>
                                                                    </ul>
                            </div>
                            
                                                    </div>
                    </div></div></div></div>
                </li>
                                                                                    <li id="user_review_7600819" class="review user_review">
                    <div class="review_btm review_btm_r"><div class="review_btm review_btm_l"><div class="review_top review_top_r"><div class="review_top review_top_l">
                        <div class="review_content">
                            <div class="review_section">
                                <div class="review_stats">
                                    <div class="review_critic">
                                        <div class="name">
                                                                                            <a href="/user/noirfx">noirfx</a>
                                                                                                                                </div>

                                                                                    <div class="date">Oct 15, 2017</div>
                                                                            </div>
                                    
                                    <div class="review_grade">
                                                
<div class="metascore_w user medium game negative indiv">2</div>

                                    </div>
                                </div>
                                <div class="review_body">
                                                        
                                        <span class="inline_expand_collapse inline_collapsed" id="review_blurb_7600819"><span class="blurb blurb_collapsed">This game is boring, lazy and unoptimized. Story is simple and predictable. The game is full of bugs from animations to gameplay mechanics that are gamebreaking (deleted save files, broken triggers, missing audio sounds etc). It is repetitive as it can be and it is short (it took from 7 to 10 hours for most of those who finished it first). And it is not a horror game. Also it needs a patch</span><span class="blurb blurb_expanded">This game is boring, lazy and unoptimized. Story is simple and predictable. The game is full of bugs from animations to gameplay mechanics that are gamebreaking (deleted save files, broken triggers, missing audio sounds etc). It is repetitive as it can be and it is short (it took from 7 to 10 hours for most of those who finished it first). And it is not a horror game. Also it needs a patch as soon as possible.</span><span class="blurb_etc">&#x2026;</span> <a rel="nofollow" class="toggle_expand_collapse toggle_expand" href="/game/pc/the-evil-within-2/user-reviews?user_review_id=7600819">Expand</a></span>
            </div>
                            </div>
                                                        <div class="review_section review_actions ">
                                <ul class="review_actions">
                                                                            <li class="review_action review_helpful">
                                            <div class="review_helpful">
    <div class="rating_thumbs">
        			<div class="helpful_summary thumb_count">
				<a href="https://secure.metacritic.com/login">
				<span class="total_ups">4</span>
				of 
				<span class="total_thumbs">20</span>
				users found this helpful
                </a>
			</div>
                <div style="clear:both;"></div>
    </div>
</div>
                                        </li>
                                                                                                                                                <li class="review_action">
                                        <a href="/user/noirfx">All this user&apos;s reviews</a>
                                    </li>
                                                                    </ul>
                            </div>
                            
                                                    </div>
                    </div></div></div></div>
                </li>
                                                                                    <li id="user_review_7601173" class="review user_review">
                    <div class="review_btm review_btm_r"><div class="review_btm review_btm_l"><div class="review_top review_top_r"><div class="review_top review_top_l">
                        <div class="review_content">
                            <div class="review_section">
                                <div class="review_stats">
                                    <div class="review_critic">
                                        <div class="name">
                                                                                            <a href="/user/MacheteDontText">MacheteDontText</a>
                                                                                                                                </div>

                                                                                    <div class="date">Oct 15, 2017</div>
                                                                            </div>
                                    
                                    <div class="review_grade">
                                                
<div class="metascore_w user medium game negative indiv">3</div>

                                    </div>
                                </div>
                                <div class="review_body">
                                                        
                                        <span class="inline_expand_collapse inline_collapsed" id="review_blurb_7601173"><span class="blurb blurb_collapsed">To sum up : Michael Bay made a game for Dinsney and they dare to call it survival horror.
<br>
<br>I wanted to play and review this, but after 10 minutes of &quot;gameplay&quot; I find myself gathering the willpower to press on. One thing is clear, this is a supernatural horror flick, not a horror game. I was forced into a story I give zero **** about, why cant we have some sense of mistery? This thing</span><span class="blurb blurb_expanded">To sum up : Michael Bay made a game for Dinsney and they dare to call it survival horror.
<br>
<br>I wanted to play and review this, but after 10 minutes of &quot;gameplay&quot; I find myself gathering the willpower to press on. One thing is clear, this is a supernatural horror flick, not a horror game. I was forced into a story I give zero **** about, why cant we have some sense of mistery? This thing starts like a **** episode of Supernatural, shoves **** in your face instead of subtly building tension. The controls feel abysmal as well, you thought the Witcher 3 had clunky movement? This is way worse, and why the **** is this in third person to begin with, isnt this supposed to be immersive? I m going to play a bit and finish this review, but I bet the enemies will be scripted as **** barely reacting to things you do, there s gonna be a ****ton of explosion, gore and bright flashes, maybe it evolves into a decent action game like Dead space 3 ( i quite liked that).
<br>
<br>Okay, played 5 seconds and I m pissed off. The guy manifests in an another world and the first door  he encounters he kicks in. This would be hilarious in Machete 3, but I want to feel terror, not be **** John Wick in a horror game...</span><span class="blurb_etc">&#x2026;</span> <a rel="nofollow" class="toggle_expand_collapse toggle_expand" href="/game/pc/the-evil-within-2/user-reviews?user_review_id=7601173">Expand</a></span>
            </div>
                            </div>
                                                        <div class="review_section review_actions ">
                                <ul class="review_actions">
                                                                            <li class="review_action review_helpful">
                                            <div class="review_helpful">
    <div class="rating_thumbs">
        			<div class="helpful_summary thumb_count">
				<a href="https://secure.metacritic.com/login">
				<span class="total_ups">2</span>
				of 
				<span class="total_thumbs">13</span>
				users found this helpful
                </a>
			</div>
                <div style="clear:both;"></div>
    </div>
</div>
                                        </li>
                                                                                                                                                <li class="review_action">
                                        <a href="/user/MacheteDontText">All this user&apos;s reviews</a>
                                    </li>
                                                                    </ul>
                            </div>
                            
                                                    </div>
                    </div></div></div></div>
                </li>
                                                                                    <li id="user_review_7618063" class="review user_review">
                    <div class="review_btm review_btm_r"><div class="review_btm review_btm_l"><div class="review_top review_top_r"><div class="review_top review_top_l">
                        <div class="review_content">
                            <div class="review_section">
                                <div class="review_stats">
                                    <div class="review_critic">
                                        <div class="name">
                                                                                            <a href="/user/Area54">Area54</a>
                                                                                                                                </div>

                                                                                    <div class="date">Oct 18, 2017</div>
                                                                            </div>
                                    
                                    <div class="review_grade">
                                                
<div class="metascore_w user medium game positive indiv perfect">10</div>

                                    </div>
                                </div>
                                <div class="review_body">
                                                        
                                        <span class="inline_expand_collapse inline_collapsed" id="review_blurb_7618063"><span class="blurb blurb_collapsed">I took a chance buying this game at full price, especially with mixed feelings about the first in the series.
<br>
<br>I could hardly believe the quality I witnessed throughout the entire game. It is a phenomenal masterpiece. A perfect sequel, in the way that it improves -everything- from the predecessor. This game is completely insane and thoroughly amazing. Extremely fun, replayable, engaging,</span><span class="blurb blurb_expanded">I took a chance buying this game at full price, especially with mixed feelings about the first in the series.
<br>
<br>I could hardly believe the quality I witnessed throughout the entire game. It is a phenomenal masterpiece. A perfect sequel, in the way that it improves -everything- from the predecessor. This game is completely insane and thoroughly amazing. Extremely fun, replayable, engaging, rewarding, has epic Bioshock-quality characters, with movie quality cinematics in a few areas, and the gunplay is superb. Excellent character progression. The ending is really satisfying and it&apos;s the ending we deserve. I was really shocked at how great this game was. Each day I started it up, it was a pleasure and a privilege. Thank you Bethesda, as it was obvious you were much more involved in this title, compared to the first one. It&apos;s obvious that your relationship with the revered designer, Shinji Mikami and his employees at Tango Gameworks is a special one.
<br>
<br>Thank you for making such a great game!</span><span class="blurb_etc">&#x2026;</span> <a rel="nofollow" class="toggle_expand_collapse toggle_expand" href="/game/pc/the-evil-within-2/user-reviews?user_review_id=7618063">Expand</a></span>
            </div>
                            </div>
                                                        <div class="review_section review_actions ">
                                <ul class="review_actions">
                                                                            <li class="review_action review_helpful">
                                            <div class="review_helpful">
    <div class="rating_thumbs">
        			<div class="helpful_summary thumb_count">
				<a href="https://secure.metacritic.com/login">
				<span class="total_ups">0</span>
				of 
				<span class="total_thumbs">1</span>
				users found this helpful
                </a>
			</div>
                <div style="clear:both;"></div>
    </div>
</div>
                                        </li>
                                                                                                                                                <li class="review_action">
                                        <a href="/user/Area54">All this user&apos;s reviews</a>
                                    </li>
                                                                    </ul>
                            </div>
                            
                                                    </div>
                    </div></div></div></div>
                </li>
                                                                                    <li id="user_review_7620065" class="review user_review">
                    <div class="review_btm review_btm_r"><div class="review_btm review_btm_l"><div class="review_top review_top_r"><div class="review_top review_top_l">
                        <div class="review_content">
                            <div class="review_section">
                                <div class="review_stats">
                                    <div class="review_critic">
                                        <div class="name">
                                                                                            <a href="/user/21grams">21grams</a>
                                                                                                                                </div>

                                                                                    <div class="date">Oct 19, 2017</div>
                                                                            </div>
                                    
                                    <div class="review_grade">
                                                
<div class="metascore_w user medium game mixed indiv">7</div>

                                    </div>
                                </div>
                                <div class="review_body">
                                                        
                                        <span class="inline_expand_collapse inline_collapsed" id="review_blurb_7620065"><span class="blurb blurb_collapsed">The Evil Within 2 has a truly great concept and story to tell, in my opinion it&apos;s one of most original horror action games you can buy. It&apos;s twisted and will mess with your mind a lot. It has decent enough gameplay (Sebastian - main characters could be less clumsy as former cop/detective) and good exploration - where unlike prequel, this game has few open hub areas and it serves the game</span><span class="blurb blurb_expanded">The Evil Within 2 has a truly great concept and story to tell, in my opinion it&apos;s one of most original horror action games you can buy. It&apos;s twisted and will mess with your mind a lot. It has decent enough gameplay (Sebastian - main characters could be less clumsy as former cop/detective) and good exploration - where unlike prequel, this game has few open hub areas and it serves the game well.
<br>
<br>Now I would rate it higher but I can&apos;t - because.... BETHESDA!!! The game is built on the same, slightly modified engine as the first one - and it&apos;s truly is not a great engine and this game comes with problems. As of date of this review, fullscreen doesn&apos;t work - regardless what it says you are put in borderless window, GPU is not being utilized - game uses up to 80% GPU horsepower, very often far less than that, some players experience micro-stuttering on some hardware configurations. Despite it&apos;s a lot better from technical perspective than first game, I cannot ignore problems and have to take those into consideration when rating a game (-1 from rating).
<br>
<br>As for non-technical problems, voice acting quite bad for some characters (mostly side characters) and dialogue animations are straight terrible - luckily it&apos;s not RPG so there is not that much of them. Also one open zone is reused with just tiny variation and you have to dig through it twice. So this also have be reflected on final score (-1 from rating).
<br>
<br>All in all, it&apos;s great game and one you must experience because honestly it&apos;s one of the kind, especially if you like **** stories and and twisted storytelling. If you don&apos;t mind small but relatively apparent technical problems - grab it now, otherwise - wait maybe for sale, maybe they will patch thing or two until then, but i strongly recommend to any fan of genre to experience the game, it&apos;s really worth!</span><span class="blurb_etc">&#x2026;</span> <a rel="nofollow" class="toggle_expand_collapse toggle_expand" href="/game/pc/the-evil-within-2/user-reviews?user_review_id=7620065">Expand</a></span>
            </div>
                            </div>
                                                        <div class="review_section review_actions ">
                                <ul class="review_actions">
                                                                            <li class="review_action review_helpful">
                                            <div class="review_helpful">
    <div class="rating_thumbs">
        			<div class="helpful_summary thumb_count">
				<a href="https://secure.metacritic.com/login">
				<span class="total_ups">0</span>
				of 
				<span class="total_thumbs">1</span>
				users found this helpful
                </a>
			</div>
                <div style="clear:both;"></div>
    </div>
</div>
                                        </li>
                                                                                                                                                <li class="review_action">
                                        <a href="/user/21grams">All this user&apos;s reviews</a>
                                    </li>
                                                                    </ul>
                            </div>
                            
                                                    </div>
                    </div></div></div></div>
                </li>
                                                                                    <li id="user_review_7696986" class="review user_review">
                    <div class="review_btm review_btm_r"><div class="review_btm review_btm_l"><div class="review_top review_top_r"><div class="review_top review_top_l">
                        <div class="review_content">
                            <div class="review_section">
                                <div class="review_stats">
                                    <div class="review_critic">
                                        <div class="name">
                                                                                            <a href="/user/singlungchan">singlungchan</a>
                                                                                                                                </div>

                                                                                    <div class="date">Nov  8, 2017</div>
                                                                            </div>
                                    
                                    <div class="review_grade">
                                                
<div class="metascore_w user medium game mixed indiv">5</div>

                                    </div>
                                </div>
                                <div class="review_body">
                                                        
                                        <span class="inline_expand_collapse inline_collapsed" id="review_blurb_7696986"><span class="blurb blurb_collapsed">This game is one big wannabe. That&apos;s all it is. Like any other fake product, it tries to copy a lot of epic games, but fails just short on all points. Some of those games are resident evil, the last of us, tomb raider. It feels like some of the levels where directly influenced by one of those games. Like a cheap version of them which at first looks similar but ultimately lacks the real</span><span class="blurb blurb_expanded">This game is one big wannabe. That&apos;s all it is. Like any other fake product, it tries to copy a lot of epic games, but fails just short on all points. Some of those games are resident evil, the last of us, tomb raider. It feels like some of the levels where directly influenced by one of those games. Like a cheap version of them which at first looks similar but ultimately lacks the real substances which makes those games great. Some of the problems are as follows:
<br>
<br>The story  lacks any suspense.
<br>The plot has twists which feel like the next random event.
<br>The game-play, while not bad, is more often a struggle rather than fun.
<br>Environments that have no atmosphere.
<br>Companions which doesn&apos;t have any personality - only bad acting.
<br>Protagonist who is boring.
<br>Effect-oriented scenes that are just that - for effect. Like an uninteresting movie with a good car-chase.
<br>The game just tries too hard.
<br>
<br>Overall: it&apos;s worth the try, but don&apos;t expect to be immersed in this mediocre game in the skin of a block-buster</span><span class="blurb_etc">&#x2026;</span> <a rel="nofollow" class="toggle_expand_collapse toggle_expand" href="/game/pc/the-evil-within-2/user-reviews?user_review_id=7696986">Expand</a></span>
            </div>
                            </div>
                                                        <div class="review_section review_actions ">
                                <ul class="review_actions">
                                                                            <li class="review_action review_helpful">
                                            <div class="review_helpful">
    <div class="rating_thumbs">
        			<div class="helpful_summary thumb_count">
				<a href="https://secure.metacritic.com/login">
				<span class="total_ups">0</span>
				of 
				<span class="total_thumbs">1</span>
				users found this helpful
                </a>
			</div>
                <div style="clear:both;"></div>
    </div>
</div>
                                        </li>
                                                                                                                                                <li class="review_action">
                                        <a href="/user/singlungchan">All this user&apos;s reviews</a>
                                    </li>
                                                                    </ul>
                            </div>
                            
                                                    </div>
                    </div></div></div></div>
                </li>
                                                                                    <li id="user_review_7626725" class="review user_review">
                    <div class="review_btm review_btm_r"><div class="review_btm review_btm_l"><div class="review_top review_top_r"><div class="review_top review_top_l">
                        <div class="review_content">
                            <div class="review_section">
                                <div class="review_stats">
                                    <div class="review_critic">
                                        <div class="name">
                                                                                            <a href="/user/KittyWhisky">KittyWhisky</a>
                                                                                                                                </div>

                                                                                    <div class="date">Oct 21, 2017</div>
                                                                            </div>
                                    
                                    <div class="review_grade">
                                                
<div class="metascore_w user medium game positive indiv">9</div>

                                    </div>
                                </div>
                                <div class="review_body">
                                                        
                                        <span class="inline_expand_collapse inline_collapsed" id="review_blurb_7626725"><span class="blurb blurb_collapsed">The Evil Within 2 - the sequel to psychedelic hell. The first part challenged the players, had a dark but attractive atmosphere, gameplay Resident Evil 4 (which is good), but sags in the plot. The game had a certain charm, she attracted, was forced to return to his dark world, because if hell is, it looks like the first The Evil Within. The second part did John Johanas, which was</span><span class="blurb blurb_expanded">The Evil Within 2 - the sequel to psychedelic hell. The first part challenged the players, had a dark but attractive atmosphere, gameplay Resident Evil 4 (which is good), but sags in the plot. The game had a certain charm, she attracted, was forced to return to his dark world, because if hell is, it looks like the first The Evil Within. The second part did John Johanas, which was responsible for the DLC for the first part, and keep an eye on him, Shinji Mikami. It is felt that the sequel was done by other people, but the game does not become worse.
<br>
<br>This time the plot is much simpler and clearer than in the first game, which went only benefit. After completing The Evil Within 2, you&apos;ll have no issues. Along with the story and changed the gameplay. Moreover, the linear stages is not particularly changed. There we were still locked in a small space, and we need to hide, or alternately kill monsters. This game is still a survival horror, even more survival. Survival now became more developed thanks to the Kraft and, of course, appeared in open locations. It&apos;s not open world, but explore that. In an open world we can find the various items for crafting, to carry out the plot and additional missions. The extra missions are very interesting and related to by Sebastian. Additional tasks third party to tell us stories in this world. In the first part of the Chapter commercials from 2 to 9 we aimlessly killing monsters and tried to survive. It was not easy and hardcore, but often a story or at least some clear goal was not simple. Here we always understand why we do something. Even when the plot is not particularly develops, we learn some other history.
<br>
<br>Open world is a controversial decision, but it is justified by the plot. In the first part we traveled through the ruined mind of a psycho. Here, in the minds built the city, and the developers wanted this part of the story was the gameplay. We have several parts of the city, but the plot is still developing in corridor spaces. Linear locations are made more fiction. Now they consist not only of blood and guts. This is a separate surreal, psychedelic locations. The head is sometimes very transient and sometimes perceived simply as a new paragraph, so to speak. In the first game of the head was really something separate. But storytelling has grown and the main story runs through the whole game, a special sagging is not seen. Of course, in the middle of it, as usual, not much, but you did not notice, because you always have a goal and understanding what is happening.
<br>
<br>The monsters are all the same threat as in the first part, but they looked more vile and disgusting. Even ordinary opponents with their barbed wire over the body and nailed to the skull. In the sequel, even bosses are not as challenging. In the first part often can not be just to kill the boss with them was a special gameplay. Here are they without special problems elementary shot. Remember the huge twins, big dog? Now, this is not here. Here or bosses or normal enemies (normal enemies, there are several types and some are extremely dangerous). Also removed the mechanics from the burning of ordinary opponents, because even before the common infected just so the knife could not be seperate, now this is no problem (but I understand that this mechanic was removed from the STEM of another world). Due to the open world, the game became easier. Enemies are still strong. But because of the vast spaces you can easily get around them, or even to escape to the sanctuary, you will chase the crowd. The first part was not enough traps, in which could get the player, or to do otherwise - to lure them into the enemy, but in the sequel traps almost there. Also open world drops to the pacing and tempo of scaring the player. In the linear stages of the game can still challenge and some where to scare. This is not a stupid third-person shooter. Here you need to survive, to save health packs and bullets.
<br>
<br>The Evil Within 2 took into account the mistakes of its predecessor, and became great Thriller-adventure, this survival in a hostile world. The game has expanded, deepened gameplay, linear locations have become more inventive, the game has acquired a clear and intriguing storyline. For me it will likely be game of the year. Especially because of the ending. Very beautiful final point. Of course, there are small hooks to continue, but without him it will be a great film series about detective Sebastian Castellanos.</span><span class="blurb_etc">&#x2026;</span> <a rel="nofollow" class="toggle_expand_collapse toggle_expand" href="/game/pc/the-evil-within-2/user-reviews?user_review_id=7626725">Expand</a></span>
            </div>
                            </div>
                                                        <div class="review_section review_actions ">
                                <ul class="review_actions">
                                                                            <li class="review_action review_helpful">
                                            <div class="review_helpful">
    <div class="rating_thumbs">
        			<div class="helpful_summary thumb_count">
				<a href="https://secure.metacritic.com/login">
				<span class="total_ups">0</span>
				of 
				<span class="total_thumbs">1</span>
				users found this helpful
                </a>
			</div>
                <div style="clear:both;"></div>
    </div>
</div>
                                        </li>
                                                                                                                                                <li class="review_action">
                                        <a href="/user/KittyWhisky">All this user&apos;s reviews</a>
                                    </li>
                                                                    </ul>
                            </div>
                            
                                                    </div>
                    </div></div></div></div>
                </li>
                                                                                    <li id="user_review_7599157" class="review user_review">
                    <div class="review_btm review_btm_r"><div class="review_btm review_btm_l"><div class="review_top review_top_r"><div class="review_top review_top_l">
                        <div class="review_content">
                            <div class="review_section">
                                <div class="review_stats">
                                    <div class="review_critic">
                                        <div class="name">
                                                                                            <a href="/user/CharlerMaster">CharlerMaster</a>
                                                                                                                                </div>

                                                                                    <div class="date">Oct 14, 2017</div>
                                                                            </div>
                                    
                                    <div class="review_grade">
                                                
<div class="metascore_w user medium game positive indiv perfect">10</div>

                                    </div>
                                </div>
                                <div class="review_body">
                                                        
                                        <span>Classic survival-horror game but its awesome than other :)
<br>Awesome storyline and open world, good characters and animations. Amazing graphics, W&#x131;th good sound effects.</span>
            </div>
                            </div>
                                                        <div class="review_section review_actions ">
                                <ul class="review_actions">
                                                                            <li class="review_action review_helpful">
                                            <div class="review_helpful">
    <div class="rating_thumbs">
        			<div class="helpful_summary thumb_count">
				<a href="https://secure.metacritic.com/login">
				<span class="total_ups">0</span>
				of 
				<span class="total_thumbs">2</span>
				users found this helpful
                </a>
			</div>
                <div style="clear:both;"></div>
    </div>
</div>
                                        </li>
                                                                                                                                                <li class="review_action">
                                        <a href="/user/CharlerMaster">All this user&apos;s reviews</a>
                                    </li>
                                                                    </ul>
                            </div>
                            
                                                    </div>
                    </div></div></div></div>
                </li>
                                                                                    <li id="user_review_7654991" class="review user_review">
                    <div class="review_btm review_btm_r"><div class="review_btm review_btm_l"><div class="review_top review_top_r"><div class="review_top review_top_l">
                        <div class="review_content">
                            <div class="review_section">
                                <div class="review_stats">
                                    <div class="review_critic">
                                        <div class="name">
                                                                                            <a href="/user/aljirik1992">aljirik1992</a>
                                                                                                                                </div>

                                                                                    <div class="date">Oct 29, 2017</div>
                                                                            </div>
                                    
                                    <div class="review_grade">
                                                
<div class="metascore_w user medium game positive indiv">8</div>

                                    </div>
                                </div>
                                <div class="review_body">
                                                        
                                        <span class="inline_expand_collapse inline_collapsed" id="review_blurb_7654991"><span class="blurb blurb_collapsed">&#x41A;&#x43E;&#x444;&#x435; &#x43C;&#x43E;&#x439; &#x434;&#x440;&#x443;&#x433;... (The Evil Within 2)
<br>
<br>TEW2 &#x443;&#x442;&#x440;&#x430;&#x442;&#x438;&#x43B; &#x432;&#x441;&#x44F;&#x43A;&#x438;&#x439; &#x443;&#x436;&#x430;&#x441; &#x43E;&#x440;&#x438;&#x433;&#x438;&#x43D;&#x430;&#x43B;&#x430;. &#x41D;&#x438; &#x442;&#x435;&#x431;&#x435; &#x43A;&#x440;&#x438;&#x432;&#x43E;&#x433;&#x43E; &#x443;&#x43F;&#x440;&#x430;&#x432;&#x43B;&#x435;&#x43D;&#x438;&#x44F; &#x438;&#x43B;&#x438; &#x43D;&#x435; &#x440;&#x430;&#x441;&#x43A;&#x440;&#x44B;&#x442;&#x44B;&#x445; &#x43C;&#x435;&#x445;&#x430;&#x43D;&#x438;&#x43A;, &#x43D;&#x438; &#x442;&#x435;&#x431;&#x435; &#x444;&#x438;&#x43D;&#x430;&#x43B;&#x430;, &#x43A;&#x43E;&#x442;&#x43E;&#x440;&#x44B;&#x439; &#x431;&#x44B;&#x43B; &#x443;&#x43F;&#x430;&#x43A;&#x43E;&#x432;&#x430;&#x43D; &#x432; &#x434;&#x432;&#x430; DLC, &#x43D;&#x438; &#x431;&#x43E;&#x441;&#x441;&#x43E;&#x432; &#x43D;&#x430; &#x433;&#x43B;&#x443;&#x43F;&#x43E; &#x440;&#x430;&#x431;&#x43E;&#x442;&#x430;&#x44E;&#x449;&#x438;&#x445; &#x441;&#x43A;&#x440;&#x438;&#x43F;&#x442;&#x430;&#x445;. &#x411;&#x43B;&#x430;&#x433;&#x43E; &#x445;&#x43E;&#x442;&#x44C; &#x433;&#x43D;&#x435;&#x442;&#x443;&#x449;&#x443;&#x44E; &#x430;&#x442;&#x43C;&#x43E;&#x441;&#x444;&#x435;&#x440;&#x443; &#x438; &#x447;&#x443;&#x432;&#x441;&#x442;&#x432;&#x43E; &#x43D;&#x435;&#x438;&#x437;&#x431;&#x435;&#x436;&#x43D;&#x43E;&#x441;&#x442;&#x438; &#x43E;&#x441;&#x442;&#x430;&#x432;&#x438;&#x43B;&#x438; &#x43D;&#x430; &#x43C;&#x435;&#x441;&#x442;&#x435;. &#x428;&#x443;&#x442;&#x43A;&#x430; &#x43B;&#x438;, &#x43D;&#x43E; &#x432; &#x438;&#x433;&#x440;&#x435; &#x43E;&#x441;&#x442;&#x430;&#x43B;&#x441;&#x44F; &#x442;&#x43E;&#x43B;&#x44C;&#x43A;&#x43E; &#x442;&#x43E;&#x442; &#x43A;&#x43E;&#x448;&#x43C;&#x430;&#x440;, &#x43A;&#x43E;&#x442;&#x43E;&#x440;&#x44B;&#x439; &#x442;&#x430;&#x43A; &#x43F;&#x43E;&#x43B;&#x44E;&#x431;&#x438;&#x43B;&#x441;&#x44F; &#x432; &#x43F;&#x435;&#x440;&#x432;&#x43E;&#x439; &#x447;&#x430;&#x441;&#x442;&#x438;. &#x418; &#x43F;&#x443;&#x441;&#x442;&#x44C; &#x442;&#x435;&#x43F;&#x435;&#x440;&#x44C;</span><span class="blurb blurb_expanded">&#x41A;&#x43E;&#x444;&#x435; &#x43C;&#x43E;&#x439; &#x434;&#x440;&#x443;&#x433;... (The Evil Within 2)
<br>
<br>TEW2 &#x443;&#x442;&#x440;&#x430;&#x442;&#x438;&#x43B; &#x432;&#x441;&#x44F;&#x43A;&#x438;&#x439; &#x443;&#x436;&#x430;&#x441; &#x43E;&#x440;&#x438;&#x433;&#x438;&#x43D;&#x430;&#x43B;&#x430;. &#x41D;&#x438; &#x442;&#x435;&#x431;&#x435; &#x43A;&#x440;&#x438;&#x432;&#x43E;&#x433;&#x43E; &#x443;&#x43F;&#x440;&#x430;&#x432;&#x43B;&#x435;&#x43D;&#x438;&#x44F; &#x438;&#x43B;&#x438; &#x43D;&#x435; &#x440;&#x430;&#x441;&#x43A;&#x440;&#x44B;&#x442;&#x44B;&#x445; &#x43C;&#x435;&#x445;&#x430;&#x43D;&#x438;&#x43A;, &#x43D;&#x438; &#x442;&#x435;&#x431;&#x435; &#x444;&#x438;&#x43D;&#x430;&#x43B;&#x430;, &#x43A;&#x43E;&#x442;&#x43E;&#x440;&#x44B;&#x439; &#x431;&#x44B;&#x43B; &#x443;&#x43F;&#x430;&#x43A;&#x43E;&#x432;&#x430;&#x43D; &#x432; &#x434;&#x432;&#x430; DLC, &#x43D;&#x438; &#x431;&#x43E;&#x441;&#x441;&#x43E;&#x432; &#x43D;&#x430; &#x433;&#x43B;&#x443;&#x43F;&#x43E; &#x440;&#x430;&#x431;&#x43E;&#x442;&#x430;&#x44E;&#x449;&#x438;&#x445; &#x441;&#x43A;&#x440;&#x438;&#x43F;&#x442;&#x430;&#x445;. &#x411;&#x43B;&#x430;&#x433;&#x43E; &#x445;&#x43E;&#x442;&#x44C; &#x433;&#x43D;&#x435;&#x442;&#x443;&#x449;&#x443;&#x44E; &#x430;&#x442;&#x43C;&#x43E;&#x441;&#x444;&#x435;&#x440;&#x443; &#x438; &#x447;&#x443;&#x432;&#x441;&#x442;&#x432;&#x43E; &#x43D;&#x435;&#x438;&#x437;&#x431;&#x435;&#x436;&#x43D;&#x43E;&#x441;&#x442;&#x438; &#x43E;&#x441;&#x442;&#x430;&#x432;&#x438;&#x43B;&#x438; &#x43D;&#x430; &#x43C;&#x435;&#x441;&#x442;&#x435;. &#x428;&#x443;&#x442;&#x43A;&#x430; &#x43B;&#x438;, &#x43D;&#x43E; &#x432; &#x438;&#x433;&#x440;&#x435; &#x43E;&#x441;&#x442;&#x430;&#x43B;&#x441;&#x44F; &#x442;&#x43E;&#x43B;&#x44C;&#x43A;&#x43E; &#x442;&#x43E;&#x442; &#x43A;&#x43E;&#x448;&#x43C;&#x430;&#x440;, &#x43A;&#x43E;&#x442;&#x43E;&#x440;&#x44B;&#x439; &#x442;&#x430;&#x43A; &#x43F;&#x43E;&#x43B;&#x44E;&#x431;&#x438;&#x43B;&#x441;&#x44F; &#x432; &#x43F;&#x435;&#x440;&#x432;&#x43E;&#x439; &#x447;&#x430;&#x441;&#x442;&#x438;. &#x418; &#x43F;&#x443;&#x441;&#x442;&#x44C; &#x442;&#x435;&#x43F;&#x435;&#x440;&#x44C; &#x438;&#x433;&#x440;&#x430; &#x431;&#x43E;&#x43B;&#x44C;&#x448;&#x435; &#x442;&#x440;&#x438;&#x43B;&#x43B;&#x435;&#x440; &#x447;&#x435;&#x43C; &#x445;&#x43E;&#x440;&#x440;&#x43E;&#x440;, &#x43E;&#x43D;&#x430; &#x447;&#x443;&#x432;&#x441;&#x442;&#x432;&#x443;&#x435;&#x442;&#x441;&#x44F; &#x43F;&#x43E;&#x43B;&#x43D;&#x43E;&#x446;&#x435;&#x43D;&#x43D;&#x43E;&#x439; &#x432;&#x442;&#x43E;&#x440;&#x43E;&#x439; &#x447;&#x430;&#x441;&#x442;&#x44C;&#x44E; &#x441;&#x43E; &#x432;&#x441;&#x435;&#x43C;&#x438; &#x432;&#x44B;&#x442;&#x435;&#x43A;&#x430;&#x44E;&#x449;&#x438;&#x43C;&#x438; &#x438;&#x437; &#x43D;&#x435;&#x451; &#x436;&#x438;&#x434;&#x43A;&#x43E;&#x441;&#x442;&#x44F;&#x43C;&#x438;. &#x423;&#x436;&#x435; &#x441; &#x43F;&#x435;&#x440;&#x432;&#x43E;&#x439; &#x433;&#x43B;&#x430;&#x432;&#x44B; &#x43F;&#x440;&#x438;&#x445;&#x43E;&#x434;&#x438;&#x442; &#x43F;&#x43E;&#x43D;&#x438;&#x43C;&#x430;&#x43D;&#x438;&#x435;, &#x447;&#x442;&#x43E; &#x435;&#x441;&#x43B;&#x438; &#x43F;&#x435;&#x440;&#x441;&#x43E;&#x43D;&#x430;&#x436; &#x438; &#x43F;&#x43E;&#x433;&#x438;&#x431;&#x43D;&#x435;&#x442;, &#x442;&#x43E; &#x44D;&#x442;&#x43E; &#x442;&#x43E;&#x43B;&#x44C;&#x43A;&#x43E; &#x432;&#x438;&#x43D;&#x430; &#x447;&#x435;&#x43B;&#x43E;&#x432;&#x435;&#x43A;&#x430; &#x438;&#x433;&#x440;&#x430;&#x44E;&#x449;&#x435;&#x433;&#x43E; &#x437;&#x430; &#x43D;&#x435;&#x433;&#x43E;, &#x430; &#x43D;&#x435; &#x441;&#x432;&#x43E;&#x435;&#x43E;&#x431;&#x440;&#x430;&#x437;&#x43D;&#x44B;&#x439; &#x433;&#x435;&#x439;&#x43C;&#x434;&#x438;&#x437;&#x430;&#x439;&#x43D;&#x435;&#x440;&#x441;&#x43A;&#x438;&#x439; &#x445;&#x43E;&#x434;. &#x418; &#x43F;&#x443;&#x441;&#x442;&#x44C; &#x443;&#x441;&#x43B;&#x43E;&#x432;&#x43D;&#x43E;&#x441;&#x442;&#x438; &#x43E;&#x441;&#x442;&#x430;&#x43B;&#x438;&#x441;&#x44C;, &#x43D;&#x43E; &#x437;&#x430;&#x442;&#x43E; &#x442;&#x435;&#x43F;&#x435;&#x440;&#x44C; &#x43E;&#x43D;&#x438; &#x43E;&#x43A;&#x443;&#x43F;&#x430;&#x44E;&#x442;&#x441;&#x44F; &#x436;&#x435;&#x43B;&#x430;&#x43D;&#x438;&#x435;&#x43C; &#x43A; &#x438;&#x441;&#x441;&#x43B;&#x435;&#x434;&#x43E;&#x432;&#x430;&#x43D;&#x438;&#x44E; &#x438; &#x432;&#x43E;&#x437;&#x43D;&#x430;&#x433;&#x440;&#x430;&#x436;&#x434;&#x430;&#x44E;&#x442;&#x441;&#x44F; &#x43F;&#x43E;&#x434;&#x43E;&#x431;&#x430;&#x44E;&#x449;&#x438;&#x43C; &#x43E;&#x431;&#x440;&#x430;&#x437;&#x43E;&#x43C;. The Evil Within 2 &#x434;&#x435;&#x43B;&#x430;&#x435;&#x442; &#x432;&#x441;&#x451; &#x447;&#x442;&#x43E;&#x431;&#x44B; &#x442;&#x435; &#x43A;&#x442;&#x43E; &#x43F;&#x440;&#x43E;&#x448;&#x451;&#x43B; &#x43F;&#x435;&#x440;&#x432;&#x443;&#x44E; &#x447;&#x430;&#x441;&#x442;&#x44C; &#x434;&#x435;&#x439;&#x441;&#x442;&#x432;&#x438;&#x442;&#x435;&#x43B;&#x44C;&#x43D;&#x43E; &#x43F;&#x43E;&#x43D;&#x44F;&#x43B;&#x438; &#x43F;&#x43E;&#x447;&#x435;&#x43C;&#x443; &#x441;&#x442;&#x43E;&#x438;&#x43B;&#x43E; &#x43F;&#x43E;&#x434;&#x434;&#x435;&#x440;&#x436;&#x438;&#x432;&#x430;&#x442;&#x44C; &#x44D;&#x442;&#x443; &#x444;&#x440;&#x430;&#x43D;&#x448;&#x438;&#x437;&#x443; &#x431;&#x430;&#x43D;&#x43A;&#x43E;&#x439; &#x437;&#x435;&#x43B;&#x435;&#x43D;&#x438;, &#x430; &#x434;&#x43B;&#x44F; &#x442;&#x43E;&#x43B;&#x44C;&#x43A;&#x43E; &#x43F;&#x43E;&#x433;&#x440;&#x443;&#x436;&#x430;&#x44E;&#x449;&#x438;&#x445;&#x441;&#x44F; &#x432; &#x44D;&#x442;&#x43E;&#x442; &#x43E;&#x43C;&#x443;&#x442; &#x43F;&#x443;&#x433;&#x430;&#x44E;&#x449;&#x438;&#x445; &#x43C;&#x44B;&#x441;&#x43B;&#x435;&#x439;, &#x43F;&#x43E;&#x43A;&#x430;&#x437;&#x430;&#x442;&#x44C; &#x43D;&#x430;&#x441;&#x43A;&#x43E;&#x43B;&#x44C;&#x43A;&#x43E; &#x43F;&#x440;&#x435;&#x43A;&#x440;&#x430;&#x441;&#x435;&#x43D; &#x440;&#x430;&#x441;&#x441;&#x432;&#x435;&#x442; &#x43D;&#x43E;&#x432;&#x43E;&#x439; &#x438;&#x441;&#x442;&#x43E;&#x440;&#x438;&#x438; &#x441;&#x435;&#x440;&#x438;&#x438; &#x41C;&#x438;&#x43A;&#x430;&#x43C;&#x438;.
<br></span><span class="blurb_etc">&#x2026;</span> <a rel="nofollow" class="toggle_expand_collapse toggle_expand" href="/game/pc/the-evil-within-2/user-reviews?user_review_id=7654991">Expand</a></span>
            </div>
                            </div>
                                                        <div class="review_section review_actions ">
                                <ul class="review_actions">
                                                                            <li class="review_action review_helpful">
                                            <div class="review_helpful">
    <div class="rating_thumbs">
        			<div class="helpful_summary thumb_count">
				<a href="https://secure.metacritic.com/login">
				<span class="total_ups">0</span>
				of 
				<span class="total_thumbs">1</span>
				users found this helpful
                </a>
			</div>
                <div style="clear:both;"></div>
    </div>
</div>
                                        </li>
                                                                                                                                                <li class="review_action">
                                        <a href="/user/aljirik1992">All this user&apos;s reviews</a>
                                    </li>
                                                                    </ul>
                            </div>
                            
                                                    </div>
                    </div></div></div></div>
                </li>
                                                                                    <li id="user_review_7714464" class="review user_review">
                    <div class="review_btm review_btm_r"><div class="review_btm review_btm_l"><div class="review_top review_top_r"><div class="review_top review_top_l">
                        <div class="review_content">
                            <div class="review_section">
                                <div class="review_stats">
                                    <div class="review_critic">
                                        <div class="name">
                                                                                            <a href="/user/Vixremento">Vixremento</a>
                                                                                                                                </div>

                                                                                    <div class="date">Nov 13, 2017</div>
                                                                            </div>
                                    
                                    <div class="review_grade">
                                                
<div class="metascore_w user medium game mixed indiv">6</div>

                                    </div>
                                </div>
                                <div class="review_body">
                                                        
                                        <span class="inline_expand_collapse inline_collapsed" id="review_blurb_7714464"><span class="blurb blurb_collapsed">It&apos;s, okay: I enjoyed the start of the game more than I expected to, the middle-portion started to wane quite a bit and by the end I had started to get bored with it.
<br>
<br>Initially it had a bit of a Silent Hill 2 feel to it (I never did play the first Silent Hill) and I was hoping that it would open up in the same way with exploring various areas and finding out via &quot;brute force&quot; where you</span><span class="blurb blurb_expanded">It&apos;s, okay: I enjoyed the start of the game more than I expected to, the middle-portion started to wane quite a bit and by the end I had started to get bored with it.
<br>
<br>Initially it had a bit of a Silent Hill 2 feel to it (I never did play the first Silent Hill) and I was hoping that it would open up in the same way with exploring various areas and finding out via &quot;brute force&quot; where you could or couldn&apos;t go. Sadly TEW2 instead have me a lot of &quot;points of interest&quot; that turned out to not actually be that interesting.
<br>
<br>The weapon and character customization are pretty cool however the lack of weapons and actual &quot;abilities&quot; made this all feel sort of tacked on. I ended up with an over-powered pistol that left me hardly ever using my shotgun or crossbow; fun for an experiment but too cumbersome to bother with unless you like counting your steps between doorways.
<br>
<br>Another thing that started to really annoy me was the slowed down pace at many points...I&apos;d just had an adrenaline-fueled shootout or encounter and then I was forced into a slowed down walk to a gate, a jump to an alternate &quot;alternate&quot; reality that did nothing but frustrate me (because why slow down the action so quickly to almost halt it entirely)...
<br>
<br>It tries to be a lot of things but fails to actually master any of them. At one point an AI enemy ran away from me but forced my character to move very slowly (appeared like lag) until it had exited the area...the what now?
<br>
<br>Nothing really scared me either so while it does have some really nasty looking subjects I really almost felt as if I was in a cheap horror movie more than something making me want to run away.
<br>
<br>Your character will almost always start with saying &quot;What the hell...&quot;. It gets stale really quickly.
<br>
<br>Anyway enough with this review. It was okay but not worth picking up at full price and if you&apos;re okay with everything I&apos;ve mentioned above then you&apos;ll probably enjoy portions of it as I did but at the same time don&apos;t expect it to be all fun and games.</span><span class="blurb_etc">&#x2026;</span> <a rel="nofollow" class="toggle_expand_collapse toggle_expand" href="/game/pc/the-evil-within-2/user-reviews?user_review_id=7714464">Expand</a></span>
            </div>
                            </div>
                                                        <div class="review_section review_actions ">
                                <ul class="review_actions">
                                                                            <li class="review_action review_helpful">
                                            <div class="review_helpful">
    <div class="rating_thumbs">
        			<div class="helpful_summary thumb_count">
				<a href="https://secure.metacritic.com/login">
				<span class="total_ups">0</span>
				of 
				<span class="total_thumbs">0</span>
				users found this helpful
                </a>
			</div>
                <div style="clear:both;"></div>
    </div>
</div>
                                        </li>
                                                                                                                                                <li class="review_action">
                                        <a href="/user/Vixremento">All this user&apos;s reviews</a>
                                    </li>
                                                                    </ul>
                            </div>
                            
                                                    </div>
                    </div></div></div></div>
                </li>
                                                                                    <li id="user_review_7690495" class="review user_review">
                    <div class="review_btm review_btm_r"><div class="review_btm review_btm_l"><div class="review_top review_top_r"><div class="review_top review_top_l">
                        <div class="review_content">
                            <div class="review_section">
                                <div class="review_stats">
                                    <div class="review_critic">
                                        <div class="name">
                                                                                            <a href="/user/Mandulum">Mandulum</a>
                                                                                                                                </div>

                                                                                    <div class="date">Nov  6, 2017</div>
                                                                            </div>
                                    
                                    <div class="review_grade">
                                                
<div class="metascore_w user medium game positive indiv">8</div>

                                    </div>
                                </div>
                                <div class="review_body">
                                                        
                                        <span class="inline_expand_collapse inline_collapsed" id="review_blurb_7690495"><span class="blurb blurb_collapsed">Five Word Review: Good horror, a quality experience.
<br>Favorite Thing: I enjoyed running around the (smallish) open areas, cleaning up the infection one execution at a time.
<br>Least Favorite Thing: The town was small enough that they could have made interiors for all the buildings, or at least more of them.

Date Completed: 2017-11-05
Fear Factor: Not so scary, a little bit creepy at</span><span class="blurb blurb_expanded">Five Word Review: Good horror, a quality experience.
<br>Favorite Thing: I enjoyed running around the (smallish) open areas, cleaning up the infection one execution at a time.
<br>Least Favorite Thing: The town was small enough that they could have made interiors for all the buildings, or at least more of them.
<br>
<br>Date Completed: 2017-11-05
<br>Fear Factor: Not so scary, a little bit creepy at times.
<br>Playtime: ~ 18h
<br>Enjoyment: 8/10
<br>Recommendation: If you liked The Evil Within 1 then yes. If you&apos;re never played TEW1 yet then go play that first.</span><span class="blurb_etc">&#x2026;</span> <a rel="nofollow" class="toggle_expand_collapse toggle_expand" href="/game/pc/the-evil-within-2/user-reviews?user_review_id=7690495">Expand</a></span>
            </div>
                            </div>
                                                        <div class="review_section review_actions ">
                                <ul class="review_actions">
                                                                            <li class="review_action review_helpful">
                                            <div class="review_helpful">
    <div class="rating_thumbs">
        			<div class="helpful_summary thumb_count">
				<a href="https://secure.metacritic.com/login">
				<span class="total_ups">0</span>
				of 
				<span class="total_thumbs">0</span>
				users found this helpful
                </a>
			</div>
                <div style="clear:both;"></div>
    </div>
</div>
                                        </li>
                                                                                                                                                <li class="review_action">
                                        <a href="/user/Mandulum">All this user&apos;s reviews</a>
                                    </li>
                                                                    </ul>
                            </div>
                            
                                                    </div>
                    </div></div></div></div>
                </li>
                                                                                    <li id="user_review_7634834" class="review user_review">
                    <div class="review_btm review_btm_r"><div class="review_btm review_btm_l"><div class="review_top review_top_r"><div class="review_top review_top_l">
                        <div class="review_content">
                            <div class="review_section">
                                <div class="review_stats">
                                    <div class="review_critic">
                                        <div class="name">
                                                                                            <a href="/user/nima1990">nima1990</a>
                                                                                                                                </div>

                                                                                    <div class="date">Oct 24, 2017</div>
                                                                            </div>
                                    
                                    <div class="review_grade">
                                                
<div class="metascore_w user medium game positive indiv">9</div>

                                    </div>
                                </div>
                                <div class="review_body">
                                                        
                                        <span>One of the best horror games in recent years and I think it was better than the first one in every way. I&apos;d give it a 10 but some technical issues like the GPU usage never going above 70% and some sub par voice acting for minor characters keep me from doing it. Overall it was a masterpiece. The story haunts you till the end and makes you really emotional. The graphics are great and combat is fun.</span>
            </div>
                            </div>
                                                        <div class="review_section review_actions ">
                                <ul class="review_actions">
                                                                            <li class="review_action review_helpful">
                                            <div class="review_helpful">
    <div class="rating_thumbs">
        			<div class="helpful_summary thumb_count">
				<a href="https://secure.metacritic.com/login">
				<span class="total_ups">0</span>
				of 
				<span class="total_thumbs">0</span>
				users found this helpful
                </a>
			</div>
                <div style="clear:both;"></div>
    </div>
</div>
                                        </li>
                                                                                                                                                <li class="review_action">
                                        <a href="/user/nima1990">All this user&apos;s reviews</a>
                                    </li>
                                                                    </ul>
                            </div>
                            
                                                    </div>
                    </div></div></div></div>
                </li>
                                                                                    <li id="user_review_7637570" class="review user_review">
                    <div class="review_btm review_btm_r"><div class="review_btm review_btm_l"><div class="review_top review_top_r"><div class="review_top review_top_l">
                        <div class="review_content">
                            <div class="review_section">
                                <div class="review_stats">
                                    <div class="review_critic">
                                        <div class="name">
                                                                                            <a href="/user/Ramiro1992">Ramiro1992</a>
                                                                                                                                </div>

                                                                                    <div class="date">Oct 25, 2017</div>
                                                                            </div>
                                    
                                    <div class="review_grade">
                                                
<div class="metascore_w user medium game mixed indiv">7</div>

                                    </div>
                                </div>
                                <div class="review_body">
                                                        
                                        <span class="inline_expand_collapse inline_collapsed" id="review_blurb_7637570"><span class="blurb blurb_collapsed">This game is better than the first one, and it can be considered a modern survival horror game, but it is not even near to classic survival horror game, even Alan Wake is better than this one, and while it dissapoints in some aspects, there are some very well designed elements in this game.
<br>First of all, the gameplay, I found it comfortable to play, but there are some flaws that cannot be</span><span class="blurb blurb_expanded">This game is better than the first one, and it can be considered a modern survival horror game, but it is not even near to classic survival horror game, even Alan Wake is better than this one, and while it dissapoints in some aspects, there are some very well designed elements in this game.
<br>First of all, the gameplay, I found it comfortable to play, but there are some flaws that cannot be unseen, like the stealth mechanics, the game gives you a hint that you can hide in some bushes, but the enemies spot you anyway, so you are not really hiding in there. Other thing I do not understand is the ammo, it is true that in classic survival horror games you have limited ammo, but this game only gives you a few bullets and throws you in a world full of enemies, that is some bad game design, not something designed to challenge players. The AI of the enemies is almost as bad as evil within 1, but at least is a bit more realistic now.
<br>The level design is very good, the foggy road surrounded by forests reminded me to Alan Wake (wich is a better game) and the building near the beggining where you met the ghost assasin, it is well designed, I like the art of that place.
<br>The story is very interesting and the music is non existent as far as I know.
<br>Finally, this game is good but it should have been so much better, they give players an open world that is not very well implemented, they should just give us a linear game.
<br>
<br>Good +
<br>+ Great atmosphere, good level design
<br>+ Survival Horror elements
<br>+ Improved gameplay compared to the 1st game
<br>+ Nice plot
<br>
<br>Bad -
<br>- Stealth elements have some flaws
<br>- Uninspired and repetitive combat mechanics
<br>- The open world system does not work for this one
<br>- Complex RPG elements that should not be in a real survival horror game</span><span class="blurb_etc">&#x2026;</span> <a rel="nofollow" class="toggle_expand_collapse toggle_expand" href="/game/pc/the-evil-within-2/user-reviews?user_review_id=7637570">Expand</a></span>
            </div>
                            </div>
                                                        <div class="review_section review_actions ">
                                <ul class="review_actions">
                                                                            <li class="review_action review_helpful">
                                            <div class="review_helpful">
    <div class="rating_thumbs">
        			<div class="helpful_summary thumb_count">
				<a href="https://secure.metacritic.com/login">
				<span class="total_ups">0</span>
				of 
				<span class="total_thumbs">0</span>
				users found this helpful
                </a>
			</div>
                <div style="clear:both;"></div>
    </div>
</div>
                                        </li>
                                                                                                                                                <li class="review_action">
                                        <a href="/user/Ramiro1992">All this user&apos;s reviews</a>
                                    </li>
                                                                    </ul>
                            </div>
                            
                                                    </div>
                    </div></div></div></div>
                </li>
                                                                                    <li id="user_review_7714149" class="review user_review">
                    <div class="review_btm review_btm_r"><div class="review_btm review_btm_l"><div class="review_top review_top_r"><div class="review_top review_top_l">
                        <div class="review_content">
                            <div class="review_section">
                                <div class="review_stats">
                                    <div class="review_critic">
                                        <div class="name">
                                                                                            <a href="/user/AstiX">AstiX</a>
                                                                                                                                </div>

                                                                                    <div class="date">Nov 13, 2017</div>
                                                                            </div>
                                    
                                    <div class="review_grade">
                                                
<div class="metascore_w user medium game positive indiv">9</div>

                                    </div>
                                </div>
                                <div class="review_body">
                                                        
                                        <span class="inline_expand_collapse inline_collapsed" id="review_blurb_7714149"><span class="blurb blurb_collapsed">Fantastic gameplay. Smooth, very well paced, great controls and a very satisfying upgrade system. I had so much fun, especially when playing stealthily. Graphics are pretty as well, except for the awful anti-aliasing. Well optimized. I&apos;d definitely even play it again.
<br>
<br>The story is ok, but it&apos;s riddled with cringeworthy cliches, ridiculous cutscenes with bad acting, unnessessary</span><span class="blurb blurb_expanded">Fantastic gameplay. Smooth, very well paced, great controls and a very satisfying upgrade system. I had so much fun, especially when playing stealthily. Graphics are pretty as well, except for the awful anti-aliasing. Well optimized. I&apos;d definitely even play it again.
<br>
<br>The story is ok, but it&apos;s riddled with cringeworthy cliches, ridiculous cutscenes with bad acting, unnessessary melodrama and bland characters. I expected this from The Evil Within, but come on, at least try!
<br>
<br>The game is so amazing, however, that it makes up for all of that.</span><span class="blurb_etc">&#x2026;</span> <a rel="nofollow" class="toggle_expand_collapse toggle_expand" href="/game/pc/the-evil-within-2/user-reviews?user_review_id=7714149">Expand</a></span>
            </div>
                            </div>
                                                        <div class="review_section review_actions ">
                                <ul class="review_actions">
                                                                            <li class="review_action review_helpful">
                                            <div class="review_helpful">
    <div class="rating_thumbs">
        			<div class="helpful_summary thumb_count">
				<a href="https://secure.metacritic.com/login">
				<span class="total_ups">0</span>
				of 
				<span class="total_thumbs">0</span>
				users found this helpful
                </a>
			</div>
                <div style="clear:both;"></div>
    </div>
</div>
                                        </li>
                                                                                                                                                <li class="review_action">
                                        <a href="/user/AstiX">All this user&apos;s reviews</a>
                                    </li>
                                                                    </ul>
                            </div>
                            
                                                    </div>
                    </div></div></div></div>
                </li>
                                                                                    <li id="user_review_7631243" class="review user_review">
                    <div class="review_btm review_btm_r"><div class="review_btm review_btm_l"><div class="review_top review_top_r"><div class="review_top review_top_l">
                        <div class="review_content">
                            <div class="review_section">
                                <div class="review_stats">
                                    <div class="review_critic">
                                        <div class="name">
                                                                                            <a href="/user/Hack">Hack</a>
                                                                                                                                </div>

                                                                                    <div class="date">Oct 22, 2017</div>
                                                                            </div>
                                    
                                    <div class="review_grade">
                                                
<div class="metascore_w user medium game positive indiv">8</div>

                                    </div>
                                </div>
                                <div class="review_body">
                                                        
                                        <span class="inline_expand_collapse inline_collapsed" id="review_blurb_7631243"><span class="blurb blurb_collapsed">Overall a very good game, with enjoyable combat and gameplay mechanics. The voice work was solid throughout, although the script was a bit hit or miss. Visually it was decent, but nothing that will blow you away, although the mob design was excellent, the final boss is one of the best looking I&apos;ve ever seen. Technically is where the game falls short, the PC port is not good as highlighted</span><span class="blurb blurb_expanded">Overall a very good game, with enjoyable combat and gameplay mechanics. The voice work was solid throughout, although the script was a bit hit or miss. Visually it was decent, but nothing that will blow you away, although the mob design was excellent, the final boss is one of the best looking I&apos;ve ever seen. Technically is where the game falls short, the PC port is not good as highlighted by Digital Foundry and other tech websites, it&apos;s impossible to get a fully locked 1080p/60fps experience regardless of hardware.  I ended up playing at 900p which offered 60fps most of the time, without compromising the visuals too much. I&apos;m hoping the developers will patch it sometime in the future, if you&apos;re not dying to play it now I&apos;d wait until they do because it&apos;s a really good game, but the performance issues do harm the overall product.</span><span class="blurb_etc">&#x2026;</span> <a rel="nofollow" class="toggle_expand_collapse toggle_expand" href="/game/pc/the-evil-within-2/user-reviews?user_review_id=7631243">Expand</a></span>
            </div>
                            </div>
                                                        <div class="review_section review_actions ">
                                <ul class="review_actions">
                                                                            <li class="review_action review_helpful">
                                            <div class="review_helpful">
    <div class="rating_thumbs">
        			<div class="helpful_summary thumb_count">
				<a href="https://secure.metacritic.com/login">
				<span class="total_ups">0</span>
				of 
				<span class="total_thumbs">0</span>
				users found this helpful
                </a>
			</div>
                <div style="clear:both;"></div>
    </div>
</div>
                                        </li>
                                                                                                                                                <li class="review_action">
                                        <a href="/user/Hack">All this user&apos;s reviews</a>
                                    </li>
                                                                    </ul>
                            </div>
                            
                                                    </div>
                    </div></div></div></div>
                </li>
                                                                                    <li id="user_review_7601683" class="review user_review">
                    <div class="review_btm review_btm_r"><div class="review_btm review_btm_l"><div class="review_top review_top_r"><div class="review_top review_top_l">
                        <div class="review_content">
                            <div class="review_section">
                                <div class="review_stats">
                                    <div class="review_critic">
                                        <div class="name">
                                                                                            <a href="/user/SuperkenGaming">SuperkenGaming</a>
                                                                                                                                </div>

                                                                                    <div class="date">Oct 15, 2017</div>
                                                                            </div>
                                    
                                    <div class="review_grade">
                                                
<div class="metascore_w user medium game mixed indiv">7</div>

                                    </div>
                                </div>
                                <div class="review_body">
                                                        
                                        <span class="inline_expand_collapse inline_collapsed" id="review_blurb_7601683"><span class="blurb blurb_collapsed">The Evil Within 2
<br>Not enough of its own thing
<br>The Evil within 2 a quote unquote Survival horror game where you once again play as Sebastian...
This time however the story is much more personal and therefore miles better than the original as you&#x2019;re out to save your daughter instead of chase after a lunatic&#x2026;
The story has some touching moment and is greatly told&#x2026; easily the best part of</span><span class="blurb blurb_expanded">The Evil Within 2
<br>Not enough of its own thing
<br>The Evil within 2 a quote unquote Survival horror game where you once again play as Sebastian...
<br>This time however the story is much more personal and therefore miles better than the original as you&#x2019;re out to save your daughter instead of chase after a lunatic&#x2026;
<br>The story has some touching moment and is greatly told&#x2026; easily the best part of this experience&#x2026;
<br>The rest of the game though for the most part in my opinion is a step in the wrong direction&#x2026;
<br>This game calls itself a horror game, but to me this 12 and a half hours felt more like an action 3rd person shooter zombie game with sprinkles of horror.. especially compared to the first&#x2026;
<br>there are the occasional monsters like the first game, and there are a few really great chapters here, especially in the beginning&#x2026;
<br>But The Evil Within 2 went more the route of an open world supply gathering stealth game than a linear puzzle solving horror game like the original..
<br>The makes for a really good action game... not for a very good horror games as I find zombies to be more annoying than they are scary&#x2026;
<br>The Evil Within 2 is essentially taking Resident Evil 4, Silent Hills, The Evil Within, and The Last of Us and throwing it into a blender, but never quite being as good as any of those 4 parts&#x2026;
<br>The first half of the game is more open worldy, where you&#x2019;re in a creep town called union..
<br>There are side quests all around this town that will lead to creepy encounter, enemies to kill for their goo... but more importantly weapons&#x2026;
<br>IF you want all the weapons in this game you have to actually work for them&#x2026;
<br>I didn&#x2019;t dislike this section of the game&#x2026; I just could&#x2019;ve definitely done without it&#x2026;
<br>I was tense while exploring this tiny town trying my hardest to not alarm enemies, kill them for their goo get what I can and get out&#x2026; go back to the safe house, upgrade my weapons with the scraps I found a round a get back out there&#x2026;
<br>Which is where the last of us influence comes into play&#x2026;
<br>The light crafting system here for ammo and medpacks is heavily inspired by the last of us, and you can craft items on the go, but doing so at a crafting table uses less materials, so is worth searching for..
<br>Speaking of the green goo...
<br>the nurse lady in the mirror is back to help you on your journey to save your daughter... letting you upgrade your health, combat, and stealth in a skill tree in exchange..
<br>You&#x2019;ll also be able to take to a shooting range for rewards to help upgrade your character...
<br>Stealth this time around feels a little clunky to me and enemies are annoyingly unpredictable&#x2026; where I found them turning around right before I was ready to get them from behind with a quick kill&#x2026;
<br>though combat isn&#x2019;t too difficult, as most will go down with a couple nice headshots, ammo seems to be pretty readily available, and you&#x2019;re able to pick up axes that work as a 1 hit kill melee attack.. .though you do have a knife if you&#x2019;re out of ammo or materials to craft more... which is a situation I never found myself in&#x2026;
<br>Especially thanks to the safe houses in this game where you can stock up on a few bullets and refill your health with a cup of coffee so you can save your syringes and med packs for boss fights&#x2026;
<br>The best part of this game is when you get back into the main storyline&#x2026;
<br>There are a great number of characters you&#x2019;ll run into, hate, and even care for&#x2026;
<br>And some of the missions do the cool layers of fear thing where you turn around and the room is changed or there&#x2019;s a door there that wasn&#x2019;t there before&#x2026; really creeping you out&#x2026;
<br>Sadly these creepy moments only exist in the first half and the horror aspects completely disappear until something else happens for a brief moment that ties into the first game that I won&#x2019;t spoil, but it just reminded me of the potential of this series and made me sad when the game continued and I was just back to feeling like I was Nathan drake with none of the charm having a weird nightmare&#x2026;
<br>I was a huge fan of the original evil within until a game breaking bug stopped me from completing it&#x2026;
<br>Thankfully the evil within 2 is much more polished and I ran into 0 bugs the whole time&#x2026;
<br>It&#x2019;s just not what I wanted from it&#x2026;
<br>The Evil Within 2 feels like a completely different game than the original..
<br>It&#x2019;s just lacking in the horror field... I&#x2019;m tired of zombies&#x2026;
<br>But for what it is, this is a really good action game&#x2026;
<br>I give The Evil Within 2
<br>a 7.5/10</span><span class="blurb_etc">&#x2026;</span> <a rel="nofollow" class="toggle_expand_collapse toggle_expand" href="/game/pc/the-evil-within-2/user-reviews?user_review_id=7601683">Expand</a></span>
            </div>
                            </div>
                                                        <div class="review_section review_actions ">
                                <ul class="review_actions">
                                                                            <li class="review_action review_helpful">
                                            <div class="review_helpful">
    <div class="rating_thumbs">
        			<div class="helpful_summary thumb_count">
				<a href="https://secure.metacritic.com/login">
				<span class="total_ups">0</span>
				of 
				<span class="total_thumbs">0</span>
				users found this helpful
                </a>
			</div>
                <div style="clear:both;"></div>
    </div>
</div>
                                        </li>
                                                                                                                                                <li class="review_action">
                                        <a href="/user/SuperkenGaming">All this user&apos;s reviews</a>
                                    </li>
                                                                    </ul>
                            </div>
                            
                                                    </div>
                    </div></div></div></div>
                </li>
                                                                                    <li id="user_review_7598330" class="review user_review">
                    <div class="review_btm review_btm_r"><div class="review_btm review_btm_l"><div class="review_top review_top_r"><div class="review_top review_top_l">
                        <div class="review_content">
                            <div class="review_section">
                                <div class="review_stats">
                                    <div class="review_critic">
                                        <div class="name">
                                                                                            <a href="/user/LifeHistory">LifeHistory</a>
                                                                                                                                </div>

                                                                                    <div class="date">Oct 29, 2017</div>
                                                                            </div>
                                    
                                    <div class="review_grade">
                                                
<div class="metascore_w user medium game positive indiv">9</div>

                                    </div>
                                </div>
                                <div class="review_body">
                                                        
                                        <span class="inline_expand_collapse inline_collapsed" id="review_blurb_7598330"><span class="blurb blurb_collapsed">I loved the first game, its one of the best games out there and I did not understand the hate people gave it.
<br>This one is an OpenWorld yet it has chapters just like the original. The exploring is incredibly fun. Sneaking and killing monsters and finding loots is satisfying. The graphics are good and alive with level details and a story driven game but so was the first game and beautiful</span><span class="blurb blurb_expanded">I loved the first game, its one of the best games out there and I did not understand the hate people gave it.
<br>This one is an OpenWorld yet it has chapters just like the original. The exploring is incredibly fun. Sneaking and killing monsters and finding loots is satisfying. The graphics are good and alive with level details and a story driven game but so was the first game and beautiful art.
<br>
<br>Open world games are usually boring with less details and less quality. Some Open world games are made in a right way which makes them quality and this one is one of these game that gives you quality.
<br>
<br>I don&apos;t understand the people who are saying its copy-paste from many games. First of all its NOT. And second of all there is nothing wrong with taking ideas from other games as long as they being executed and done right which is what this game exactly have done.
<br>
<br>The ONLY DOWN side is that these &quot;zombies&quot; have glowing eyes which I hate because it makes them less serious and not scary at all. And There are no gun suppressor in the game which is sad because its gives the game less stealthy mechanics.
<br>
<br>All in All I am loving the hell of it and exploring every inch of the game. Not every day we get such an awesome survivor horror game and that&apos;s why you should enjoy it fully.
<br>
<br>If you loved the first game you will definitely love this one!</span><span class="blurb_etc">&#x2026;</span> <a rel="nofollow" class="toggle_expand_collapse toggle_expand" href="/game/pc/the-evil-within-2/user-reviews?user_review_id=7598330">Expand</a></span>
            </div>
                            </div>
                                                        <div class="review_section review_actions ">
                                <ul class="review_actions">
                                                                            <li class="review_action review_helpful">
                                            <div class="review_helpful">
    <div class="rating_thumbs">
        			<div class="helpful_summary thumb_count">
				<a href="https://secure.metacritic.com/login">
				<span class="total_ups">0</span>
				of 
				<span class="total_thumbs">0</span>
				users found this helpful
                </a>
			</div>
                <div style="clear:both;"></div>
    </div>
</div>
                                        </li>
                                                                                                                                                <li class="review_action">
                                        <a href="/user/LifeHistory">All this user&apos;s reviews</a>
                                    </li>
                                                                    </ul>
                            </div>
                            
                                                    </div>
                    </div></div></div></div>
                </li>
                                                                                    <li id="user_review_7614142" class="review user_review">
                    <div class="review_btm review_btm_r"><div class="review_btm review_btm_l"><div class="review_top review_top_r"><div class="review_top review_top_l">
                        <div class="review_content">
                            <div class="review_section">
                                <div class="review_stats">
                                    <div class="review_critic">
                                        <div class="name">
                                                                                            <a href="/user/Henry0012">Henry0012</a>
                                                                                                                                </div>

                                                                                    <div class="date">Oct 18, 2017</div>
                                                                            </div>
                                    
                                    <div class="review_grade">
                                                
<div class="metascore_w user medium game positive indiv">8</div>

                                    </div>
                                </div>
                                <div class="review_body">
                                                        
                                        <span class="inline_expand_collapse inline_collapsed" id="review_blurb_7614142"><span class="blurb blurb_collapsed">Overall a much better package than the previous one.
<br>
<br>Pros:
The survival horror. The atmosphere of this game is very interesting and can be right down horror in some cases. Low carry capacity for each weapon means every shot counts. The combat itself is a bit improved and it encourages stealth approach due to lack of resource in higher difficulty setting. Also there&apos;s not much QWE, so</span><span class="blurb blurb_expanded">Overall a much better package than the previous one.
<br>
<br>Pros:
<br>The survival horror. The atmosphere of this game is very interesting and can be right down horror in some cases. Low carry capacity for each weapon means every shot counts. The combat itself is a bit improved and it encourages stealth approach due to lack of resource in higher difficulty setting. Also there&apos;s not much QWE, so no cheap death like the first game.
<br>
<br>Characters are relatable and voice acting is improved. The story is better in the sense that it doesn&apos;t leave you with more questions than answers like its previous game.
<br>
<br>Cons:
<br>The story stretches thin sometimes to fit a rather big plotline. So some of the characters feel a bit &quot;rush&quot; and anti-climatic at the end. Plot holes are still there and there&apos;s not much follow-up with whatever happened in the first game.
<br>
<br>For gameplay, combat can feel repetitive as many monsters are kind of just a reskinned version of the previous game. I would argue that Evil Within 1 probably has more interesting monsters than this one. There&apos;s also no puzzle in this game. If there is one, it&apos;s too easy.</span><span class="blurb_etc">&#x2026;</span> <a rel="nofollow" class="toggle_expand_collapse toggle_expand" href="/game/pc/the-evil-within-2/user-reviews?user_review_id=7614142">Expand</a></span>
            </div>
                            </div>
                                                        <div class="review_section review_actions ">
                                <ul class="review_actions">
                                                                            <li class="review_action review_helpful">
                                            <div class="review_helpful">
    <div class="rating_thumbs">
        			<div class="helpful_summary thumb_count">
				<a href="https://secure.metacritic.com/login">
				<span class="total_ups">0</span>
				of 
				<span class="total_thumbs">0</span>
				users found this helpful
                </a>
			</div>
                <div style="clear:both;"></div>
    </div>
</div>
                                        </li>
                                                                                                                                                <li class="review_action">
                                        <a href="/user/Henry0012">All this user&apos;s reviews</a>
                                    </li>
                                                                    </ul>
                            </div>
                            
                                                    </div>
                    </div></div></div></div>
                </li>
                                                                                    <li id="user_review_7625678" class="review user_review">
                    <div class="review_btm review_btm_r"><div class="review_btm review_btm_l"><div class="review_top review_top_r"><div class="review_top review_top_l">
                        <div class="review_content">
                            <div class="review_section">
                                <div class="review_stats">
                                    <div class="review_critic">
                                        <div class="name">
                                                                                            <a href="/user/CaptainTemplar">CaptainTemplar</a>
                                                                                                                                </div>

                                                                                    <div class="date">Oct 21, 2017</div>
                                                                            </div>
                                    
                                    <div class="review_grade">
                                                
<div class="metascore_w user medium game positive indiv perfect">10</div>

                                    </div>
                                </div>
                                <div class="review_body">
                                                        
                                        <span>A great game. 10/10. Would recommend to anyone that finds horror games interesting. The evil within 2 is a great sequel too, improving everything was in the first and offering even more interesting contents.</span>
            </div>
                            </div>
                                                        <div class="review_section review_actions ">
                                <ul class="review_actions">
                                                                            <li class="review_action review_helpful">
                                            <div class="review_helpful">
    <div class="rating_thumbs">
        			<div class="helpful_summary thumb_count">
				<a href="https://secure.metacritic.com/login">
				<span class="total_ups">0</span>
				of 
				<span class="total_thumbs">0</span>
				users found this helpful
                </a>
			</div>
                <div style="clear:both;"></div>
    </div>
</div>
                                        </li>
                                                                                                                                                <li class="review_action">
                                        <a href="/user/CaptainTemplar">All this user&apos;s reviews</a>
                                    </li>
                                                                    </ul>
                            </div>
                            
                                                    </div>
                    </div></div></div></div>
                </li>
                                                                                    <li id="user_review_7741289" class="review user_review">
                    <div class="review_btm review_btm_r"><div class="review_btm review_btm_l"><div class="review_top review_top_r"><div class="review_top review_top_l">
                        <div class="review_content">
                            <div class="review_section">
                                <div class="review_stats">
                                    <div class="review_critic">
                                        <div class="name">
                                                                                            <a href="/user/El112119">El112119</a>
                                                                                                                                </div>

                                                                                    <div class="date">Nov 16, 2017</div>
                                                                            </div>
                                    
                                    <div class="review_grade">
                                                
<div class="metascore_w user medium game positive indiv">9</div>

                                    </div>
                                </div>
                                <div class="review_body">
                                                        
                                        <span class="inline_expand_collapse inline_collapsed" id="review_blurb_7741289"><span class="blurb blurb_collapsed">First of, the game RUN sooo SMOOTH on my GTX 1050, unlike the first one that was barely unplayable 15-25 fps, The Evil Within 2 is just soo much better like x2 better than the original, the setting is great, a bit of familiar on the world of the first one, but this time it&apos;s more open and a lot of exploration you can do to this world, story of event that had happen can be discovered by</span><span class="blurb blurb_expanded">First of, the game RUN sooo SMOOTH on my GTX 1050, unlike the first one that was barely unplayable 15-25 fps, The Evil Within 2 is just soo much better like x2 better than the original, the setting is great, a bit of familiar on the world of the first one, but this time it&apos;s more open and a lot of exploration you can do to this world, story of event that had happen can be discovered by exploring, and the Big POINTS, why this game is sooo much better is that i care about Sebastian&apos;s goal and his character, than the first game, and so are the side characters you can meet in the world, there are side missions as well but which is there to be rewarded by items you need.
<br>
<br>so all in all, great story, and a great ending, good characters, and over all it&apos;s just a great GAME.
<br>
<br>if you like a silent hill-ish type and a bit of a last of us gameplay and story, then this game is a must play.
<br>
<br>i would actually do a NG+ on this, cause i might have other areas i haven&apos;t explored
<br>
<br>took me 17hr. to complete my first playthrough
<br>
<br>a GREAT GAME, thanks shinji mikami</span><span class="blurb_etc">&#x2026;</span> <a rel="nofollow" class="toggle_expand_collapse toggle_expand" href="/game/pc/the-evil-within-2/user-reviews?user_review_id=7741289">Expand</a></span>
            </div>
                            </div>
                                                        <div class="review_section review_actions ">
                                <ul class="review_actions">
                                                                            <li class="review_action review_helpful">
                                            <div class="review_helpful">
    <div class="rating_thumbs">
        			<div class="helpful_summary thumb_count">
				<a href="https://secure.metacritic.com/login">
				<span class="total_ups">0</span>
				of 
				<span class="total_thumbs">0</span>
				users found this helpful
                </a>
			</div>
                <div style="clear:both;"></div>
    </div>
</div>
                                        </li>
                                                                                                                                                <li class="review_action">
                                        <a href="/user/El112119">All this user&apos;s reviews</a>
                                    </li>
                                                                    </ul>
                            </div>
                            
                                                    </div>
                    </div></div></div></div>
                </li>
                                                                                    <li id="user_review_7600982" class="review user_review">
                    <div class="review_btm review_btm_r"><div class="review_btm review_btm_l"><div class="review_top review_top_r"><div class="review_top review_top_l">
                        <div class="review_content">
                            <div class="review_section">
                                <div class="review_stats">
                                    <div class="review_critic">
                                        <div class="name">
                                                                                            <a href="/user/Noul">Noul</a>
                                                                                                                                </div>

                                                                                    <div class="date">Oct 15, 2017</div>
                                                                            </div>
                                    
                                    <div class="review_grade">
                                                
<div class="metascore_w user medium game positive indiv perfect">10</div>

                                    </div>
                                </div>
                                <div class="review_body">
                                                        
                                        <span class="inline_expand_collapse inline_collapsed" id="review_blurb_7600982"><span class="blurb blurb_collapsed">Shinji Mikami hit harder with this sequel. The best new iteration they could come over with. A spellbinding atmosphere is at work coupled with a more accurate gameplay. The scenario has been the target of the developers this time giving raise to a much more heady depiction of Sebastian Castellanos. Breathtaking cutscenes, well optimised (running with a 1070), more accurate aiming system</span><span class="blurb blurb_expanded">Shinji Mikami hit harder with this sequel. The best new iteration they could come over with. A spellbinding atmosphere is at work coupled with a more accurate gameplay. The scenario has been the target of the developers this time giving raise to a much more heady depiction of Sebastian Castellanos. Breathtaking cutscenes, well optimised (running with a 1070), more accurate aiming system and a really fair amount of content. Great survial horror experience.</span><span class="blurb_etc">&#x2026;</span> <a rel="nofollow" class="toggle_expand_collapse toggle_expand" href="/game/pc/the-evil-within-2/user-reviews?user_review_id=7600982">Expand</a></span>
            </div>
                            </div>
                                                        <div class="review_section review_actions ">
                                <ul class="review_actions">
                                                                            <li class="review_action review_helpful">
                                            <div class="review_helpful">
    <div class="rating_thumbs">
        			<div class="helpful_summary thumb_count">
				<a href="https://secure.metacritic.com/login">
				<span class="total_ups">0</span>
				of 
				<span class="total_thumbs">0</span>
				users found this helpful
                </a>
			</div>
                <div style="clear:both;"></div>
    </div>
</div>
                                        </li>
                                                                                                                                                <li class="review_action">
                                        <a href="/user/Noul">All this user&apos;s reviews</a>
                                    </li>
                                                                    </ul>
                            </div>
                            
                                                    </div>
                    </div></div></div></div>
                </li>
                                                                                    <li id="user_review_7650367" class="review user_review">
                    <div class="review_btm review_btm_r"><div class="review_btm review_btm_l"><div class="review_top review_top_r"><div class="review_top review_top_l">
                        <div class="review_content">
                            <div class="review_section">
                                <div class="review_stats">
                                    <div class="review_critic">
                                        <div class="name">
                                                                                            <a href="/user/Bellybutton">Bellybutton</a>
                                                                                                                                </div>

                                                                                    <div class="date">Oct 28, 2017</div>
                                                                            </div>
                                    
                                    <div class="review_grade">
                                                
<div class="metascore_w user medium game negative indiv">4</div>

                                    </div>
                                </div>
                                <div class="review_body">
                    <strong>
            This review contains spoilers, click expand to view.
        </strong>
                                            
                                        <span class="inline_expand_collapse inline_collapsed" id="review_blurb_7650367"><span class="blurb blurb_collapsed"></span><span class="blurb blurb_expanded">What bothered me the most is the repetitive storytelling with needles plot twists.
<br>I actually felt the urge to die vs the last boss, since our main character can&#xB4;t protect anything a long the entire game; shots at his own mates, has no clue what was and is going around him and manages to kill the only one possible survivor from the primary team, by roasting his brain. Also don&#xB4;t forget that tons of innocent people got killed too, since &quot;even the toilet cleaners had a chip implemented&quot;
<br>Probably the worst person to &quot;take care of&quot; other people
<br>Felt like watching a very cheesy action movie in which the hero is not the smartest guy around</span><span class="blurb_etc">&#x2026;</span> <a rel="nofollow" class="toggle_expand_collapse toggle_expand" href="/game/pc/the-evil-within-2/user-reviews?user_review_id=7650367">Expand</a></span>
            </div>
                            </div>
                                                        <div class="review_section review_actions ">
                                <ul class="review_actions">
                                                                            <li class="review_action review_helpful">
                                            <div class="review_helpful">
    <div class="rating_thumbs">
        			<div class="helpful_summary thumb_count">
				<a href="https://secure.metacritic.com/login">
				<span class="total_ups">0</span>
				of 
				<span class="total_thumbs">0</span>
				users found this helpful
                </a>
			</div>
                <div style="clear:both;"></div>
    </div>
</div>
                                        </li>
                                                                                                                                                <li class="review_action">
                                        <a href="/user/Bellybutton">All this user&apos;s reviews</a>
                                    </li>
                                                                    </ul>
                            </div>
                            
                                                    </div>
                    </div></div></div></div>
                </li>
                                                                                    <li id="user_review_7686418" class="review user_review last_review">
                    <div class="review_btm review_btm_r"><div class="review_btm review_btm_l"><div class="review_top review_top_r"><div class="review_top review_top_l">
                        <div class="review_content">
                            <div class="review_section">
                                <div class="review_stats">
                                    <div class="review_critic">
                                        <div class="name">
                                                                                            <a href="/user/Aginagala">Aginagala</a>
                                                                                                                                </div>

                                                                                    <div class="date">Nov  5, 2017</div>
                                                                            </div>
                                    
                                    <div class="review_grade">
                                                
<div class="metascore_w user medium game mixed indiv">6</div>

                                    </div>
                                </div>
                                <div class="review_body">
                                                        
                                        <span class="inline_expand_collapse inline_collapsed" id="review_blurb_7686418"><span class="blurb blurb_collapsed">Although being a great game the controls of it felt very clunky and at times frustrating. The gun controls are very difficult to control and actually getting off shots is very difficult at times making me frustrated with the game rather than actually enjoying it. However it is a very immersive horror experience, and I do feel properly scared when I&apos;m playing it, that aspect of the game,</span><span class="blurb blurb_expanded">Although being a great game the controls of it felt very clunky and at times frustrating. The gun controls are very difficult to control and actually getting off shots is very difficult at times making me frustrated with the game rather than actually enjoying it. However it is a very immersive horror experience, and I do feel properly scared when I&apos;m playing it, that aspect of the game, worked very well.</span><span class="blurb_etc">&#x2026;</span> <a rel="nofollow" class="toggle_expand_collapse toggle_expand" href="/game/pc/the-evil-within-2/user-reviews?user_review_id=7686418">Expand</a></span>
            </div>
                            </div>
                                                        <div class="review_section review_actions ">
                                <ul class="review_actions">
                                                                            <li class="review_action review_helpful">
                                            <div class="review_helpful">
    <div class="rating_thumbs">
        			<div class="helpful_summary thumb_count">
				<a href="https://secure.metacritic.com/login">
				<span class="total_ups">0</span>
				of 
				<span class="total_thumbs">0</span>
				users found this helpful
                </a>
			</div>
                <div style="clear:both;"></div>
    </div>
</div>
                                        </li>
                                                                                                                                                <li class="review_action">
                                        <a href="/user/Aginagala">All this user&apos;s reviews</a>
                                    </li>
                                                                    </ul>
                            </div>
                            
                                                    </div>
                    </div></div></div></div>
                </li>
                                            