
                                                            <li id="user_review_742285" class="review user_review first_review">
                    <div class="review_btm review_btm_r"><div class="review_btm review_btm_l"><div class="review_top review_top_r"><div class="review_top review_top_l">
                        <div class="review_content">
                            <div class="review_section">
                                <div class="review_stats">
                                    <div class="review_critic">
                                        <div class="name">
                                                                                            <span>JakeL</span>
                                                                                                                                </div>

                                                                                    <div class="date">Dec 26, 2009</div>
                                                                            </div>
                                    
                                    <div class="review_grade">
                                                
<div class="metascore_w user medium game positive indiv">8</div>

                                    </div>
                                </div>
                                <div class="review_body">
                                                        
                                        <span> In the immense world of shooter games, we cannot miss some Vietnam shooter games. In 2005, many of them came out,... but one above all, has a large potential and is a combination of such successful games like Left 4 Dead, Counter-strike, Call of Duty...Despite some &quot;serious&quot; technical problems, it still stays out as one of the bests.</span>
            </div>
                            </div>
                                                        <div class="review_section review_actions ">
                                <ul class="review_actions">
                                                                            <li class="review_action review_helpful">
                                            <div class="review_helpful">
    <div class="rating_thumbs">
        			<div class="helpful_summary thumb_count">
				<a href="https://secure.metacritic.com/login">
				<span class="total_ups">0</span>
				of 
				<span class="total_thumbs">0</span>
				users found this helpful
                </a>
			</div>
                <div style="clear:both;"></div>
    </div>
</div>
                                        </li>
                                                                                                                                            </ul>
                            </div>
                            
                                                    </div>
                    </div></div></div></div>
                </li>
                                                                                    <li id="user_review_386015" class="review user_review">
                    <div class="review_btm review_btm_r"><div class="review_btm review_btm_l"><div class="review_top review_top_r"><div class="review_top review_top_l">
                        <div class="review_content">
                            <div class="review_section">
                                <div class="review_stats">
                                    <div class="review_critic">
                                        <div class="name">
                                                                                            <span>Alan</span>
                                                                                                                                </div>

                                                                                    <div class="date">Mar 11, 2006</div>
                                                                            </div>
                                    
                                    <div class="review_grade">
                                                
<div class="metascore_w user medium game negative indiv">3</div>

                                    </div>
                                </div>
                                <div class="review_body">
                                                        
                                        <span> Disappointing, hard, slows even on a top spec pc, graphics not great. Loved the 1st version - much better than htis and by now far cheaper. Wait another 6 months and pick this up from ther bargain bin.</span>
            </div>
                            </div>
                                                        <div class="review_section review_actions ">
                                <ul class="review_actions">
                                                                            <li class="review_action review_helpful">
                                            <div class="review_helpful">
    <div class="rating_thumbs">
        			<div class="helpful_summary thumb_count">
				<a href="https://secure.metacritic.com/login">
				<span class="total_ups">0</span>
				of 
				<span class="total_thumbs">0</span>
				users found this helpful
                </a>
			</div>
                <div style="clear:both;"></div>
    </div>
</div>
                                        </li>
                                                                                                                                            </ul>
                            </div>
                            
                                                    </div>
                    </div></div></div></div>
                </li>
                                                                                    <li id="user_review_2551680" class="review user_review">
                    <div class="review_btm review_btm_r"><div class="review_btm review_btm_l"><div class="review_top review_top_r"><div class="review_top review_top_l">
                        <div class="review_content">
                            <div class="review_section">
                                <div class="review_stats">
                                    <div class="review_critic">
                                        <div class="name">
                                                                                            <a href="/user/hawkeman72">hawkeman72</a>
                                                                                                                                </div>

                                                                                    <div class="date">Aug  2, 2012</div>
                                                                            </div>
                                    
                                    <div class="review_grade">
                                                
<div class="metascore_w user medium game negative indiv">4</div>

                                    </div>
                                </div>
                                <div class="review_body">
                                                        
                                        <span class="inline_expand_collapse inline_collapsed" id="review_blurb_2551680"><span class="blurb blurb_collapsed">Vietcong 2 was bogged down by performance problems on launch.  Most people with even high quality rigs could not play it.  It is 2012 now, anyone with a laptop can now run it. So one might wonder what they were missing if they could not afford a rig to play this game.  The Answer? not much at all. The Original VietCong was a flawed but very rewarding game.  A squad based shooter released</span><span class="blurb blurb_expanded">Vietcong 2 was bogged down by performance problems on launch.  Most people with even high quality rigs could not play it.  It is 2012 now, anyone with a laptop can now run it. So one might wonder what they were missing if they could not afford a rig to play this game.  The Answer? not much at all. The Original VietCong was a flawed but very rewarding game.  A squad based shooter released in 2003, it brought a certain element of intensity to shooters that was not really there in games like Call of Duty and Medal of Honor.  It was a flawed game, with many bugs, bad dialogue and AI behavior, but very rewarding at times.  The shootouts actually felt like battles between two opposing sides as opposed to shooting galleries.  If you havent played it yet, I suggest checking it out.  All it really needed was a bug fix, some better graphics and better squad command and it would have been a stellar game.  So Vietcong 2 obviously fixed that right? right? right? wrong.   Vietcong 2 makes it obvious from the beginning that instead of continuing the work they started with the first game, Pterodon instead decided to cash in on the widespread popularity of the Call of Duty series.  The first thing you will notice is the movement, your character skitters about like a waterbug, kind of like in Left 4 Dead, it really takes away from the &quot;war&quot; environment.  The thing that made the first Vietcong so rewarding is that the missions felt very believable. You felt as if you were undergoing the things a real soldier in Vietnam would have gone through: Investigating villages, recovering airplane crash sites, and destroying weapon caches.  You felt like a soldier, not a superhero. This really added an element of immersion to the game.  All this goes out the window in VC2. The game starts out with you attending a party, sipping a glass of wine, when a Vietcong attack occurs.  You face literally endless ways of enemies, mowing them down in twitch shooter gameplay before escaping in a pink Cadillac which goes off a jump and flips over, then you make your way to a base where you face MORE endless waves of enemies which you mow down with an M60 while trucks and helicopters explode around you.  This is not war, its James Bond in a Vietnam setting, and theres really nothing exciting about it.  Its the same old action shooter BS we&apos;ve seen over and over again.  You spend most of the game clearing small corridors of faceless enemies and following predetermined pathways.  Many times your path will be blocked by something like a sniper or a tank. The solution to these problems is almsot always the same: wait for the marines. What? seriously? in the first game taking out snipers required you to think on your feet and solve the problem yourself.  Now all you do is follow a boring predetermined path.  The one thing that this game has going for it is weapons. There are a LOT of them.  You will wield everything from the standard M16s and AKs to WWII leftovers such as mosin nagants, Kar 98Ks, a Nagant Silenced Revolver and even a Blunderbuss.  These weapons provide little more than aesthetic variety however, as the AK-47 is pretty much the only gun youll ever need.  Overall this game has very little going for it. Its not good looking, its not interesting, its not intense, its cliche, unpleasant and boring. All the problems from the first game are present in this one, and all of the things that made the first game good are gone.</span><span class="blurb_etc">&#x2026;</span> <a rel="nofollow" class="toggle_expand_collapse toggle_expand" href="/game/pc/vietcong-2/user-reviews?user_review_id=2551680">Expand</a></span>
            </div>
                            </div>
                                                        <div class="review_section review_actions ">
                                <ul class="review_actions">
                                                                            <li class="review_action review_helpful">
                                            <div class="review_helpful">
    <div class="rating_thumbs">
        			<div class="helpful_summary thumb_count">
				<a href="https://secure.metacritic.com/login">
				<span class="total_ups">0</span>
				of 
				<span class="total_thumbs">0</span>
				users found this helpful
                </a>
			</div>
                <div style="clear:both;"></div>
    </div>
</div>
                                        </li>
                                                                                                                                                <li class="review_action">
                                        <a href="/user/hawkeman72">All this user&apos;s reviews</a>
                                    </li>
                                                                    </ul>
                            </div>
                            
                                                    </div>
                    </div></div></div></div>
                </li>
                                                                                    <li id="user_review_4538939" class="review user_review">
                    <div class="review_btm review_btm_r"><div class="review_btm review_btm_l"><div class="review_top review_top_r"><div class="review_top review_top_l">
                        <div class="review_content">
                            <div class="review_section">
                                <div class="review_stats">
                                    <div class="review_critic">
                                        <div class="name">
                                                                                            <a href="/user/zura192">zura192</a>
                                                                                                                                </div>

                                                                                    <div class="date">Sep 25, 2014</div>
                                                                            </div>
                                    
                                    <div class="review_grade">
                                                
<div class="metascore_w user medium game positive indiv perfect">10</div>

                                    </div>
                                </div>
                                <div class="review_body">
                                                        
                                        <span>I highly recommend this game to everyone. Played this game since it&apos;s release. I&apos;m really happy that they have added functionable vehicles in second part. This is great game for all gamers who don&apos;t care about graphics.</span>
            </div>
                            </div>
                                                        <div class="review_section review_actions ">
                                <ul class="review_actions">
                                                                            <li class="review_action review_helpful">
                                            <div class="review_helpful">
    <div class="rating_thumbs">
        			<div class="helpful_summary thumb_count">
				<a href="https://secure.metacritic.com/login">
				<span class="total_ups">0</span>
				of 
				<span class="total_thumbs">0</span>
				users found this helpful
                </a>
			</div>
                <div style="clear:both;"></div>
    </div>
</div>
                                        </li>
                                                                                                                                                <li class="review_action">
                                        <a href="/user/zura192">All this user&apos;s reviews</a>
                                    </li>
                                                                    </ul>
                            </div>
                            
                                                    </div>
                    </div></div></div></div>
                </li>
                                                                                    <li id="user_review_6946207" class="review user_review last_review">
                    <div class="review_btm review_btm_r"><div class="review_btm review_btm_l"><div class="review_top review_top_r"><div class="review_top review_top_l">
                        <div class="review_content">
                            <div class="review_section">
                                <div class="review_stats">
                                    <div class="review_critic">
                                        <div class="name">
                                                                                            <a href="/user/99dolar">99dolar</a>
                                                                                                                                </div>

                                                                                    <div class="date">Jan 28, 2017</div>
                                                                            </div>
                                    
                                    <div class="review_grade">
                                                
<div class="metascore_w user medium game mixed indiv">6</div>

                                    </div>
                                </div>
                                <div class="review_body">
                                                        
                                        <span class="inline_expand_collapse inline_collapsed" id="review_blurb_6946207"><span class="blurb blurb_collapsed">Oyun &#xE7;ok iyi grafiklere ve senaryoya sahip de&#x11F;il. Hatta shooting mekanikleri de biraz zorlay&#x131;c&#x131;. Ancak bir &#x15F;ekilde Vietnam&apos;da &#xF6;lmenin ne kadar oldu&#x11F;unu size hissettiriyor. Di&#x11F;er oyunlardan farkl&#x131; olarak hem amerika hem de vietnam i&#xE7;in story modu var ki &#xE7;o&#x11F;u yap&#x131;mc&#x131; buna pek cesaret edemez.  Oyunun ana ekran&#x131;nda ve credits b&#xF6;l&#xFC;m&#xFC;nde &#xE7;alan m&#xFC;thi&#x15F; gitar performanslar&#x131;n&#x131; da dinlemeden ge&#xE7;memek</span><span class="blurb blurb_expanded">Oyun &#xE7;ok iyi grafiklere ve senaryoya sahip de&#x11F;il. Hatta shooting mekanikleri de biraz zorlay&#x131;c&#x131;. Ancak bir &#x15F;ekilde Vietnam&apos;da &#xF6;lmenin ne kadar oldu&#x11F;unu size hissettiriyor. Di&#x11F;er oyunlardan farkl&#x131; olarak hem amerika hem de vietnam i&#xE7;in story modu var ki &#xE7;o&#x11F;u yap&#x131;mc&#x131; buna pek cesaret edemez.  Oyunun ana ekran&#x131;nda ve credits b&#xF6;l&#xFC;m&#xFC;nde &#xE7;alan m&#xFC;thi&#x15F; gitar performanslar&#x131;n&#x131; da dinlemeden ge&#xE7;memek laz&#x131;m.</span><span class="blurb_etc">&#x2026;</span> <a rel="nofollow" class="toggle_expand_collapse toggle_expand" href="/game/pc/vietcong-2/user-reviews?user_review_id=6946207">Expand</a></span>
            </div>
                            </div>
                                                        <div class="review_section review_actions ">
                                <ul class="review_actions">
                                                                            <li class="review_action review_helpful">
                                            <div class="review_helpful">
    <div class="rating_thumbs">
        			<div class="helpful_summary thumb_count">
				<a href="https://secure.metacritic.com/login">
				<span class="total_ups">0</span>
				of 
				<span class="total_thumbs">0</span>
				users found this helpful
                </a>
			</div>
                <div style="clear:both;"></div>
    </div>
</div>
                                        </li>
                                                                                                                                                <li class="review_action">
                                        <a href="/user/99dolar">All this user&apos;s reviews</a>
                                    </li>
                                                                    </ul>
                            </div>
                            
                                                    </div>
                    </div></div></div></div>
                </li>
                                            